#pragma once

// SMITE (8.2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SM_TgClient_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TgClient.TgGameLaunch
// 0x0000 (0x04D0 - 0x04D0)
class ATgGameLaunch : public ATgGameLaunchBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameLaunch");
		return ptr;
	}

};


// Class TgClient.TgGameViewportClient
// 0x0000 (0x01D8 - 0x01D8)
class UTgGameViewportClient : public UTgGameViewportClientBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameViewportClient");
		return ptr;
	}

};


// Class TgClient.TgGfxAchievementPopup
// 0x0000 (0x0284 - 0x0284)
class UTgGfxAchievementPopup : public UTgGfxScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAchievementPopup");
		return ptr;
	}


	void QueueAchievement();
	void STATIC_asc_QueueAchievement();
	void STATIC_Initialize(class UTgMoviePlayer* pMoviePlayer);
};


// Class TgClient.TgGfxAchievementSelection
// 0x0014 (0x0298 - 0x0284)
class UTgGfxAchievementSelection : public UTgGfxScene
{
public:
	int                                                m_requestedPlayerId;                                      // 0x0284(0x0004)
	struct FScriptDelegate                             __USC_ApplySelections_Delegate__Delegate;                 // 0x0288(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0288(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAchievementSelection");
		return ptr;
	}


	void UpdateSelectedAchievements();
	void STATIC_ASC_UpdateSelectedAchievements();
	void UpdateScreen();
	void STATIC_ASC_UpdateScreen();
	void STATIC_USC_ApplySelections(int as1, int as2, int as3, int as4);
	void USC_ApplySelections_Delegate(int as1, int as2, int as3, int as4);
	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxAdventureProgress
// 0x0008 (0x028C - 0x0284)
class UTgGfxAdventureProgress : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                            // 0x0284(0x0004)
	int                                                m_nVictoryLaps;                                           // 0x0288(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAdventureProgress");
		return ptr;
	}


	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_Uninitialize();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxAdventureProgressDungeon2
// 0x0014 (0x0298 - 0x0284)
class UTgGfxAdventureProgressDungeon2 : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                            // 0x0284(0x0004)
	int                                                m_nBundleId;                                              // 0x0288(0x0004)
	int                                                m_nStatueActivityId;                                      // 0x028C(0x0004)
	int                                                m_nStatueGoalId;                                          // 0x0290(0x0004)
	int                                                m_nStatueCompleteGoalId;                                  // 0x0294(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAdventureProgressDungeon2");
		return ptr;
	}


	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_Uninitialize();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxAdventureProgressFox
// 0x0034 (0x02B8 - 0x0284)
class UTgGfxAdventureProgressFox : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                            // 0x0284(0x0004)
	int                                                m_nBundleId;                                              // 0x0288(0x0004)
	int                                                m_nChestItemId;                                           // 0x028C(0x0004)
	int                                                m_nPointBundleId;                                         // 0x0290(0x0004)
	int                                                m_nFox1LTI;                                               // 0x0294(0x0004)
	int                                                m_nFox2LTI;                                               // 0x0298(0x0004)
	int                                                m_nFox3LTI;                                               // 0x029C(0x0004)
	int                                                m_nFox4LTI;                                               // 0x02A0(0x0004)
	int                                                m_nFox1ItemId;                                            // 0x02A4(0x0004)
	int                                                m_nFox2ItemId;                                            // 0x02A8(0x0004)
	int                                                m_nFox3ItemId;                                            // 0x02AC(0x0004)
	int                                                m_nFox4ItemId;                                            // 0x02B0(0x0004)
	unsigned long                                      b_chestPurchaseLock : 1;                                  // 0x02B4(0x0004)
	unsigned long                                      b_requestedChestPurchase : 1;                             // 0x02B4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAdventureProgressFox");
		return ptr;
	}


	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_SetupChestPurchaseFox();
	void STATIC_Uninitialize();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxAdventureProgressMMO
// 0x0008 (0x028C - 0x0284)
class UTgGfxAdventureProgressMMO : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                            // 0x0284(0x0004)
	int                                                m_nBundleId;                                              // 0x0288(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAdventureProgressMMO");
		return ptr;
	}


	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_Uninitialize();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxAdventuresHub
// 0x0074 (0x02F8 - 0x0284)
class UTgGfxAdventuresHub : public UTgGfxScene
{
public:
	int                                                m_nBundleId;                                              // 0x0284(0x0004)
	int                                                m_nChestItemId;                                           // 0x0288(0x0004)
	int                                                m_nPointBundleLTI;                                        // 0x028C(0x0004)
	unsigned long                                      b_chestPurchaseLock : 1;                                  // 0x0290(0x0004)
	unsigned long                                      b_requestedChestPurchase : 1;                             // 0x0290(0x0004)
	int                                                m_nCurrentQueueId;                                        // 0x0294(0x0004)
	int                                                m_nChestLTI;                                              // 0x0298(0x0004)
	int                                                m_nPointLTI;                                              // 0x029C(0x0004)
	int                                                m_nItemLTI1;                                              // 0x02A0(0x0004)
	int                                                m_nItemLTI2;                                              // 0x02A4(0x0004)
	int                                                m_nItemLTI3;                                              // 0x02A8(0x0004)
	int                                                m_nItemLTI4;                                              // 0x02AC(0x0004)
	int                                                m_nCurrentAdventureItem;                                  // 0x02B0(0x0004)
	int                                                m_nActivityId;                                            // 0x02B4(0x0004)
	struct FScriptDelegate                             __USC_SetUserViewedEvent_Delegate__Delegate;              // 0x02B8(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02B8(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_GetAdventureLeaderboard_Delegate__Delegate;         // 0x02C8(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02C8(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_GotoVault_Delegate__Delegate;                       // 0x02D8(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                                       // 0x02D8(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_OpenEventCam_Delegate__Delegate;                    // 0x02E8(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData03[0x4];                                       // 0x02E8(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxAdventuresHub");
		return ptr;
	}


	void SceneTick(float Delta);
	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_SetBundleOwnership();
	void STATIC_TriggerLobbyEventHub(int nType, int nTarget);
	void TriggerLobbyCamEvent(int nType, int nTarget);
	void STATIC_Uninitialize();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void STATIC_LeaveQueue();
	void STATIC_PopulateGoalData();
	void STATIC_USC_OpenEventCam(bool isSmall);
	void STATIC_USC_GotoVault(bool bIsSmall);
	void STATIC_USC_SetUserViewedEvent();
	void STATIC_USC_GetAdventureLeaderboard(int nEventId);
	void USC_OpenEventCam_Delegate();
	void USC_GotoVault_Delegate();
	void USC_GetAdventureLeaderboard_Delegate();
	void USC_SetUserViewedEvent_Delegate();
};


// Class TgClient.TgGfxBooster
// 0x0010 (0x0294 - 0x0284)
class UTgGfxBooster : public UTgGfxScene
{
public:
	struct FScriptDelegate                             __USC_ShowPurchasePopup_Delegate__Delegate;               // 0x0284(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0284(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxBooster");
		return ptr;
	}


	void STATIC_UpdateBoosterTime();
	void STATIC_USC_ShowPurchasePopup(int ItemId, int nQuantity);
	void USC_ShowPurchasePopup_Delegate(int ItemId, int nQuantity);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxCharacterBuilder
// 0x16E8 (0x196C - 0x0284)
class UTgGfxCharacterBuilder : public UTgGfxScene
{
public:
	struct FString                                     m_lsItems;                                                // 0x0284(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsActives;                                              // 0x0294(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsConsumables;                                          // 0x02A4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsPassive;                                              // 0x02B4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsActivated;                                            // 0x02C4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsAbilities;                                            // 0x02D4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsSkip;                                                 // 0x02E4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsSaveItems;                                            // 0x02F4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsSaveAbilities;                                        // 0x0304(0x0010) (Const, Localized, NeedCtorLink)
	int                                                m_playerClassId;                                          // 0x0314(0x0004)
	int                                                m_nSelectedTab;                                           // 0x0318(0x0004)
	class UTgGFxObject*                                m_Tabs[0x2];                                              // 0x031C(0x0008)
	class UTgGFxObject*                                m_SaveButton;                                             // 0x032C(0x0008)
	class UTgGFxObject*                                m_ClearButton;                                            // 0x0334(0x0008)
	int                                                m_nSelectedItem;                                          // 0x033C(0x0004)
	int                                                m_nHighlightIndex;                                        // 0x0340(0x0004)
	int                                                m_nItemScrollIndex;                                       // 0x0344(0x0004)
	TArray<struct FItemBuilderCategory>                m_Categories;                                             // 0x0348(0x0010) (NeedCtorLink)
	TArray<struct FItemBuilderCategory>                m_CustomCategories;                                       // 0x0358(0x0010) (NeedCtorLink)
	TArray<int>                                        m_ShownList;                                              // 0x0368(0x0010) (NeedCtorLink)
	TArray<int>                                        m_ShownGrid;                                              // 0x0378(0x0010) (NeedCtorLink)
	int                                                m_nRoleIndex;                                             // 0x0388(0x0004)
	TEnumAsByte<ETipType>                              m_TipType;                                                // 0x038C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x038D(0x0003) MISSED OFFSET
	int                                                m_nPreviewTipIndex;                                       // 0x0390(0x0004)
	float                                              m_fTipWaitTimer;                                          // 0x0394(0x0004)
	float                                              m_fTipWaitDuration;                                       // 0x0398(0x0004)
	unsigned long                                      m_bIsCustomRole : 1;                                      // 0x039C(0x0004)
	unsigned long                                      m_bIsSubFilter : 1;                                       // 0x039C(0x0004)
	unsigned long                                      m_bProfileModified : 1;                                   // 0x039C(0x0004)
	unsigned long                                      m_bAbilitiesModified : 1;                                 // 0x039C(0x0004)
	int                                                m_nCustomRoleIndex;                                       // 0x03A0(0x0004)
	TArray<struct FPreviewItem>                        m_PreviewItemData;                                        // 0x03A4(0x0010) (NeedCtorLink)
	TArray<struct FPreviewItem>                        m_PreviewActiveData;                                      // 0x03B4(0x0010) (NeedCtorLink)
	TArray<struct FPreviewItem>                        m_PreviewConsumableData;                                  // 0x03C4(0x0010) (NeedCtorLink)
	int                                                m_nFilterIndex;                                           // 0x03D4(0x0004)
	int                                                m_nFocusedItemIndex;                                      // 0x03D8(0x0004)
	int                                                m_nFocusedItemCategory;                                   // 0x03DC(0x0004)
	int                                                m_bIsFocusingGridItem;                                    // 0x03E0(0x0004)
	class UTgGFxObject*                                m_ItemView;                                               // 0x03E4(0x0008)
	class UTgGFxObject*                                m_BuildPreview;                                           // 0x03EC(0x0008)
	class UTgGFxObject*                                m_RoleDropDown;                                           // 0x03F4(0x0008)
	struct FItemDisplay                                m_ListItem[0xC];                                          // 0x03FC(0x0080)
	struct FItemDisplay                                m_GridItem[0x10];                                         // 0x09FC(0x0080)
	class UTgGFxObject*                                m_Header[0x4];                                            // 0x11FC(0x0008)
	class UTgGFxObject*                                m_HeaderTF[0x4];                                          // 0x121C(0x0008)
	class UTgGFxObject*                                m_HeaderBlock[0x4];                                       // 0x123C(0x0008)
	struct FBuildItemDisplay                           m_PreviewItems[0x6];                                      // 0x125C(0x0010)
	struct FBuildItemDisplay                           m_PreviewActives[0x2];                                    // 0x12BC(0x0010)
	struct FBuildItemDisplay                           m_PreviewConsumables[0x2];                                // 0x12DC(0x0010)
	int                                                m_nSelectedLevel;                                         // 0x12FC(0x0004)
	int                                                m_nSelectedAbility;                                       // 0x1300(0x0004)
	struct FLevelInfo                                  m_nLevelAbilities[0x14];                                  // 0x1304(0x0008)
	int                                                m_nAbilityLevels[0x4];                                    // 0x13A4(0x0004)
	struct FString                                     m_AbilityIcons[0x4];                                      // 0x13B4(0x0010) (AlwaysInit, NeedCtorLink)
	class UTgGFxObject*                                m_AbilityPreview;                                         // 0x13F4(0x0008)
	struct FAbilitySelectionButton                     m_PreviewAbilities[0x5];                                  // 0x13FC(0x0040)
	class UTgGFxObject*                                m_AbilitiesView;                                          // 0x153C(0x0008)
	struct FAbilitySelectionButton                     m_AbilityBtns[0x4];                                       // 0x1544(0x0040)
	struct FAbilityRow                                 m_AbilityRows[0x14];                                      // 0x1644(0x0028)
	class UTgGFxObject*                                m_AbilitySkip;                                            // 0x1964(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxCharacterBuilder");
		return ptr;
	}


	bool STATIC_HasVendorData();
	class UTgVendorData* STATIC_GetVendorData();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxClanAdmin
// 0x0020 (0x02A4 - 0x0284)
class UTgGfxClanAdmin : public UTgGfxScene
{
public:
	TArray<int>                                        m_RegionList;                                             // 0x0284(0x0010) (NeedCtorLink)
	TArray<int>                                        m_JoinTypeList;                                           // 0x0294(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxClanAdmin");
		return ptr;
	}


	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void UpdateClanNameChange();
	void STATIC_ASC_UpdateClanNameChange();
	void UpdateApplicationData();
	void STATIC_ASC_UpdateApplicationData();
	void UpdatePlayerInvites();
	void STATIC_ASC_UpdatePlayerInvites();
	void UpdateClanData();
	void STATIC_ASC_UpdateClanData();
	void STATIC_USC_BanClanApp(const struct FString& sPlayerId);
	void STATIC_USC_DeclineClanApp(int nAppId);
	void STATIC_USC_AcceptClanApp(int nAppId);
	void STATIC_USC_UpdateJoinTypeRegion(int nJoinTypeId, int nRegionId);
	void STATIC_USC_UpdateClanNameAndTag(const struct FString& sName, const struct FString& sTag);
};


// Class TgClient.TgGfxClanCreation
// 0x0000 (0x0284 - 0x0284)
class UTgGfxClanCreation : public UTgGfxScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxClanCreation");
		return ptr;
	}


	void Reinit();
	void STATIC_ASC_Reinit();
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void STATIC_USC_GotoClanList();
	void STATIC_USC_GetRegionListData();
	void STATIC_USC_CancelClanRequest(int nClanId);
	void STATIC_USC_AcceptClanRequest(int nClanId);
	void STATIC_USC_GetInvitesData();
	void STATIC_USC_CreateClan(const struct FString& sClanName, const struct FString& sClanTag, int nRegionId, int nRecruitmentType);
};


// Class TgClient.TgGfxClanIconPicker
// 0x0010 (0x0294 - 0x0284)
class UTgGfxClanIconPicker : public UTgGfxScene
{
public:
	struct FScriptDelegate                             __USC_SelectIcon_Delegate__Delegate;                      // 0x0284(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0284(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxClanIconPicker");
		return ptr;
	}


	void STATIC_Initialize(class UTgMoviePlayer* pMP);
	void STATIC_USC_SelectIcon(int nIconItemId);
	void USC_SelectIcon_Delegate();
};


// Class TgClient.TgGfxClanList
// 0x0018 (0x029C - 0x0284)
class UTgGfxClanList : public UTgGfxScene
{
public:
	int                                                m_nApplicationId;                                         // 0x0284(0x0004)
	unsigned long                                      m_bJustApplied : 1;                                       // 0x0288(0x0004)
	TArray<int>                                        m_RegionList;                                             // 0x028C(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxClanList");
		return ptr;
	}


	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void UpdateApplicationData();
	void STATIC_ASC_UpdateApplicationData();
	void UpdateClanList();
	void STATIC_ASC_UpdateClanList();
	void STATIC_USC_ApplyToClan(int nClanId, bool bWithMessage);
	void STATIC_USC_SearchClans(const struct FString& sSearchString, int nJoinTypeId, int nRegionId, bool bRecommendedOnly);
};


// Class TgClient.TgGfxClanManagement
// 0x0098 (0x031C - 0x0284)
class UTgGfxClanManagement : public UTgGfxScene
{
public:
	unsigned long                                      m_bIsOfficer : 1;                                         // 0x0284(0x0004)
	struct Fdword                                      m_nSelectedPlayerId;                                      // 0x0288(0x0004)
	struct FString                                     m_lsClanQuit;                                             // 0x028C(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsClanQuitDesc;                                         // 0x029C(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsUpdateClanTag;                                        // 0x02AC(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsUpdateClanTagLabel;                                   // 0x02BC(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsTransferClan;                                         // 0x02CC(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsTransferClanLabel;                                    // 0x02DC(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDisbandClan;                                          // 0x02EC(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDisbandClanLabel;                                     // 0x02FC(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDisbandClanRemove;                                    // 0x030C(0x0010) (Const, Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxClanManagement");
		return ptr;
	}


	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void STATIC_OnInviteToClanSelect(class UTgEventDataItem* pEvent);
	void STATIC_OnInviteToClanQuery(const struct FPointer& pEvent);
	void STATIC_USC_ModifyLeader(const struct FString& sPlayerId);
	void STATIC_USC_ViewProfile(const struct FString& sPlayerId);
	void STATIC_USC_InviteToClanByName(const struct FString& sName);
	void STATIC_USC_UpdateClanTag();
	void STATIC_USC_QuitClan();
	void STATIC_USC_CancelPlayerInvite(const struct FString& sPlayerId);
};


// Class TgClient.TgGFxDungeonCurrencies
// 0x0000 (0x0284 - 0x0284)
class UTgGFxDungeonCurrencies : public UTgGfxScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGFxDungeonCurrencies");
		return ptr;
	}


	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxEOMLobby
// 0x0014 (0x0298 - 0x0284)
class UTgGfxEOMLobby : public UTgGfxScene
{
public:
	struct FString                                     m_sGiftedPlayerName;                                      // 0x0284(0x0010) (NeedCtorLink)
	int                                                m_nGiftedPlayerId;                                        // 0x0294(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxEOMLobby");
		return ptr;
	}


	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_OnStats(const struct FString& instanceId);
	void STATIC_OnFeedback();
	void STATIC_OnTwitter(const struct FString& instanceId);
	void STATIC_OnFacebook(const struct FString& instanceId);
	void STATIC_OnSendPlayerGift(class UTgEventDataItem* pEvent);
	void STATIC_OnSendGiftPoints(class UGFxObject* pData);
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_USC_SendPlayerGift(const struct FString& PlayerName, const struct FString& nPlayerId);
	void ReceiveGiftedPoints(class UGFxObject* Data);
	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* pMoviePlayer);
};


// Class TgClient.TgGfxEventAchievements
// 0x0000 (0x0284 - 0x0284)
class UTgGfxEventAchievements : public UTgGfxScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxEventAchievements");
		return ptr;
	}


	void STATIC_CheckBundleOwned();
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxEventLeaderboard
// 0x0020 (0x02A4 - 0x0284)
class UTgGfxEventLeaderboard : public UTgGfxScene
{
public:
	unsigned long                                      requestingData : 1;                                       // 0x0284(0x0004)
	unsigned long                                      gotFriendsData : 1;                                       // 0x0284(0x0004)
	unsigned long                                      gotPersonalData : 1;                                      // 0x0284(0x0004)
	unsigned long                                      gotWorldData : 1;                                         // 0x0284(0x0004)
	struct FString                                     dataIndex;                                                // 0x0288(0x0010) (NeedCtorLink)
	int                                                nCurrentEventId;                                          // 0x0298(0x0004)
	class UGFxObject*                                  cachedBoards;                                             // 0x029C(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxEventLeaderboard");
		return ptr;
	}


	void STATIC_USC_RequestEventLeaderboard(int EventIdx);
	class UGFxObject* STATIC_Chunk(const struct FString& dataIdx);
	class UGFxObject* STATIC_CreateChunk(const struct FString& dataIdx);
	bool STATIC_UpdateFromChunk(const struct FString& dataIdx);
	void STATIC_OnReceivePlayerNames();
	void STATIC_ReceivedAllData();
	void STATIC_PopulateDropdown(TArray<int> arrEventIds);
	void STATIC_ShowLeaderboard(int nStartIndex, int nEndIndex);
	void STATIC_RequestFriendAndWorldPlayerNames();
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxFeedback
// 0x00AC (0x0330 - 0x0284)
class UTgGfxFeedback : public UTgGfxScene
{
public:
	struct FString                                     m_lsHeaderServerStability;                                // 0x0284(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsHeaderMatchmaking;                                    // 0x0294(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDescriptionServerStability;                           // 0x02A4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDescriptionMatchmaking;                               // 0x02B4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsSubmit;                                               // 0x02C4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsComments;                                             // 0x02D4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsUnrated;                                              // 0x02E4(0x0010) (Const, Localized, NeedCtorLink)
	class UTgGFxObject*                                m_Comments;                                               // 0x02F4(0x0008)
	class UTgGFxObject*                                m_RatingBtns[0x5];                                        // 0x02FC(0x0008)
	class UTgGFxObject*                                m_RatingTF;                                               // 0x0324(0x0008)
	int                                                m_nStarRating;                                            // 0x032C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxFeedback");
		return ptr;
	}


	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxGlossary
// 0x0000 (0x0284 - 0x0284)
class UTgGfxGlossary : public UTgGfxScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxGlossary");
		return ptr;
	}


	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* pMP);
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
};


// Class TgClient.TgGfxGods
// 0x17CC (0x1A50 - 0x0284)
class UTgGfxGods : public UTgGfxScene
{
public:
	struct FString                                     m_lsStandard;                                             // 0x0284(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsOwned;                                                // 0x0294(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     rented_label;                                             // 0x02A4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsCurrentRentalExpiresIn;                               // 0x02B4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDiamond;                                              // 0x02C4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsDiamond_description;                                  // 0x02D4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusive;                                            // 0x02E4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusive_description;                                // 0x02F4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveChest;                                       // 0x0304(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveChest_description;                           // 0x0314(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveClan;                                        // 0x0324(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveClan_description;                            // 0x0334(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusivePromo;                                       // 0x0344(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusivePromo_description;                           // 0x0354(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveEsports;                                     // 0x0364(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveEsports_description;                         // 0x0374(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveSeasonal;                                    // 0x0384(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsExclusiveSeasonal_description;                        // 0x0394(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsGold;                                                 // 0x03A4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsGold_description;                                     // 0x03B4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLegendary;                                            // 0x03C4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLegendary_description;                                // 0x03D4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimited;                                              // 0x03E4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimited_description;                                  // 0x03F4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedChest;                                         // 0x0404(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedChest_description;                             // 0x0414(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedClan;                                          // 0x0424(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedClan_description;                              // 0x0434(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedPromo;                                         // 0x0444(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedPromo_description;                             // 0x0454(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedEsports;                                       // 0x0464(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedEsports_description;                           // 0x0474(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedSeasonal;                                      // 0x0484(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsLimitedSeasonal_description;                          // 0x0494(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsUnlimited;                                            // 0x04A4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsUnlimited_description;                                // 0x04B4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     m_lsClan;                                                 // 0x04C4(0x0010) (Const, Localized, NeedCtorLink)
	struct FString                                     days_label;                                               // 0x04D4(0x0010) (NeedCtorLink)
	struct FString                                     day_label;                                                // 0x04E4(0x0010) (NeedCtorLink)
	struct FString                                     hours_label;                                              // 0x04F4(0x0010) (NeedCtorLink)
	struct FString                                     hour_label;                                               // 0x0504(0x0010) (NeedCtorLink)
	struct FString                                     minutes_label;                                            // 0x0514(0x0010) (NeedCtorLink)
	struct FString                                     minute_label;                                             // 0x0524(0x0010) (NeedCtorLink)
	struct FString                                     seconds_label;                                            // 0x0534(0x0010) (NeedCtorLink)
	struct FString                                     second_label;                                             // 0x0544(0x0010) (NeedCtorLink)
	TArray<int>                                        god_ids;                                                  // 0x0554(0x0010) (NeedCtorLink)
	struct FGFxItem                                    m_ItemBtn[0x38];                                          // 0x0564(0x0028)
	struct FGFxSkinBtn                                 m_SkinBtn[0x6];                                           // 0x0E24(0x0070)
	struct FGFxGodBtn                                  m_GodCardBtn[0x10];                                       // 0x10C4(0x0068)
	class UTgGFxObject*                                m_SearchField;                                            // 0x1744(0x0008)
	class UTgGFxObject*                                m_FilterDropdown;                                         // 0x174C(0x0008)
	class UTgGFxObject*                                m_GodGrid;                                                // 0x1754(0x0008)
	class UTgGFxObject*                                m_GodCardCheckbox;                                        // 0x175C(0x0008)
	class UTgGFxObject*                                m_GodGridScrollbar;                                       // 0x1764(0x0008)
	class UTgGFxObject*                                m_GodCardScrollbar;                                       // 0x176C(0x0008)
	class UTgGFxObject*                                m_UGPIconsBtn;                                            // 0x1774(0x0008)
	class UTgGFxObject*                                m_UGPCardsBtn;                                            // 0x177C(0x0008)
	class UTgGFxObject*                                m_SkinCall;                                               // 0x1784(0x0008)
	class UTgGFxObject*                                m_SkinCallTF;                                             // 0x178C(0x0008)
	class UTgGFxObject*                                m_ExtraCall;                                              // 0x1794(0x0008)
	class UTgGFxObject*                                m_ExtraCallTF;                                            // 0x179C(0x0008)
	class UTgGFxObject*                                m_VoiceCall;                                              // 0x17A4(0x0008)
	class UTgGFxObject*                                m_VoiceCallTF;                                            // 0x17AC(0x0008)
	class UTgGFxObject*                                m_VPContainer;                                            // 0x17B4(0x0008)
	class UTgGFxObject*                                m_SkinGoto;                                               // 0x17BC(0x0008)
	class UTgGFxObject*                                m_RentalInfo;                                             // 0x17C4(0x0008)
	class UTgGFxObject*                                m_SkinInfo;                                               // 0x17CC(0x0008)
	class UTgGFxObject*                                m_SideSkinInfo;                                           // 0x17D4(0x0008)
	class UTgGFxObject*                                m_UnlockBtn;                                              // 0x17DC(0x0008)
	class UTgGFxObject*                                m_EmoteLabel;                                             // 0x17E4(0x0008)
	class UTgGFxObject*                                m_RightGodsText;                                          // 0x17EC(0x0008)
	class UTgGFxObject*                                m_RightGodsText2;                                         // 0x17F4(0x0008)
	class UTgGFxObject*                                m_AbilityScreen;                                          // 0x17FC(0x0008)
	class UTgGFxObject*                                m_AboutScreen;                                            // 0x1804(0x0008)
	class UTgGFxObject*                                m_LoreScreen;                                             // 0x180C(0x0008)
	class UTgGFxObject*                                m_StatScreen;                                             // 0x1814(0x0008)
	class UTgGFxObject*                                m_ExtraScreen;                                            // 0x181C(0x0008)
	class UTgGFxObject*                                m_HistoryScreen;                                          // 0x1824(0x0008)
	class UTgGFxObject*                                m_VoiceScreen;                                            // 0x182C(0x0008)
	class UTgGFxObject*                                m_AchieveScreen;                                          // 0x1834(0x0008)
	int                                                m_nSelectedIndex;                                         // 0x183C(0x0004)
	int                                                m_nScrollIndex;                                           // 0x1840(0x0004)
	TArray<int>                                        m_nShownItems;                                            // 0x1844(0x0010) (NeedCtorLink)
	TArray<int>                                        m_nUnsortedItems;                                         // 0x1854(0x0010) (NeedCtorLink)
	TArray<int>                                        m_RentalGodsIndex;                                        // 0x1864(0x0010) (NeedCtorLink)
	struct FString                                     m_sSearchField;                                           // 0x1874(0x0010) (NeedCtorLink)
	struct FString                                     m_sSearch;                                                // 0x1884(0x0010) (NeedCtorLink)
	float                                              m_fTipWaitTimer;                                          // 0x1894(0x0004)
	float                                              m_fTipWaitDuration;                                       // 0x1898(0x0004)
	float                                              m_fRentalTimer;                                           // 0x189C(0x0004)
	int                                                m_nHighlightIndex;                                        // 0x18A0(0x0004)
	unsigned long                                      m_bScrollToSelection : 1;                                 // 0x18A4(0x0004)
	unsigned long                                      m_bHasGodPack : 1;                                        // 0x18A4(0x0004)
	unsigned long                                      m_bShouldUpdateCall : 1;                                  // 0x18A4(0x0004)
	int                                                m_nSelectedTab;                                           // 0x18A8(0x0004)
	int                                                m_nSelectedGodId;                                         // 0x18AC(0x0004)
	int                                                m_nSelectedSkinId;                                        // 0x18B0(0x0004)
	int                                                m_nSelectedWardSkinId;                                    // 0x18B4(0x0004)
	int                                                m_nFilterType;                                            // 0x18B8(0x0004)
	int                                                m_nPrevGodScrollIndex;                                    // 0x18BC(0x0004)
	int                                                m_nPrevWardScrollIndex;                                   // 0x18C0(0x0004)
	int                                                m_nStatsHPLow;                                            // 0x18C4(0x0004)
	int                                                m_nStatsHPHigh;                                           // 0x18C8(0x0004)
	int                                                m_nStatsManaLow;                                          // 0x18CC(0x0004)
	int                                                m_nStatsManaHigh;                                         // 0x18D0(0x0004)
	int                                                m_nCachedGodsTabSelection;                                // 0x18D4(0x0004)
	int                                                m_playerId;                                               // 0x18D8(0x0004)
	int                                                m_nColCount;                                              // 0x18DC(0x0004)
	struct FItemData_GodPage                           m_SelectedGod;                                            // 0x18E0(0x00E8) (NeedCtorLink)
	TArray<struct FItemData_GodPage>                   m_GodData;                                                // 0x19C8(0x0010) (NeedCtorLink)
	TArray<struct FItemData_GodPage>                   m_WardData;                                               // 0x19D8(0x0010) (NeedCtorLink)
	TArray<struct FItemData_GodPage>                   m_SkinData;                                               // 0x19E8(0x0010) (NeedCtorLink)
	TArray<struct FStreamData_Gods>                    m_StreamData;                                             // 0x19F8(0x0010) (NeedCtorLink)
	TArray<struct FAchievementData_GodsAchievements>   m_achievementDatas;                                       // 0x1A08(0x0010) (NeedCtorLink)
	class UGFxObject*                                  m_achievementDatasArray;                                  // 0x1A18(0x0008)
	TArray<struct FVendorItemUIHint>                   m_vendorUiHints;                                          // 0x1A20(0x0010) (NeedCtorLink)
	struct FScriptDelegate                             __USC_UpdateEmoteSelection_Delegate__Delegate;            // 0x1A30(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x1A30(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_PlayGodVideo_Delegate__Delegate;                    // 0x1A40(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x1A40(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxGods");
		return ptr;
	}


	void STATIC_OnAcquisition(class UTgEventDataItem* pEvent);
	void STATIC_UpdateUGPValue(class UTgEventDataItem* pEvent);
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void STATIC_USC_PlayGodVideo(int abilityNumber);
	void USC_PlayGodVideo_Delegate();
	void STATIC_USC_UpdateEmoteSelection(const struct FString& emoteName);
	void USC_UpdateEmoteSelection_Delegate(const struct FString& emoteName);
};


// Class TgClient.TgGfxGodsHistory
// 0x0038 (0x02BC - 0x0284)
class UTgGfxGodsHistory : public UTgGfxScene
{
public:
	int                                                m_godId;                                                  // 0x0284(0x0004)
	unsigned long                                      m_updatedQueues : 1;                                      // 0x0288(0x0004)
	struct FScriptDelegate                             __USC_GetQueuesDropdown_Delegate__Delegate;               // 0x028C(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x028C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_GetHistoryData_Delegate__Delegate;                  // 0x029C(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x029C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __USC_ShowMatchDetails_Delegate__Delegate;                // 0x02AC(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                                       // 0x02AC(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxGodsHistory");
		return ptr;
	}


	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	void UpdateGodHistory();
	void STATIC_ASC_UpdateGodHistory();
	void UpdateQueueData();
	void STATIC_ASC_UpdateQueueData();
	void STATIC_USC_ShowMatchDetails(int pMatchID);
	void STATIC_USC_GetHistoryData(int queueId);
	void STATIC_USC_GetQueuesDropdown(int godId);
	void USC_ShowMatchDetails_Delegate(int pMatchID);
	void USC_GetHistoryData_Delegate(int queueId);
	void USC_GetQueuesDropdown_Delegate(int godId);
};


// Class TgClient.TgGfxGuides
// 0x0000 (0x0284 - 0x0284)
class UTgGfxGuides : public UTgGfxScene
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxGuides");
		return ptr;
	}


	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxHudItems
// 0x004C (0x02D0 - 0x0284)
class UTgGfxHudItems : public UTgGfxScene
{
public:
	class UTgVendorData*                               m_VendorData;                                             // 0x0284(0x0008)
	int                                                m_nPlayerClass;                                           // 0x028C(0x0004)
	class UTgGFxObject*                                m_Item[0x6];                                              // 0x0290(0x0008)
	struct FScriptDelegate                             __USC_SetupItemDisplay_Delegate__Delegate;                // 0x02C0(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02C0(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxHudItems");
		return ptr;
	}


	void UpdateGlow(int Index, bool Visibility);
	void STATIC_ASC_UpdateGlow(int Index, bool Visibility);
	void STATIC_USC_SetupItemDisplay();
	void USC_SetupItemDisplay_Delegate();
	void CheckCurrency(class UTgEventDataItem* pEvent);
	void STATIC_CheckWishList(bool bPurge);
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
};


// Class TgClient.TgGfxHudNotify
// 0x0204 (0x0488 - 0x0284)
class UTgGfxHudNotify : public UTgGfxScene
{
public:
	float                                              m_fKillDuration;                                          // 0x0284(0x0004)
	float                                              m_fKillTimer;                                             // 0x0288(0x0004)
	float                                              m_fAccoladeAccumulateDuration;                            // 0x028C(0x0004)
	float                                              m_fAccoladeDuration;                                      // 0x0290(0x0004)
	float                                              m_fAccoladeTimer;                                         // 0x0294(0x0004)
	int                                                m_nEnemyIconIndex;                                        // 0x0298(0x0004)
	int                                                m_nFriendIconIndex;                                       // 0x029C(0x0004)
	unsigned long                                      m_bKillInterrupt : 1;                                     // 0x02A0(0x0004)
	float                                              m_fIconDuration;                                          // 0x02A4(0x0004)
	float                                              m_fEnemyIconTimer;                                        // 0x02A8(0x0004)
	float                                              m_fFriendIconTimer;                                       // 0x02AC(0x0004)
	float                                              m_fObjectiveDuration;                                     // 0x02B0(0x0004)
	class UTgGFxObject*                                m_KillMC;                                                 // 0x02B4(0x0008)
	class UTgGFxObject*                                m_KillerName;                                             // 0x02BC(0x0008)
	class UTgGFxObject*                                m_KillerIcon;                                             // 0x02C4(0x0008)
	class UTgGFxObject*                                m_KillerGlow;                                             // 0x02CC(0x0008)
	class UTgGFxObject*                                m_KillerFrame;                                            // 0x02D4(0x0008)
	class UTgGFxObject*                                m_VictimName;                                             // 0x02DC(0x0008)
	class UTgGFxObject*                                m_VictimIcon;                                             // 0x02E4(0x0008)
	class UTgGFxObject*                                m_VictimGlow;                                             // 0x02EC(0x0008)
	class UTgGFxObject*                                m_VictimFrame;                                            // 0x02F4(0x0008)
	class UTgGFxObject*                                m_RedSlash;                                               // 0x02FC(0x0008)
	class UTgGFxObject*                                m_BlueSlash;                                              // 0x0304(0x0008)
	class UTgGFxObject*                                m_EnemyMC[0x5];                                           // 0x030C(0x0008)
	class UTgGFxObject*                                m_EnemyIcon[0x5];                                         // 0x0334(0x0008)
	class UTgGFxObject*                                m_FriendMC[0x5];                                          // 0x035C(0x0008)
	class UTgGFxObject*                                m_FriendIcon[0x5];                                        // 0x0384(0x0008)
	class UTgGFxObject*                                m_AccoladeMC;                                             // 0x03AC(0x0008)
	class UTgGFxObject*                                m_AccoladeName;                                           // 0x03B4(0x0008)
	struct FNotifyData                                 m_NewData;                                                // 0x03BC(0x00AC) (NeedCtorLink)
	TArray<struct FNotifyData>                         m_Notifications;                                          // 0x0468(0x0010) (NeedCtorLink)
	TArray<struct FEventLogData>                       m_EventLog;                                               // 0x0478(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGfxHudNotify");
		return ptr;
	}


	void STATIC_OnGameUIEvent(class UTgEventDataItem* pEvent);
	void STATIC_Uninitialize();
	void STATIC_Initialize(class UTgMoviePlayer* pMP);
	void STATIC_ReceiveGFxData(class UGFxObject* pObj);
};


// Class TgClient.TgGfxHudUpgrade
// 0x0070 (0x02F4 - 0x0284)
class UTgGfxHudUpgrade : public UTgGfxScene
{
public:
	float                                              m_fItemTimer;                                             // 0x0284(0x0004)
	float                                              m_fSkillTimer;                                            // 0x0288(0x0004)
	float                                              m_fItemDuration;                                          // 0x028C(0x0004)
	float                                              m_fSkillDuration;                                         // 0x0290(0x0004)
	TArray<int>                                        m_Items;                                                  // 0x0294(0x0010) (NeedCtorLink)
	TArray<int>                                        m_Skills;                                                 // 0x02A4(0x0010) (NeedCtorLink)
	class UTgGFxObject*                                m_ItemMC;                                                 // 0x02B4(0x0008)
	class UTgGFxObject*                                m_ItemType;                                               // 0x02BC(0x0008)
