#pragma once

// SMITE (8.2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SM_TgClientBase_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TgClientBase.TgAcquistionEvent
// 0x0080 (0x00F4 - 0x0074)
class UTgAcquistionEvent : public UTgEventDataItem
{
public:
	struct FUIQueuedAcquisition                        pAcq;                                                     // 0x0074(0x0080) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgAcquistionEvent");
		return ptr;
	}

};


// Class TgClientBase.TgAcquistionNotificationEvent
// 0x0008 (0x007C - 0x0074)
class UTgAcquistionNotificationEvent : public UTgEventDataItem
{
public:
	struct FPointer                                    pAcq;                                                     // 0x0074(0x0008) (Native)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgAcquistionNotificationEvent");
		return ptr;
	}

};


// Class TgClientBase.TgAnnouncerPreviewer
// 0x0010 (0x0070 - 0x0060)
class UTgAnnouncerPreviewer : public UObject
{
public:
	class UTgManifestGroup*                            c_AssetManifestGroup;                                     // 0x0060(0x0008) (ExportObject, NeedCtorLink, EditInline)
	struct FName                                       m_AnnouncerResName;                                       // 0x0068(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgAnnouncerPreviewer");
		return ptr;
	}


	void STATIC_PreviewAnnouncerByItemId(int nItemId, bool bAsync);
	void STATIC_OnAnnouncerLoaded();
	void Init();
};


// Class TgClientBase.TgMoviePlayer
// 0x075C (0x0954 - 0x01F8)
class UTgMoviePlayer : public UGFxMoviePlayer
{
public:
	struct FPointer                                    VfTable_ITgIntervalInterface;                             // 0x01F8(0x0008) (Const, Native, NoExport)
	TArray<struct FInputSensitiveComponent>            RegisteredInputSensitiveComponents;                       // 0x0200(0x0010) (NeedCtorLink)
	struct FMultiMap_Mirror                            RegisteredObjects;                                        // 0x0210(0x0048) (Const, Native)
	struct FMultiMap_Mirror                            RegisteredScenes;                                         // 0x0258(0x0048) (Const, Native)
	struct FMultiMap_Mirror                            RegisteredDataChunks;                                     // 0x02A0(0x0048) (Const, Native)
	struct FPointer                                    MarLobbyPlayback;                                         // 0x02E8(0x0008) (Native)
	struct FPointer                                    PkgLobbyPlayback;                                         // 0x02F0(0x0008) (Native)
	class APComVideoPlayer*                            m_PComVideoPlayer;                                        // 0x02F8(0x0008)
	struct FPointer                                    m_ConfigManager;                                          // 0x0300(0x0008) (Native)
	struct FString                                     GodPackOwnershipId;                                       // 0x0308(0x0010) (Config, NeedCtorLink)
	int                                                m_eButtonPromptSetting;                                   // 0x0318(0x0004)
	struct FName                                       ButtonPromptName;                                         // 0x031C(0x0008)
	unsigned long                                      m_bShownIntroMovie : 1;                                   // 0x0324(0x0004)
	unsigned long                                      m_bShownLoginBlocker : 1;                                 // 0x0324(0x0004)
	unsigned long                                      m_bShownPublicSystemMessages : 1;                         // 0x0324(0x0004)
	unsigned long                                      m_bShownPatchOverview : 1;                                // 0x0324(0x0004)
	unsigned long                                      m_bIsListeningForVivoxBtn : 1;                            // 0x0324(0x0004)
	unsigned long                                      m_bRenderGammaControls : 1;                               // 0x0324(0x0004)
	unsigned long                                      m_bHasNoPlayer : 1;                                       // 0x0324(0x0004)
	unsigned long                                      m_bAllowAllChat : 1;                                      // 0x0324(0x0004)
	unsigned long                                      m_bLeaver : 1;                                            // 0x0324(0x0004)
	unsigned long                                      m_bPrintClanPlayerInvites : 1;                            // 0x0324(0x0004)
	unsigned long                                      m_bShouldNotKillSeasonalMusic : 1;                        // 0x0324(0x0004)
	unsigned long                                      isNoItemPopup : 1;                                        // 0x0324(0x0004)
	unsigned long                                      isMatchLobbyTrade : 1;                                    // 0x0324(0x0004)
	unsigned long                                      disableNoItemPopup : 1;                                   // 0x0324(0x0004)
	unsigned long                                      m_bHUDVisible : 1;                                        // 0x0324(0x0004)
	unsigned long                                      m_bPrevLeader : 1;                                        // 0x0324(0x0004)
	unsigned long                                      m_isPlayingTutorial : 1;                                  // 0x0324(0x0004)
	unsigned long                                      m_bLoginComplete : 1;                                     // 0x0324(0x0004)
	unsigned long                                      m_bAllShopVendorsReceived : 1;                            // 0x0324(0x0004)
	unsigned long                                      m_bWaitingForAllShopVendors : 1;                          // 0x0324(0x0004)
	unsigned long                                      m_bEnableShopVendorTimer : 1;                             // 0x0324(0x0004)
	unsigned long                                      m_bFailedBatchPurchase : 1;                               // 0x0324(0x0004)
	unsigned long                                      m_HideEOMLTriumph : 1;                                    // 0x0324(0x0004)
	unsigned long                                      m_bInLoginQueue : 1;                                      // 0x0324(0x0004)
	unsigned long                                      m_bQueueStatsRequestOutstanding : 1;                      // 0x0324(0x0004)
	unsigned long                                      m_bInAccountLinkingProcess : 1;                           // 0x0324(0x0004)
	unsigned long                                      m_bInitialized : 1;                                       // 0x0324(0x0004)
	unsigned long                                      m_bInTransition : 1;                                      // 0x0324(0x0004)
	unsigned long                                      m_bResizeForSafeZones : 1;                                // 0x0324(0x0004)
	unsigned long                                      c_bChatReady : 1;                                         // 0x0324(0x0004)
	unsigned long                                      m_bFriendlyWon : 1;                                       // 0x0324(0x0004)
	unsigned long                                      m_bTutorialPlayed : 1;                                    // 0x0324(0x0004)
	unsigned long                                      m_bAutoQueueIntoPractice : 1;                             // 0x0328(0x0004)
	unsigned long                                      m_bPartySelectState : 1;                                  // 0x0328(0x0004)
	unsigned long                                      m_bHasLoadedTeamNames : 1;                                // 0x0328(0x0004)
	unsigned long                                      m_bConfigManagerProcessed : 1;                            // 0x0328(0x0004)
	unsigned long                                      m_bShowingEmailPopup : 1;                                 // 0x0328(0x0004)
	unsigned long                                      m_bMatchCheck : 1;                                        // 0x0328(0x0004)
	unsigned long                                      m_bWaitingForReferralEntries : 1;                         // 0x0328(0x0004)
	unsigned long                                      m_bAttemptingToJoinTutorial : 1;                          // 0x0328(0x0004)
	unsigned long                                      m_bHasTutorialAttemptTimeout : 1;                         // 0x0328(0x0004)
	unsigned long                                      m_PlayingIntroVideo : 1;                                  // 0x0328(0x0004)
	unsigned long                                      m_bForcingPSPlus : 1;                                     // 0x0328(0x0004)
	unsigned long                                      m_bListeningForInputConfirm : 1;                          // 0x0328(0x0004)
	struct FTgPlayerId                                 m_PlayerLookup;                                           // 0x032C(0x0024) (NeedCtorLink)
	class UTgVendorData*                               m_VendorData;                                             // 0x0350(0x0008)
	class UTgBrowserManager*                           m_WebBrowser;                                             // 0x0358(0x0008)
	TArray<struct FPendingChatMessage>                 m_PendingMessages;                                        // 0x0360(0x0010) (NeedCtorLink)
	TArray<struct FTgPlayerId>                         m_ChatMessagePlayerIds;                                   // 0x0370(0x0010) (NeedCtorLink)
	TArray<int>                                        m_QueuedAchievementId;                                    // 0x0380(0x0010) (AlwaysInit, NeedCtorLink)
	int                                                m_nQueuedBattlePassLevel;                                 // 0x0390(0x0004)
	struct FQWord                                      m_nLastMessageTime;                                       // 0x0394(0x0008)
	int                                                m_nReturnToNavigationAction;                              // 0x039C(0x0004)
	int                                                m_nReturnToId;                                            // 0x03A0(0x0004)
	int                                                m_currentPurchaseId;                                      // 0x03A4(0x0004)
	int                                                m_nCurrentPurchaseQuantity;                               // 0x03A8(0x0004)
	class UTextureRenderTarget2D*                      m_RenderTarget;                                           // 0x03AC(0x0008)
	int                                                m_nAutoNavToPurchasedIndex;                               // 0x03B4(0x0004)
	int                                                m_nAutoNavToRewardIndex;                                  // 0x03B8(0x0004)
	int                                                m_activityRedirectId;                                     // 0x03BC(0x0004)
	int                                                m_goalRedirectId;                                         // 0x03C0(0x0004)
	int                                                m_nAutoNavItemId;                                         // 0x03C4(0x0004)
	struct FString                                     m_sPageAutoTab;                                           // 0x03C8(0x0010) (NeedCtorLink)
	int                                                m_uiDisplayMode;                                          // 0x03D8(0x0004)
	class UGFxObject*                                  _global;                                                  // 0x03DC(0x0008)
	float                                              m_fLobbyPlaybackTime;                                     // 0x03E4(0x0004)
	float                                              m_fLobbyNextFireTime;                                     // 0x03E8(0x0004)
	TArray<struct FLastMatchMember>                    m_lastMatchMembers;                                       // 0x03EC(0x0010) (NeedCtorLink)
	TArray<struct FLastPartiedMember>                  m_lastPartiedMembers;                                     // 0x03FC(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<struct FRecentlyInvitedPlayers>             m_recentlyInvitedPlayers;                                 // 0x040C(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<int>                                        m_PrevParty;                                              // 0x041C(0x0010) (NeedCtorLink)
	TArray<int>                                        m_NewQueueStatus;                                         // 0x042C(0x0010) (NeedCtorLink)
	int                                                m_PrevMatchQueueState;                                    // 0x043C(0x0004)
	struct FString                                     m_sSpectateTarget;                                        // 0x0440(0x0010) (AlwaysInit, NeedCtorLink)
	int                                                m_nReplayId;                                              // 0x0450(0x0004)
	float                                              m_fWaitTimeoutForShopVendors;                             // 0x0454(0x0004)
	float                                              m_fShopVendorWaitTimer;                                   // 0x0458(0x0004)
	TArray<struct FIntStringPair>                      m_nCachedThemeIds;                                        // 0x045C(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<struct Fdword>                              m_MultiQueueList;                                         // 0x046C(0x0010) (AlwaysInit, NeedCtorLink)
	float                                              m_fLoginQueueTimer;                                       // 0x047C(0x0004)
	float                                              m_fMatchCheckTime;                                        // 0x0480(0x0004)
	float                                              m_fTimerUpdate;                                           // 0x0484(0x0004)
	float                                              m_fLastQueueStatsRequest;                                 // 0x0488(0x0004)
	TArray<struct FCardTextureWidget>                  m_CardWidgets;                                            // 0x048C(0x0010) (NeedCtorLink)
	TArray<struct FName>                               GfxObjectBindings;                                        // 0x049C(0x0010) (NeedCtorLink)
	TArray<int>                                        m_AutoReinviteList;                                       // 0x04AC(0x0010) (NeedCtorLink)
	int                                                m_AutoReinviteQueueId;                                    // 0x04BC(0x0004)
	int                                                m_nClearTransitionTicks;                                  // 0x04C0(0x0004)
	int                                                m_nEventDefaultTab;                                       // 0x04C4(0x0004)
	class UTgEventDispatcher*                          m_pUIDispatcher;                                          // 0x04C8(0x0008) (ExportObject, NeedCtorLink, EditInline)
	TArray<struct FUIChangeStruct>                     m_UIChangeEvents;                                         // 0x04D0(0x0010) (NeedCtorLink)
	TArray<struct FSysCounterData>                     m_CountDatas;                                             // 0x04E0(0x0010) (NeedCtorLink)
	TArray<struct FWidgetBinding>                      m_WidgetsBound;                                           // 0x04F0(0x0010) (NeedCtorLink)
	TArray<struct FWidgetBinding>                      m_ButtonPromptStackss;                                    // 0x0500(0x0010) (NeedCtorLink)
	TArray<class UTgChatData*>                         m_arrPendingChat;                                         // 0x0510(0x0010) (AlwaysInit, NeedCtorLink)
	class UGFxObject*                                  m_mcGlobal;                                               // 0x0520(0x0008)
	class UTgGFxObject*                                m_mcRoot;                                                 // 0x0528(0x0008)
	class UTgDataHandler*                              m_DataHandler;                                            // 0x0530(0x0008)
	class UTgEventMediator*                            m_EventMediator;                                          // 0x0538(0x0008)
	class UTgSceneManager*                             m_SceneManager;                                           // 0x0540(0x0008)
	class UTgTimerManager*                             m_TimerManager;                                           // 0x0548(0x0008)
	class UTgPopupManager*                             m_PopupManager;                                           // 0x0550(0x0008)
	class UTgRewardCenterManagerBase*                  m_RewardCenterManager;                                    // 0x0558(0x0008)
	class UTgStreamManagerBase*                        m_StreamManager;                                          // 0x0560(0x0008)
	class UTgLandingPanelManagerBase*                  m_LandingPanelManager;                                    // 0x0568(0x0008)
	class UTgPlayerNameManager*                        m_pPlayerNameManager;                                     // 0x0570(0x0008)
	class UTgAcquisitionManager*                       m_AcquisitionManager;                                     // 0x0578(0x0008)
	class UTgSessionVars*                              m_SessionVars;                                            // 0x0580(0x0008)
	class UTgSystemNotifManagerBase*                   m_SystemNotificationManager;                              // 0x0588(0x0008)
	class UTgDeferManager*                             m_pDeferManager;                                          // 0x0590(0x0008)
	class UTgUIServerStates*                           m_pUIStateInfo;                                           // 0x0598(0x0008)
	struct FTgIntervalHandle                           m_EndMatchHandle;                                         // 0x05A0(0x0010)
	class UTgGFxSelection*                             m_pGFxSelection;                                          // 0x05B0(0x0008)
	class UTgPromptManager*                            m_pPromptManager;                                         // 0x05B8(0x0008)
	class UTgGFxNameDisplayManager*                    m_pNameDisplayManager;                                    // 0x05C0(0x0008)
	class UClass*                                      m_RewardCenterManagerClass;                               // 0x05C8(0x0008)
	class UClass*                                      m_StreamManagerClass;                                     // 0x05D0(0x0008)
	class UClass*                                      m_DataHandlerClass;                                       // 0x05D8(0x0008)
	class UClass*                                      m_EventMediatorClass;                                     // 0x05E0(0x0008)
	class UClass*                                      m_SceneManagerClass;                                      // 0x05E8(0x0008)
	class UClass*                                      m_MenuManagerClass;                                       // 0x05F0(0x0008)
	class UClass*                                      m_SessionVarsClass;                                       // 0x05F8(0x0008)
	int                                                m_nLastTimerIndex;                                        // 0x0600(0x0004)
	int                                                m_nFeedbackType;                                          // 0x0604(0x0004)
	int                                                m_PrevQueue;                                              // 0x0608(0x0004)
	int                                                m_nVaultIndex;                                            // 0x060C(0x0004)
	int                                                m_nUGPFavorRefund;                                        // 0x0610(0x0004)
	TArray<int>                                        c_DeferredChannelTabs;                                    // 0x0614(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_LobbyErrorMessage;                                      // 0x0624(0x0010) (AlwaysInit, NeedCtorLink)
	struct FIntStringPair                              m_LastLoginError;                                         // 0x0634(0x0014) (NeedCtorLink)
	int                                                m_nFeatureAutoGodId;                                      // 0x0648(0x0004)
	int                                                m_nFeatureAutoSkinId;                                     // 0x064C(0x0004)
	int                                                m_nFeatureAutoEmoteId;                                    // 0x0650(0x0004)
	int                                                m_nFeatureAutoWardSkinId;                                 // 0x0654(0x0004)
	int                                                m_nMatchDetailsAutoMatchId;                               // 0x0658(0x0004)
	struct FString                                     m_socialPageAutoTab;                                      // 0x065C(0x0010) (NeedCtorLink)
	int                                                m_rewardCenterTab;                                        // 0x066C(0x0004)
	int                                                m_rewardCenterItemId;                                     // 0x0670(0x0004)
	TEnumAsByte<ENavigationActions>                    m_nCurrentActionId;                                       // 0x0674(0x0001)
	TEnumAsByte<EActiveEvents>                         m_nCurrentEventId;                                        // 0x0675(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0676(0x0002) MISSED OFFSET
	struct FString                                     m_SpecTeamNameEnemy;                                      // 0x0678(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_SpecTeamNameFriendly;                                   // 0x0688(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_SpecClanNameFriendly;                                   // 0x0698(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_SpecClanNameEnemy;                                      // 0x06A8(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_SpecState;                                              // 0x06B8(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_sGodPackImagePath;                                      // 0x06C8(0x0010) (AlwaysInit, NeedCtorLink)
	int                                                m_nGodTargeterFlags;                                      // 0x06D8(0x0004)
	int                                                m_nGodTargeterPrevIndex;                                  // 0x06DC(0x0004)
	int                                                m_nGodTargeterPrevPawnId;                                 // 0x06E0(0x0004)
	struct FString                                     m_sGodTargeterDesc;                                       // 0x06E4(0x0010) (NeedCtorLink)
	int                                                m_nMorriganTargeterPrevBotId;                             // 0x06F4(0x0004)
	class UGFxObject*                                  m_nMorriganPassiveMeterTarget;                            // 0x06F8(0x0008)
	int                                                m_nPracticeQueueSkinId;                                   // 0x0700(0x0004)
	struct FTgLobbyStates                              c_PrevStates;                                             // 0x0704(0x0010)
	struct FTgLobbyStates                              c_CurrStates;                                             // 0x0714(0x0010)
	class UAlienFXManager*                             m_AlienFX;                                                // 0x0724(0x0008)
	struct FLeaderboardOpenData                        m_LeaderboardDelayedOptions;                              // 0x072C(0x0018) (NeedCtorLink)
	class UTgGfxGameInputInterceptor*                  m_pGameInputIntercept;                                    // 0x0744(0x0008)
	class UTgIntervalManager*                          m_pIntervalManager;                                       // 0x074C(0x0008)
	class UTgEsportsManager*                           m_pESportsManager;                                        // 0x0754(0x0008)
	struct FTgPurchaseRequest                          m_StoredPurchaseRequest;                                  // 0x075C(0x0028)
	float                                              m_fMatchingRemainingTimer;                                // 0x0784(0x0004)
	float                                              m_fStatusCheckTimer;                                      // 0x0788(0x0004)
	int                                                m_friendsAutoView;                                        // 0x078C(0x0004)
	struct FPointer                                    m_pTgCallbackDevice;                                      // 0x0790(0x0008) (Native)
	struct FPointer                                    m_pKeybindLookup;                                         // 0x0798(0x0008) (Native)
	float                                              m_fMatchCheckTimer;                                       // 0x07A0(0x0004)
	unsigned char                                      UnknownData01[0x48];                                      // 0x07A4(0x0048) UNKNOWN PROPERTY: MapProperty TgClientBase.TgMoviePlayer.m_mapPrivilegeChecks
	struct FTgIntervalEntry                            m_privDelay;                                              // 0x07EC(0x0028) (NeedCtorLink)
	struct FString                                     m_CustomQueueTarget;                                      // 0x0814(0x0010) (NeedCtorLink)
	TArray<struct Fdword>                              m_cachedGiftsRedeemedIds;                                 // 0x0824(0x0010) (NeedCtorLink)
	float                                              m_fBlockBackLockoutTime;                                  // 0x0834(0x0004)
	class UTgVirtualKeyboard*                          m_pVirtualKeyboard;                                       // 0x0838(0x0008)
	class UTgGFxItemHelperBinding*                     m_pGFxItemHelper;                                         // 0x0840(0x0008)
	TArray<struct FTgReferralEntry>                    m_arrReferrals;                                           // 0x0848(0x0010) (NeedCtorLink)
	int                                                m_nTutorialEntryTries;                                    // 0x0858(0x0004)
	float                                              m_fLoadHudTimer;                                          // 0x085C(0x0004)
	TArray<struct FTgNavProperties>                    m_arrNavProperties;                                       // 0x0860(0x0010) (NeedCtorLink)
	struct FString                                     m_cachedFailedJoinChallengeSessionGuid;                   // 0x0870(0x0010) (NeedCtorLink)
	struct FString                                     m_passwordForFailedJoinChallenge;                         // 0x0880(0x0010) (NeedCtorLink)
	class UTgAnnouncerPreviewer*                       m_AnnouncerPreview;                                       // 0x0890(0x0008)
	struct FTgReportPlayer                             m_ReportPlayer;                                           // 0x0898(0x0044) (NeedCtorLink)
	class UOnlineSubsystem*                            OnlineSub;                                                // 0x08DC(0x0008)
	TScriptInterface<class UOnlinePlayerInterface>     PlayerInterface;                                          // 0x08E4(0x0010)
	TScriptInterface<class UOnlineGameInterface>       GameInterface;                                            // 0x08F4(0x0010)
	TScriptInterface<class UOnlinePlayerInterfaceEx>   PlayerInterfaceEx;                                        // 0x0904(0x0010)
	TScriptInterface<class UOnlineMarketplaceInterface> MarketplaceInterface;                                     // 0x0914(0x0010)
	TScriptInterface<class UOnlineVoiceInterface>      VoiceInterface;                                           // 0x0924(0x0010)
	TScriptInterface<class UOnlineContentInterface>    ContentInterface;                                         // 0x0934(0x0010)
	struct FScriptDelegate                             __OnPrivilegeCallback__Delegate;                          // 0x0944(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0944(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgMoviePlayer");
		return ptr;
	}


	void STATIC_usc_PauseGame(bool shouldPause);
	void STATIC_usc_minimap_hovered(float X, float Y, const struct FString& MapName);
	void STATIC_usc_minimap_pinged(float X, float Y, const struct FString& Type, const struct FString& MapName);
	void STATIC_usc_PauseGameToggle();
	bool STATIC_usc_isAllowedPause();
	bool IsAccountPickerOpen();
	void usc_ShowContentPurchaseUI(const struct FString& SignedOffer);
	void GetAvailableProducts(int nControllerId, TEnumAsByte<EMediaItemType> MediaType, TArray<struct FMarketplaceProductDetails>* Products);
	void ShowContentPurchaseUI(const struct FString& SingedOffer);
	void GetInventoryItems(TArray<struct FMarketplaceInventoryItem>* InventoryItems);
	bool CanShowContentPurchaseUI();
	bool UnregisterLocalTalker(unsigned char LocalUserNum, unsigned char ChannelIndex);
	bool RegisterLocalTalker(unsigned char LocalUserNum, unsigned char ChannelIndex);
	void ShowNotification(int nType, const struct FString& Message, const struct FString& Message2, class UGFxObject* Data);
	void HideNotification(int nType);
	void STATIC_TestShowNotification();
	void STATIC_TestHideNotification();
	void LogFocus();
	void SetGamepadMode(bool bIsGamepad);
	void SetModal(class UGFxObject* modalObj);
	void ClearModal();
	void EndLoading(const struct FString& KeyName);
	void StartLoading(const struct FString& KeyName);
	void GainFocus(class UGFxObject* focusObj);
	void FindFocus();
	void RegainFocus();
	void LostFocus();
	void SetOnlineStatus(unsigned char LocalUserNum, const struct FString& StatusString, bool PlayerActive);
	void DisableVideoRecording();
	void EnableVideoRecording();
	int STATIC_usc_get_gamestate();
	void STATIC_UIDebugModeEnd();
	void STATIC_UIDebugModeWatch(const struct FString& sPath, int nDrillInDepth);
	void STATIC_UIDebugModeNavigation();
	void STATIC_UIDebugModeHighlight(bool mousableOnly);
	void STATIC_ToggleAlienFX();
	void FlashCaptureMouse();
	void FlashReleaseMouse();
	void ListOpenScenes();
	void CloseAllScenes();
	void EnableItemWarningPopup();
	void DisableItemWarningPopup();
	void ClosePartyInviteDialog();
	void DisplayLoginUI();
	bool ShouldBlockKey(int ControllerId, const struct FName& ButtonName, TEnumAsByte<EInputEvent> Event);
	void STATIC_usc_ClipboardCopy(const struct FString& Str);
	struct FString STATIC_usc_ClipboardPaste();
	void STATIC_OnPlayerCardComplete(bool bWasSuccessful);
	bool WidgetUnloaded(const struct FName& WidgetName, const struct FName& WidgetPath, class UGFxObject* Widget);
	bool WidgetInitialized(const struct FName& WidgetName, const struct FName& WidgetPath, class UGFxObject* Widget);
	void ReadOnlinePlayerData(TArray<struct FString> PlayerIDs, bool bIncludePresence);
	void CleanupUC();
	void InitOSSRef();
	void Init(class ULocalPlayer* LocPlay);
	void PostWidgetInit();
	void Tick(float DeltaTime);
	void STATIC_usc_findIndicesForCapitalSizeCharacters(const struct FString& sourceText, class UGFxObject* out_capitalIndices);
	void STATIC_usc_report_player(const struct FString& sPlayerName, int nReasonCode, const struct FString& sReason, int nTaskForce, int nPlayerCount, int nReportedPlayerTaskForce);
	void DebugSimulmediaVideoPlayer();
	void DebugIntroVideo();
	void DebugActivities();
	bool STATIC_usc_GetAppSettings(const struct FString& pSetting);
	void STATIC_OnClearCachedJoinChallengeTimer();
	void STATIC_OnJoinChallengePasswordPopup(class UTgPagePopup* pData, struct FPopupResponse* Response);
	void STATIC_FlushKeyboardBinds();
	void STATIC_ToggleInputConfirm(bool bEnable);
	void STATIC_TestInputHud(bool isGamePad);
	void ForcePSPlus(bool bShouldForce);
	void STATIC_usc_MuteVivoxPlayer(const struct FString& sPlayerId, bool Toggle, const struct FString& sPlatformId);
	void STATIC_OnReferralSelected(class UTgEventDataItem* pEvent);
	bool STATIC_usc_GetFinalInputMatchSetting();
	bool STATIC_usc_GetFinalCrossplaySetting();
	bool STATIC_ShowGodPackPurchase();
	bool GetOwnsGodPack();
	void DestroyVideoPlayer();
	void OnVideoError(class APComVideoPlayer* VideoPlayer, TEnumAsByte<EPComVideoPlayerError> ErrorCode);
	void SpawnVideoPlayer(class AActor* SpawningActor);
	void STATIC_PrintUIGameInputIntercepts();
	void STATIC_PrintInputCaptures();
	void STATIC_PrintFocusStack();
	void STATIC_PrintGameInfo();
	void NativeVideoPlayerDestroy();
	void HandleVideoPlayerErrorCallback(class APComVideoPlayer* VideoPlayer, TEnumAsByte<EPComVideoPlayerError> ErrorCode);
	bool CheckForGlobalKeyInput(int ControllerId, const struct FName& ButtonName, TEnumAsByte<EInputEvent> Event);
	void STATIC_OnToggleSkillScreen(class UTgEventDataItem* pEvent);
	void STATIC_OnVendorStoreToggle(class UTgEventDataItem* pEvent);
	void STATIC_OnVendorStoreClose(class UTgEventDataItem* pEvent);
	void STATIC_OnVendorStoreOpen(class UTgEventDataItem* pEvent);
	void STATIC_usc_NativeLog(const struct FString& sValue);
	bool STATIC_usc_getIsGamePadInput();
	void STATIC_usc_saveTransformSettings(const struct FString& TransformSettings);
	struct FString STATIC_usc_loadTransformSettings();
	void STATIC_OnVideoPlaybackEnded();
	bool STATIC_usc_ShowKeyboardUI(class UGFxObject* FocusedTextField, const struct FString& TitleText, const struct FString& DescriptionText, bool bIsPassword, bool bShouldValidate, const struct FString& DefaultText, int MaxResultLength);
	bool STATIC_usc_HideKeyboardUI();
	bool STATIC_usc_IsShowingKeyboardUI();
	void STATIC_OnResolveChatMessage(bool bSuccess, class UTgPlayerNameManager* pManager);
	void STATIC_OpenPurchaseGems(const struct FString& SKUCode);
	void ClaimPendingChatMessages(TArray<class UTgChatData*>* out_arrData);
	void STATIC_ShowHudChatMessage(class UTgChatData* pData);
	void STATIC_TestShowMessage(const struct FString& msg);
	void STATIC_gfxProcessSound(const struct FName& aThemeName, const struct FName& aEventName);
	void STATIC_OnBattlePassToastUpdate(class UTgEventDataItem* pEvent);
	void STATIC_OnInputModeChanged(class UTgEventDataItem* pEvent);
	void HandleClanPlayerInviteUpdates(const struct FPointer& pEvent);
	bool STATIC_usc_send_chat(int nChannel, const struct FString& msg, const struct FString& Recipient);
	bool STATIC_usc_can_view_ugc();
	void ASC_ShowFriendsUI();
	void STATIC_SetupPurchaseWithProductId(const struct FString& sProductId);
	void ClaimGift(const struct FString& nAcqId);
	void STATIC_TestListPendingGifts();
	void STATIC_TestSendGift(int nPlayerId, int nMessageIndex, bool bAnon);
	struct FString FixLocalizationKeybinds(const struct FString& sMsg);
	class UTgGFxPlayerData* GetPlayerData(struct FTgPlayerId* pid);
	void AttemptToJoinTutorial(float DeltaTime);
	void CallPrivilegeDelegate(const struct FScriptDelegate& delCallback, TEnumAsByte<EFeaturePrivilege> ePriv, TEnumAsByte<EFeaturePrivilegeLevel> ePermiss);
	void CheckOnlinePrivileges(TEnumAsByte<EFeaturePrivilege> ePriv, const struct FScriptDelegate& delCallback);
	void CancelCheckOnlinePrivileges(class UObject* pScope);
	void STATIC_OnVGSCustomMessage(bool bSuccess, const struct FString& sText);
	void STATIC_TryEstablishPlatformSession(const struct FPointer& pMarshal);
	void STATIC_OnForceMatchDataUpdate(class UTgEventDataItem* pEvent);
	void STATIC_OnMatchDataChange(class UTgEventDataItem* pEvent);
	void STATIC_ReceiveMatchData(const struct FPointer& pMarshal);
	bool STATIC_UnregisterLocalPlayerForVoice(unsigned char ChannelIndex);
	bool STATIC_RegisterLocalPlayerForVoice(unsigned char ChannelIndex);
	void STATIC_UpdateCameraBasedOnNavAction();
	void EquipLoadoutItem(int nItemId);
	void NavigateTo(struct FNavParams* Params);
	void HandleEscapeKey();
	void STATIC_usc_goto_item(int nItemId, bool bUseAltRedirect);
	void GotoItem(int nItemId, int nReturnToTarget, int nReturnToEvent, bool bUseAltRedirect);
	bool STATIC_RedirectToItemObtainLocation(int nItemId);
	bool STATIC_ShowGodVideo(int nGodVideoId, const struct FString& sGodVideoUrl);
	void goto_lobby(bool bAtEOM);
	class UTgGFxObject* GetRoot();
	class UGFxObject* GetWidget(const struct FName& WidgetName);
	void STATIC_TestMatchLobby(int nQueue, bool bPreSelect, int nTeamCount, int nPlayerPerTeam);
	struct FString GetHUDTeamName(bool bEnemy);
	void STATIC_SetLanguage();
	void STATIC_ShowLoginMessage(const struct FString& sMsg);
	void STATIC_ShowLoginUI();
	void STATIC_ShowNormalUI();
	struct FIntStringPair GetAndClearLastLoginError();
	void STATIC_TestClearDeferBlacklist();
	bool STATIC_TestAddDeferBlacklistEntry(int newEntry);
	void STATIC_TestDeferBlacklist(bool bQueue);
	void STATIC_TestShowPopupModal(int nType);
	void STATIC_TestSendPlayerTrackingEvent(int nEvent, int nSubEvent, const struct FString& sRefName, int nRefValue);
	void STATIC_TestPurchaseClanNameChange(const struct FString& sName, const struct FString& sTag);
	void STATIC_TestShowAcquisition(int nType, int nLootId);
	void STATIC_SendCloseAllPopup();
	void SendClosePopup();
	void SendOpenPopup(class UTgPagePopup* pPopup);
	void STATIC_SetSceneLoadPermissions(const struct Fdword& fPermiss);
	void STATIC_PlayerLoginError(int nError, const struct FString& sMessage);
	void STATIC_SetLoginReady(bool fromIntro);
	void STATIC_OnLobbyStateChange(class UTgEventDataItem* pEvent);
	void STATIC_OnHUDStateChange(class UTgEventDataItem* pEvent);
	void STATIC_OnSpectateFail(class UTgEventDataItem* pEvent);
	struct FString STATIC_USC_GetCurrencyName(int nCurrencyValidValue);
	int STATIC_usc_getConsolePlatform();
	bool STATIC_usc_isConsole();
	void AttemptAutoLogin();
	void STATIC_usc_acceptEULA();
	bool STATIC_usc_createPlayerName(const struct FString& sLoginName, const struct FString& sPass, const struct FString& sNewPlayerName);
	bool STATIC_USC_Login(const struct FString& sUsername, const struct FString& sPassword);
	bool STATIC_USC_LoginExits();
	bool STATIC_usc_isLoginReady();
	void STATIC_USC_ShowEndOfMatch(bool bShow);
	void UpdateVoiceChatPlayer(const struct FString& sPId, bool bIsActive, bool bIsSpeaking);
	void STATIC_usc_toggle_voice_mute(const struct FString& sConsoleId, int nPortalType, const struct FString& sPlayerName, const struct FString& sPlayerId, bool bMute);
	void STATIC_usc_toggle_player_mute(const struct FString& ConsoleIdString, const struct FString& PlayerName, const struct FString& sPlayerId);
	bool STATIC_usc_add_to_party(const struct FString& sConsoleId, int nPortalType, const struct FString& sPlayerId, const struct FString& sPlayerName);
	bool STATIC_usc_can_invite_to_party(const struct FString& sPlayerId);
	bool STATIC_usc_add_to_clan(const struct FString& sConsoleId, int nPortalType, const struct FString& sPlayerId, const struct FString& sPlayerName);
	bool STATIC_usc_can_invite_to_clan(const struct FString& sPlayerId);
	float STATIC_usc_get_queue_timer(int nQueueId);
	bool STATIC_usc_can_cancel_spectate();
	void STATIC_usc_disconnect();
	void STATIC_usc_CancelQueue();
	bool is_item_owned(int ItemId);
	bool STATIC_SetUIDisplayMode(int displayMode);
	class UGFxObject* STATIC_usc_getItemData(int ItemId, int quantityCount, int vendorId);
	void STATIC_usc_Scene_Manager_Scene_Unloaded(const struct FString& sSceneName);
	void STATIC_usc_Scene_Manager_Scene_Loaded(const struct FString& sSceneName);
	void STATIC_update_player_mute();
	void STATIC_TryToggleMute(bool bShouldMute);
	void STATIC_ShowPopupMessage(const struct FString& sTitle, const struct FString& sMessage);
	void STATIC_ShowErrorMessage(const struct FString& sTitle, const struct FString& sMessage, bool _user_must_close);
	void STATIC_SetHUDVisiblity();
	void STATIC_OnDemoReady();
	void AddRecentlyInvited(struct FTgPlayerId* pid);
	int GetRecentlyInvitedTimeRemain(struct FTgPlayerId* pid);
	bool HasRecentlyInvited(struct FTgPlayerId* pid);
	bool STATIC_usc_isItemEquippable(int nItemId);
	bool STATIC_usc_isItemEquipped(int nItemId);
	int STATIC_usc_GetActiveGamepadIndex(int nPlayerIndex);
	int STATIC_usc_RegisterCardTexture(class UGFxObject* Widget, int nItemId, float X, float Y, float Width, float Height, bool bOnlyIfMat);
	class UGFxObject* GetTestNotificationData();
	void STATIC_usc_UnregisterCardTextureById(int nCardId);
	void STATIC_usc_UnregisterCardTexture(class UGFxObject* Widget);
	void STATIC_StartBatchPurchaseRequest();
	void GetFeedback(int nType);
	void CompleteBatchPurchaseRequest();
	void AddBatchPurchaseRequest(int nVendorId, int nItemId, int nPriceInUI, int nCurrencyType, int nQuantity, const struct Fdword& locationId, int nCouponId);
	struct FString STATIC_usc_get_class_purchase_pricing(int nClassId);
	struct FString STATIC_usc_GetGameName();
	int GetSysCounterValue(int nCounterId);
	int GetPortalType();
	bool STATIC_usc_is_time_between(const struct FString& Start, const struct FString& End);
	bool STATIC_usc_isFriend(const struct FString& sPlayerId);
	bool STATIC_usc_is_party_leader();
	bool STATIC_usc_can_invite_players();
	bool STATIC_usc_ableToSkipTutorial();
	void STATIC_usc_watch_eom_replay(const struct FString& sInstanceId);
	void STATIC_usc_remove_music_theme(int nItemId, const struct FString& sEventName);
	void STATIC_usc_add_music_theme(int nItemId, const struct FString& sEventName);
	void STATIC_usc_test_music_theme(int nItemId, const struct FString& sEventName);
	void STATIC_usc_show_god_detail(int nClassId);
	void STATIC_usc_request_goto_lobby(const struct FString& Title, const struct FString& Desc);
	void STATIC_usc_redeem_login_bonus();
	void STATIC_usc_queue_create_team(int nQueueId, const struct FString& sPassword);
	void STATIC_usc_onServerStabilityFeedback();
	void STATIC_usc_match_suggest_pick(int nClassId);
	void STATIC_usc_match_suggest_ban(int nClassId);
	void STATIC_usc_match_cancel_role_trade();
	void STATIC_usc_match_request_role_trade(const struct FString& sPlayerId);
	void STATIC_usc_match_request_trade(const struct FString& sPlayerId);
	void STATIC_usc_match_request_random_class();
	void STATIC_usc_match_purchase_voice_pack(int nVoicePackItemId);
	void STATIC_usc_match_close_random_class_popup();
	void STATIC_usc_match_cancel_trade();
	void STATIC_usc_match_ban_class(int nClassId);
	void STATIC_usc_kick_team_player(const struct FString& sPlayerName);
	void STATIC_usc_introFinished();
	void STATIC_Replay(int nInstanceId, const struct FString& sPassword);
	void ChangeHudSection(const struct FString& Section, float percentX, float percentY, float Scale, float dockX, float dockY, const struct FString& dockObj, float dockObjX, float dockObjY, bool outX, bool outY);
	struct FString STATIC_usc_GetHudSkinPath();
	class UGFxObject* STATIC_usc_get_date_est();
	int STATIC_usc_get_time();
	int STATIC_usc_get_server_time_secs();
	int STATIC_usc_get_server_time();
	int STATIC_usc_SyncMorriganPassiveMeter(class UGFxObject* passiveMeter);
	int STATIC_usc_GetRentedTimeLeft(int nItemId, int nIdType);
	bool STATIC_usc_resize_browser(int surfaceId, float X, float Y, float Width, float Height, float widthReal, float heightReal);
	bool STATIC_usc_match_can_purchase_random_class(int nQueueId);
	bool STATIC_usc_is_item_owned(const struct FString& ItemId);
	bool STATIC_usc_is_in_game();
	bool STATIC_usc_isInTutorial();
	bool STATIC_usc_isInSiege();
	bool STATIC_usc_isCapsLockActive();
	bool STATIC_usc_can_play_again();
	bool STATIC_usc_IsGameBit(int iGB);
	bool STATIC_usc_ConfirmHudSkin(int nId);
	void STATIC_usc_viewStatsOnline(const struct FString& sInstanceId);
	void STATIC_usc_upgrade_item(int nItemId, int nUpgradeInvId);
	void STATIC_usc_unregister_mouse_region(const struct FString& Key);
	void STATIC_usc_test_voice_pack(int nVoicePackId, int nSkinId);
	void STATIC_usc_test_announcer_pack(int nItemId);
	void STATIC_usc_surrender(bool bSurrender);
	void STATIC_usc_show_skin(int nSkinId);
	void STATIC_usc_set_auto_skill_up(bool bAutoSkill, bool bForMatch);
	void STATIC_usc_set_auto_purchase(bool bAutoPurchase, bool bForMatch);
	void STATIC_usc_sell_item(int nInventoryId);
	void STATIC_usc_resend_private_messages();
	void STATIC_usc_request_treasure_roll(int nItemId, int CurrencyType);
	void STATIC_usc_keep_me_logged_in(bool bNewValue);
	void STATIC_usc_rejectNotification(int nNotificationType, int nId);
	void STATIC_usc_register_mouse_region(const struct FString& Key, int X, int Y, int Width, int Height);
	void STATIC_usc_redeem_reward(int nActId, int nGoalId, int nCount);
	void STATIC_usc_queue_leave();
	void STATIC_usc_purchase_item(int nItemId, int nAmount);
	void STATIC_usc_play_again();
	void STATIC_usc_passwordInputFocus();
	void STATIC_usc_open_triumph_chest(int nLootTableItemId);
	void STATIC_usc_nameInputFocus();
	void STATIC_usc_match_lock_in();
	void STATIC_usc_match_choose_skin(int nSkinId);
	void STATIC_usc_match_choose_class(int nClassId);
	void STATIC_usc_friend_action(const struct FString& sType, const struct FString& sPlayerId);
	void STATIC_usc_enable_browser_input(bool bEnable);
	void STATIC_usc_close_eom_lobby(int nNavigationTarget);
	void STATIC_usc_clearLeagueDC();
	void STATIC_usc_attempt_auto_login();
	void STATIC_usc_acceptNotification(int nNotificationType, int nId);
	void STATIC_usc_Accept_Match_Invite();
	void UnloadHudSection(const struct FString& Section);
	void STATIC_USC_ShowLeaderboard(const struct FString& sName, int nValue, int nOption);
	void STATIC_SetSpecTeamName(bool bEnemy, const struct FString& TeamName);
	void STATIC_SetSpecState(const struct FString& stateString);
	void EndLobbyPlayback();
	void CancelPlayback();
	void STATIC_USC_SelectedPopup(int nActionId, const struct FString& sInputValue, const struct FString& sSecondaryInputValue);
	bool STATIC_TryPopupCallback(int nActionId, const struct FString& sInputValue, const struct FString& sSecondaryInputValue);
	void AddInitialChatMessages();
	void FakeItemToast(int nItemId);
	void CloseChatTab(int nChannel, const struct FString& sSender);
	void STATIC_OpenChatTab(int nChannel, bool bForce);
	void STATIC_UpdateMapBackground();
	void AttemptAutoReplayDemoRecording();
	void STATIC_usc_chat_ready();
	void STATIC_usc_vgs_command(int nId, bool bSubMenu);
	void STATIC_usc_chat_close_tab(int nChannel, const struct FString& Sender);
	int STATIC_usc_get_sellback_price(int nItemId);
	int STATIC_usc_full_sellback_available(int nItemId);
	void STATIC_usc_set_chat_channel(int nChannel);
	void AddRemoveDeferredChannelTab(bool bAdd, int nChannelId);
	bool STATIC_usc_can_view_user_content();
	void STATIC_UnregisterForJSON(class UPComUIManagerBase* pRegistrant, const struct FString& sJsonName);
	void STATIC_RegisterForJSON(class UPComUIManagerBase* pRegistrant, const struct FString& sJsonName);
	void STATIC_UnregisterMctsCallbacks();
	void STATIC_RegisterMctsCallbacks();
	void STATIC_OpenWorldScene(const struct FString& CameraName, int cameraTransitionType);
	bool STATIC_usc_IME_Exists();
	bool STATIC_usc_IME_SetEnabled(bool bEnabled);
	void STATIC_usc_view_player_profile(const struct FString& sPlayerId, const struct FString& sPlayerName, const struct FString& sProfileTab);
	void STATIC_usc_view_platform_player_card(const struct FString& sPlayerId, const struct FString& sPlayerName);
	void STATIC_UpdatePromptMode(class UGFxObject* pObj);
	void STATIC_SetButtonPromptMode(int nMode);
	bool STATIC_usc_HasPlayerLogin();
	struct FString STATIC_usc_getFontSize(const struct FString& Identifier, const struct FString& SectionName);
	struct FString STATIC_usc_TranslateMsg(const struct FString& Identifier, const struct FString& SectionName);
	struct FString STATIC_usc_TranslateMsgId(int nId);
	void STATIC_ShowTransitionScene(bool bShow);
	bool STATIC_usc_is_safe_to_load(const struct FString& sUrl);
	void STATIC_usc_toggle_key_capture(bool bCapture);
	void STATIC_usc_toggle_cursor(bool bShow, bool bOnlyVisibility);
	void STATIC_usc_quit();
	void STATIC_usc_Console_Command(const struct FString& Cmd);
	void STATIC_usc_Scene_Manager_Created();
	void STATIC_usc_Event_Mediator_Created();
	void STATIC_usc_Data_Handler_Created();
	void GotoSendGift(const struct FPointer& pPID);
	void STATIC_ProcessUIEvents();
	void STATIC_UIChangeEvent(class AActor* refActor, TEnumAsByte<EUIChangeEvent> Event, bool bUnique, int subType);
	void UnregisterEngineCallbacks();
	void STATIC_RegisterEngineCallbacks();
	struct FString GetKeyBindText(const struct FString& Command, int nAlternate, bool bUseLookup);
	struct FString GetTranslatedSpecKeyBind(const struct FString& Command, int nAlternate, bool bUseLookup);
	struct FString GetTranslatedKeyBind(const struct FString& Command, int nAlternate, bool bUseLookup);
	void STATIC_UpdateViewportForSafeAreas();
	void STATIC_OnMatchTimeout(float nDeltaTime);
	void NativeTick(float DeltaTime);
	void OnClose();
	void PostInit();
	void InitializeSceneManager();
	void InitializeDataHandler();
	class UTgDataGroup_Settings* GetSettingsData();
	class UTgDataGroup_EOMLobby* GetEOMLobbyData();
	class UTgLobbyDC_BattlePass* GetBattlePassDataChunk();
	class UTgLobbyDC_Inventory* GetLobbyInventoryDataChunk();
	class UTgGameDC_Player* GetCharacterBuilderData();
	class UTgLobbyDC_Lobby* GetLobbyDataChunk();
	class UTgLobbyDC_Match* GetMatchDataChunk();
	class UTgDataGroup_Lobby* GetLobbyData();
	class UTgDataGroup_Game* GetGameData();
	class UTgUIServerStates* GetStateInfo();
	class UTgEsportsManager* GetESportsManager();
	class UTgDeferManager* GetDeferManager();
	class UTgIntervalManager* GetIntervalManager();
	class UTgEventDispatcher* STATIC_GetDispatcher();
	class ATgClientHUD* GetHUD();
	class ATgPlayerController* STATIC_GetPlayerOwner();
	void OnPrivilegeCallback(TEnumAsByte<EFeaturePrivilege> ePriv, TEnumAsByte<EFeaturePrivilegeLevel> ePermiss);
};


// Class TgClientBase.TgBrowserManager
// 0x00A0 (0x0100 - 0x0060)
class UTgBrowserManager : public UPComBrowserManager
{
public:
	class UTgMoviePlayer*                              m_pMovie;                                                 // 0x0060(0x0008)
	struct FString                                     URLGold;                                                  // 0x0068(0x0010) (NeedCtorLink)
	struct FString                                     URLCreateAccount;                                         // 0x0078(0x0010) (NeedCtorLink)
	struct FString                                     URLRecoverPassword;                                       // 0x0088(0x0010) (NeedCtorLink)
	struct FString                                     URLRecoverUsername;                                       // 0x0098(0x0010) (NeedCtorLink)
	struct FString                                     URLGodPack;                                               // 0x00A8(0x0010) (NeedCtorLink)
	struct FString                                     URLFacebookPromo;                                         // 0x00B8(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitterPromo;                                          // 0x00C8(0x0010) (NeedCtorLink)
	struct FString                                     URLRecruitPromo;                                          // 0x00D8(0x0010) (NeedCtorLink)
	struct FString                                     URLReferLinkup;                                           // 0x00E8(0x0010) (NeedCtorLink)
	class UTgGFxBrowser*                               m_container;                                              // 0x00F8(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgBrowserManager");
		return ptr;
	}


	void OpenWebPage(int pageType, bool bExternal, bool bShowNavButtons, bool bAddLang);
	struct FString GetURLByPageType(int pageType);
	void OpenWebPageWithTarget(int pageType, const struct FString& urlTarget, bool bExternal, bool bShowNavButtons);
	void STATIC_SetContainer(class UTgGFxBrowser* pContainer);
	void STATIC_ResizeView();
	void Close();
	void STATIC_OpenVideo(const struct FString& URL);
	void OpenURL(const struct FString& URL, bool bShowNavButtons, bool bSetFocus);
	void ExternalOpenURL(const struct FString& URL, bool bAddLang);
	void STATIC_OnLobbyStateChange(class UTgEventDataItem* pEvent);
	void STATIC_Initialize(class UTgMoviePlayer* theMovie);
	bool IsBrowserLoaded();
};


// Class TgClientBase.TgButtonPromptEvent
// 0x0008 (0x007C - 0x0074)
class UTgButtonPromptEvent : public UTgEventDataItem
{
public:
	struct FPointer                                    m_buttonPrompts;                                          // 0x0074(0x0008) (Const, Native)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgButtonPromptEvent");
		return ptr;
	}

};


// Class TgClientBase.TgCanvasDrawInterface
// 0x0000 (0x0060 - 0x0060)
class UTgCanvasDrawInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgCanvasDrawInterface");
		return ptr;
	}


	void DrawCanvas(class UCanvas* pCanvas);
};


// Class TgClientBase.TgChangeHudSectionEvent
// 0x0040 (0x00B4 - 0x0074)
class UTgChangeHudSectionEvent : public UTgEventDataItem
{
public:
	struct FTgHudSectionInfo                           Info;                                                     // 0x0074(0x0040) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgChangeHudSectionEvent");
		return ptr;
	}

};


// Class TgClientBase.TgChatData
// 0x00A0 (0x0100 - 0x0060)
class UTgChatData : public UObject
{
public:
	int                                                m_nId;                                                    // 0x0060(0x0004)
	int                                                m_nSoundId;                                               // 0x0064(0x0004)
	int                                                m_nChannel;                                               // 0x0068(0x0004)
	unsigned long                                      m_bWarning : 1;                                           // 0x006C(0x0004)
	unsigned long                                      m_bFeedback : 1;                                          // 0x006C(0x0004)
	unsigned long                                      m_bHideSender : 1;                                        // 0x006C(0x0004)
	unsigned long                                      m_bNew : 1;                                               // 0x006C(0x0004)
	unsigned long                                      m_bIsVGS : 1;                                             // 0x006C(0x0004)
	unsigned long                                      m_bOnlyIfOpen : 1;                                        // 0x006C(0x0004)
	struct FString                                     m_sSender;                                                // 0x0070(0x0010) (NeedCtorLink)
	struct FString                                     m_sMessage;                                               // 0x0080(0x0010) (NeedCtorLink)
	struct FString                                     m_sTimestamp;                                             // 0x0090(0x0010) (NeedCtorLink)
	struct FString                                     m_sSenderColor;                                           // 0x00A0(0x0010) (NeedCtorLink)
	struct FString                                     m_sSenderClass;                                           // 0x00B0(0x0010) (NeedCtorLink)
	struct FString                                     m_sMessageColor;                                          // 0x00C0(0x0010) (NeedCtorLink)
	struct FString                                     m_ColorVGS;                                               // 0x00D0(0x0010) (NeedCtorLink)
	struct FString                                     m_ColorWarn;                                              // 0x00E0(0x0010) (NeedCtorLink)
	struct FString                                     m_sWarningToken;                                          // 0x00F0(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgChatData");
		return ptr;
	}


	struct FString TokenReplace(const struct FString& Message, const struct FString& Token, const struct FString& sValue);
	bool CheckWarning(const struct FString& Message);
};


// Class TgClientBase.TgChatEvent
// 0x0044 (0x00B8 - 0x0074)
class UTgChatEvent : public UTgEventDataItem
{
public:
	int                                                nChatEvent;                                               // 0x0074(0x0004)
	struct FString                                     sMessage;                                                 // 0x0078(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     sPlayerName;                                              // 0x0088(0x0010) (AlwaysInit, NeedCtorLink)
	struct FQWord                                      nPlayerId;                                                // 0x0098(0x0008)
	struct Fdword                                      nMessageId;                                               // 0x00A0(0x0004)
	int                                                nChatChannel;                                             // 0x00A4(0x0004)
	int                                                nTime;                                                    // 0x00A8(0x0004)
	int                                                nFlags;                                                   // 0x00AC(0x0004)
	struct FPointer                                    pMarshal;                                                 // 0x00B0(0x0008) (Native)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgChatEvent");
		return ptr;
	}

};


// Class TgClientBase.TgClientBaseHUD
// 0x0000 (0x0588 - 0x0588)
class ATgClientBaseHUD : public ATgHUD
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClientBase.TgClientBaseHUD");
		return ptr;
	}

};


// Class TgClientBase.TgClientHUD
// 0x0068 (0x05F0 - 0x0588)
class ATgClientHUD : public ATgClientBaseHUD
{
public:
	struct FPointer                                    m_pTgCallbackDevice;                                      // 0x0588(0x0008) (Native)
	TArray<TScriptInterface<class UTgCanvasDrawInterface>> m_arrPostRenders;                                         // 0x0590(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<class UGFxMoviePlayer*>                     m_MoviePlayers;                                           // 0x05A0(0x0010) (AlwaysInit, NeedCtorLink)
	class UTgMoviePlayer*                              m_pMovie;                                                 // 0x05B0(0x0008) (AlwaysInit)
	class UClass*                                      m_MainMovieClass;                                         // 0x05B8(0x0008)
	struct Fdword                                      m_nHudState;                                              // 0x05C0(0x0004)
