#pragma once

// SMITE (8.2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SM_Basic.hpp"
#include "SM_Core_classes.hpp"
#include "SM_Engine_classes.hpp"
#include "SM_PlatformCommon_classes.hpp"
#include "SM_GameFramework_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_TGDST_BLESSING                                     16927
#define CONST_TGEGC_SILENCE                                      10053
#define CONST_TGACH_BELL_HAMMER_DEV_ID                           11137
#define CONST_TGPID_PROTECTION_PULL                              1360
#define CONST_TGPID_CAPTURE_RATE_PERCENT                         426
#define CONST_BNT_CONDITION_COMBAT_IS_TARGET_OF_TWR_OR_MTR       287
#define CONST_TGACH_BELL_HAMMER_ID                               11138
#define CONST_TGPID_MIN_AGENTS                                   401
#define CONST_TGEGC_RAMA_A02_BUFF                                17887
#define CONST_TGEGC_TSUKUYOMI_INHAND_WHITE_MOONLIGHT             17909
#define CONST_NOX_TGEGC_DEV1_SHIELD_CATEGORY_CODE                10950
#define CONST_INDEX_SEE_STEALTHED_ENEMY                          4
#define CONST_ITEM_ID_BUMBAS_MASK_S3                             12285
#define CONST_TGPAWN_RAM_ULT_MARK_ID                             10117
#define CONST_TGEGC_KALI_MARKED_LOWHEALTH                        10910

#define CONST_YMIR_CACODEMON_SHARDS_ID                           3286
#define CONST_YMIR_DIGIMIR_SHARDS_ID                             3641
#define CONST_YMIR_SHARDS_EXPLOSION_ID                           5245
#define CONST_TGEGC_ZEUS_DEV3_DISARM                             11275
#define CONST_TGPAWN_ZHONGKUI_FIERCEGLARE_HEAL_SUB_ID            9172
#define CONST_TGPAWN_ZHONGKUI_FIERCEGLARE_MESH_ID                3724
#define CONST_TGPAWN_ZHONGKUI_FIERCEGLARE_MAX                    16
#define CONST_TGPAWN_ZHONGKUI_MARKED_SITUATIONAL_TYPE            10680
#define CONST_TGPAWN_ZHONGKUI_BAGMORPH_CURVE_MAX                 10
#define CONST_TGPAWN_ZHONGKUI_RECALLDEMON_SHOTS                  5
#define CONST_BASE_AFK_DURATION                                  90.0f
#define CONST_INCREMENTAL_AFK_DURATION                           60.0f
#define CONST_m_fMinLookAccelSpeed                               0
#define CONST_m_fMaxLookAccelSpeed                               10.0
#define CONST_INPUT_BLOCK_TIME_WINDOW                            10.0f
#define CONST_INPUT_BLOCK_COOLDOWN_TIME                          15.0f
#define CONST_TGSKELETALMESH_OLORUN_CLONE_LEFT_MESH              11640
#define CONST_TG_ANHUR_SPACE_SKIN                                11603
#define CONST_TGPROJ_HERCULES_BOULDER_MESH_HEIGHT                -20.0f
#define CONST_MaxHitsPerJumongFanOfArrows                        3
#define CONST_TGPROJ_NEITH_WORLDWEAVER_TARGET_HIT_SOUND_FX_ID    2568
#define CONST_TG_ADVCART_STORE_MAX                               10
#define CONST_TGREPINFO_MULTIROUNDS_MAX_TEAMS                    4
#define CONST_TGPRI_PEP_ENTOURAGE_SPECIAL_UNIT_MAX               2
#define CONST_TGPRI_STORE_MAX                                    50
#define CONST_TG_MAX_PREMADE_DEPLOYS                             20
#define CONST_TG_MAX_PRIMARY_OBJECTIVES                          5
#define CONST_TG_MAX_TASK_TEAM_NUMBER                            10
#define CONST_TG_MAX_TF_CUSTOM_VALS                              10
#define CONST_TGPRI_PEP_INDEPENDENT_SPECIAL_UNIT_MAX             20
#define CONST_MERCURY_GHOST_MESH_ID                              3799
#define CONST_TGSKELETALMESH_OLORUN_CLONE_RIGHT_MESH             11642
#define CONST_FX_SCALE_BY_DAMAGE                                 745
#define CONST_FX_SCALE_ABSOLUTE                                  10677
#define CONST_INVALID_LIGHTARRAY_INDEX                           -1
#define CONST_ROTATION_FULL                                      0x10000
#define CONST_ROTATION_HALF                                      0x08000
#define CONST_ROTATION_SIXTEENTH                                 0x01000
#define CONST_RADIANS_TO_DEGREES                                 57.295779513082321600
#define CONST_DEGREES_TO_RADIANS                                 0.017453292519943296

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum TgGame.AlienFXManager.FXOverlay
enum class EFXOverlay : uint8_t
{
	FXO_NONE                       = 0,
	FXO_MENU                       = 1,
	FXO_DYING                      = 2,
	FXO_EVENT                      = 3,
	FXO_MAX                        = 4
};


// Enum TgGame.TgActionPoint.eActionPointType
enum class EeActionPointType : uint8_t
{
	ACTION_NONE                    = 0,
	ACTION_RELAX_OPEN              = 1,
	ACTION_MINE_DEFAULT            = 2,
	ACTION_RELAX_WALL              = 3,
	ACTION_CONSOLE_STANDARD        = 4,
	ACTION_CONSOLE_LAB_DEFAULT     = 5,
	ACTION_GUARD_WATCH_NORMAL      = 6,
	ACTION_GUARD_WATCH_ELEVATED    = 7,
	ACTION_FACTORY_LINE_DEFAULT    = 8,
	ACTION_SNIPE                   = 9,
	ACTION_PLACE_TURRET            = 10,
	ACTION_PLACE_SHIELD            = 11,
	ACTION_PLACE_CRATE             = 12,
	ACTION_PLACE_MINE              = 13,
	ACTION_PLACE_SENSOR            = 14,
	ACTION_MAX                     = 15
};


// Enum TgGame.TgActor_DeathFog.FogFxType
enum class EFogFxType : uint8_t
{
	FOGFX_NONE                     = 0,
	FOGFX_SPHERICAL                = 1,
	FOGFX_FLAT                     = 2,
	FOGFX_MAX                      = 3
};


// Enum TgGame.TgObject.PEPRewardType
enum class EPEPRewardType : uint8_t
{
	PEPR_Lane                      = 0,
	PEPR_Independent               = 1,
	PEPR_Entourage                 = 2,
	PEPR_MAX                       = 3
};


// Enum TgGame.TgObject.ETargetAcceptedType
enum class ETargetAcceptedType : uint8_t
{
	TARGET_ACCEPTED_None           = 0,
	TARGET_ACCEPTED_Monster        = 1,
	TARGET_ACCEPTED_God            = 2,
	TARGET_ACCEPTED_GM             = 3,
	TARGET_ACCEPTED_Structure      = 4,
	TARGET_ACCEPTED_SM             = 5,
	TARGET_ACCEPTED_SG             = 6,
	TARGET_ACCEPTED_SGM            = 7,
	TARGET_ACCEPTED_Decoy          = 8,
	TARGET_ACCEPTED_DM             = 9,
	TARGET_ACCEPTED_DG             = 10,
	TARGET_ACCEPTED_DGM            = 11,
	TARGET_ACCEPTED_DS             = 12,
	TARGET_ACCEPTED_DSM            = 13,
	TARGET_ACCEPTED_DSG            = 14,
	TARGET_ACCEPTED_All            = 15,
	TARGET_ACCEPTED_MAX            = 16
};


// Enum TgGame.TgObject.PEPRewardTier
enum class EPEPRewardTier : uint8_t
{
	PEPT_Tier1                     = 0,
	PEPT_Tier2                     = 1,
	PEPT_Tier3                     = 2,
	PEPT_MAX                       = 3
};


// Enum TgGame.TgObject.PEPPusherType
enum class EPEPPusherType : uint8_t
{
	PEP_PUSH_None                  = 0,
	PEP_PUSH_AoE                   = 1,
	PEP_PUSH_Swarm                 = 2,
	PEP_PUSH_Tank                  = 3,
	PEP_PUSH_MAX                   = 4
};


// Enum TgGame.TgObject.SpecialItemPurchaseException
enum class ESpecialItemPurchaseException : uint8_t
{
	SIPE_Allowed                   = 0,
	SIPE_Disallowed                = 1,
	SIPE_MAX                       = 2
};


// Enum TgGame.TgObject.EDevAcceptedType
enum class EDevAcceptedType : uint8_t
{
	DEV_ACCEPTED_None              = 0,
	DEV_ACCEPTED_Inhand            = 1,
	DEV_ACCEPTED_Offhand           = 2,
	DEV_ACCEPTED_OI                = 3,
	DEV_ACCEPTED_Passive           = 4,
	DEV_ACCEPTED_PI                = 5,
	DEV_ACCEPTED_PO                = 6,
	DEV_ACCEPTED_All               = 7,
	DEV_ACCEPTED_MAX               = 8
};


// Enum TgGame.TgObject.EDevOnTriggerType
enum class EDevOnTriggerType : uint8_t
{
	DEV_ON_None                    = 0,
	DEV_ON_StartFire               = 1,
	DEV_ON_Fire                    = 2,
	DEV_ON_Hit                     = 3,
	DEV_ON_Damaged                 = 4,
	DEV_ON_StopFire                = 5,
	DEV_ON_MAX                     = 6
};


// Enum TgGame.TgObject.EUISettingUpdate
enum class EUISettingUpdate : uint8_t
{
	UISU_All                       = 0,
	UISU_AudioVideo                = 1,
	UISU_Interface                 = 2,
	UISU_Control                   = 3,
	UISU_Targeting                 = 4,
	UISU_Gamepad                   = 5,
	UISU_MAX                       = 6
};


// Enum TgGame.TgObject.EPetPosition
enum class EPetPosition : uint8_t
{
	PETPOS_Default                 = 0,
	PETPOS_Front                   = 1,
	PETPOS_FrontRight              = 2,
	PETPOS_Right                   = 3,
	PETPOS_BackRight               = 4,
	PETPOS_Back                    = 5,
	PETPOS_BackLeft                = 6,
	PETPOS_Left                    = 7,
	PETPOS_FrontLeft               = 8,
	PETPOS_MAX                     = 9
};


// Enum TgGame.TgObject.EPetPhase
enum class EPetPhase : uint8_t
{
	PETPHASE_Default               = 0,
	PETPHASE_CodeOverride          = 1,
	PETPHASE_Heel                  = 2,
	PETPHASE_Follow                = 3,
	PETPHASE_Guard                 = 4,
	PETPHASE_Wait                  = 5,
	PETPHASE_MAX                   = 6
};


// Enum TgGame.TgObject.ReplicatedFactoryState
enum class EReplicatedFactoryState : uint8_t
{
	RFS_None                       = 0,
	RFS_Vacant                     = 1,
	RFS_Intro                      = 2,
	RFS_Spawned                    = 3,
	RFS_OwnedByTF1                 = 4,
	RFS_OwnedByTF2                 = 5,
	RFS_OwnedByTF3                 = 6,
	RFS_OwnedByTF4                 = 7,
	RFS_OwnedByTF5                 = 8,
	RFS_MAX                        = 9
};


// Enum TgGame.TgObject.EConquestRole
enum class EConquestRole : uint8_t
{
	ECR_Any                        = 0,
	ECR_Support                    = 1,
	ECR_Carry                      = 2,
	ECR_Mid                        = 3,
	ECR_Solo                       = 4,
	ECR_Jungle                     = 5,
	ECR_MAX                        = 6
};


// Enum TgGame.TgObject.EGodRole
enum class EGodRole : uint8_t
{
	EGR_Any                        = 0,
	EGR_Assassin                   = 1,
	EGR_Guardian                   = 2,
	EGR_Hunter                     = 3,
	EGR_Mage                       = 4,
	EGR_Warrior                    = 5,
	EGR_MAX                        = 6
};


// Enum TgGame.TgObject.ETrainingQuest
enum class ETrainingQuest : uint8_t
{
	ETQ_None                       = 0,
	ETQ_Kills                      = 1,
	ETQ_Escort                     = 2,
	ETQ_Other                      = 3,
	ETQ_MAX                        = 4
};


// Enum TgGame.TgObject.EPurchaseFailure
enum class EPurchaseFailure : uint8_t
{
	TGPF_None                      = 0,
	TGPF_UnknownItem               = 1,
	TGPF_UnavailableItem           = 2,
	TGPF_UnknownOwner              = 3,
	TGPF_NotEnoughCurrency         = 4,
	TGPF_NotEquipped               = 5,
	TGPF_AtStackLimit              = 6,
	TGPF_AlreadyPurchased          = 7,
	TGPF_NoAvailableSlots          = 8,
	TGPF_InvalidUpgrade            = 9,
	TGPF_CannotSell                = 10,
	TGPF_CannotSellInUse           = 11,
	TGPF_InvalidForCourier         = 12,
	TGPF_NotInTransaction          = 13,
	TGPF_CannotTransactInUse       = 14,
	TGPF_Unknown                   = 15,
	TGPF_MAX                       = 16
};


// Enum TgGame.TgObject.ERewardValueType
enum class ERewardValueType : uint8_t
{
	RVT_None                       = 0,
	RVT_Initial                    = 1,
	RVT_Spool                      = 2,
	RVT_Kill                       = 3,
	RVT_Assist                     = 4,
	RVT_Objective                  = 5,
	RVT_Bonus                      = 6,
	RVT_MAX                        = 7
};


// Enum TgGame.TgObject.GOD_PANTHEON
enum class EGOD_PANTHEON : uint8_t
{
	PANTHEON_None                  = 0,
	PANTHEON_Egyptian              = 1,
	PANTHEON_Norse                 = 2,
	PANTHEON_Greek                 = 3,
	PANTHEON_Roman                 = 4,
	PANTHEON_Chinese               = 5,
	PANTHEON_Mayan                 = 6,
	PANTHEON_Hindu                 = 7,
	PANTHEON_Japanese              = 8,
	PANTHEON_Celtic                = 9,
	PANTHEON_Slavic                = 10,
	PANTHEON_Voodoo                = 11,
	PANTHEON_Polynesian            = 12,
	PANTHEON_Arthurian             = 13,
	PANTHEON_Yoruba                = 14,
	PANTHEON_GreatOldOnes          = 15,
	PANTHEON_MAX                   = 16
};


// Enum TgGame.TgObject.HitReactionMoveType
enum class EHitReactionMoveType : uint8_t
{
	HIT_MOVE_TYPE_ALL              = 0,
	HIT_MOVE_TYPE_IDLE             = 1,
	HIT_MOVE_TYPE_MOVING           = 2,
	HIT_MOVE_TYPE_MAX              = 3
};


// Enum TgGame.TgObject.RecoilHitDir
enum class ERecoilHitDir : uint8_t
{
	RECOIL_DIR_FromFront           = 0,
	RECOIL_DIR_FromBack            = 1,
	RECOIL_DIR_FromLeft            = 2,
	RECOIL_DIR_FromRight           = 3,
	RECOIL_DIR_MAX                 = 4
};


// Enum TgGame.TgObject.PING_TYPE
enum class EPING_TYPE : uint8_t
{
	PT_NORMAL                      = 0,
	PT_NORMAL_ENEMY                = 1,
	PT_RETREAT                     = 2,
	PT_RETREAT_ENEMY               = 3,
	PT_ALERT                       = 4,
	PT_ALERT_ENEMY                 = 5,
	PT_SENTINEL                    = 6,
	PT_SENTINEL_ENEMY              = 7,
	PT_ALERT_SILENT                = 8,
	PT_WAYPOINT                    = 9,
	PT_MAX                         = 10
};


// Enum TgGame.TgObject.EDeviceFailType
enum class EDeviceFailType : uint8_t
{
	DFT_None                       = 0,
	DFT_Unspecified                = 1,
	DFT_Custom                     = 2,
	DFT_NotEnoughPower             = 3,
	DFT_OnCooldown                 = 4,
	DFT_CannotPlace                = 5,
	DFT_Stunned                    = 6,
	DFT_Silenced                   = 7,
	DFT_Disarmed                   = 8,
	DFT_Crippled                   = 9,
	DFT_FireLockout                = 10,
	DFT_MAX                        = 11
};


// Enum TgGame.TgObject.TG_EQUIP_POINT
enum class ETG_EQUIP_POINT : uint8_t
{
	EQP_NONE                       = 0,
	EQP_AUTO                       = 1,
	EQP_OFFHAND                    = 2,
	EQP_OFFHAND01                  = 3,
	EQP_OFFHAND02                  = 4,
	EQP_OFFHAND03                  = 5,
	EQP_RECALL                     = 6,
	EQP_PASSIVE                    = 7,
	EQP_ACTIVE                     = 8,
	EQP_ACTIVE01                   = 9,
	EQP_ACTIVE02                   = 10,
	EQP_CONSUMABLE                 = 11,
	EQP_CONSUMABLE01               = 12,
	EQP_UNUSED                     = 13,
	EQP_UNUSED01                   = 14,
	EQP_UNUSED02                   = 15,
	EQP_UNUSED03                   = 16,
	EQP_UNUSED04                   = 17,
	EQP_UNUSED05                   = 18,
	EQP_ITEM_STORE                 = 19,
	EQP_ITEM_STORE01               = 20,
	EQP_ITEM_STORE02               = 21,
	EQP_ITEM_STORE03               = 22,
	EQP_ITEM_STORE04               = 23,
	EQP_ITEM_STORE05               = 24,
	EQP_ALT_AUTO                   = 25,
	EQP_ALT_OFFHAND                = 26,
	EQP_ALT_OFFHAND01              = 27,
	EQP_ALT_OFFHAND02              = 28,
	EQP_ALT_OFFHAND03              = 29,
	EQP_ALT_PASSIVE                = 30,
	EQP_MAX                        = 31
};


// Enum TgGame.TgObject.eTutorialForceableElements
enum class EeTutorialForceableElements : uint8_t
{
	ETBUI_Skills                   = 0,
	ETBUI_ItemShop                 = 1,
	ETBUI_ItemShopButton           = 2,
	ETBUI_Intro                    = 3,
	ETBUI_ItemShopWalkthrough      = 4,
	ETBUI_ActiveItems              = 5,
	ETBUI_ConsumableItems          = 6,
	ETBUI_Escape                   = 7,
	ETBUI_MAX                      = 8
};


// Enum TgGame.TgObject.TgSupportedAspectRatios
enum class ETgSupportedAspectRatios : uint8_t
{
	TgAR_4x3                       = 0,
	TgAR_5x4                       = 1,
	TgAR_16x9                      = 2,
	TgAR_16x10                     = 3,
	TgAR_Other                     = 4,
	TgAR_MAX                       = 5
};


// Enum TgGame.TgObject.ENPCVoices
enum class ENPCVoices : uint8_t
{
	NPCVOICE_VendorMale01          = 0,
	NPCVOICE_VendorMale02          = 1,
	NPCVOICE_VendorMale03          = 2,
	NPCVOICE_VendorMale04          = 3,
	NPCVOICE_VendorMale05          = 4,
	NPCVOICE_VendorMale06          = 5,
	NPCVOICE_VendorMale07          = 6,
	NPCVOICE_VendorMale08          = 7,
	NPCVOICE_VendorMale09          = 8,
	NPCVOICE_VendorMale10          = 9,
	NPCVOICE_VendorFemale01        = 10,
	NPCVOICE_VendorFemale02        = 11,
	NPCVOICE_VendorFemale03        = 12,
	NPCVOICE_VendorFemale04        = 13,
	NPCVOICE_VendorFemale05        = 14,
	NPCVOICE_VendorFemale06        = 15,
	NPCVOICE_VendorFemale07        = 16,
	NPCVOICE_VendorFemale08        = 17,
	NPCVOICE_VendorFemale09        = 18,
	NPCVOICE_VendorFemale10        = 19,
	NPCVOICE_MAX                   = 20
};


// Enum TgGame.TgObject.OverlayType
enum class EOverlayType : uint8_t
{
	OT_UNKNOWN                     = 0,
	OT_LOCALPLAYER                 = 1,
	OT_PLAYER                      = 2,
	OT_TOWER                       = 3,
	OT_MINION                      = 4,
	OT_DEPLOYABLE                  = 5,
	OT_BUFFMONSTER                 = 6,
	OT_NEITH_TARGETLOCK            = 7,
	OT_NEITH_TARGETLOCK_WEAVE      = 8,
	OT_NEITH_CHARGE                = 9,
	OT_NEZHA_ULTQTE                = 10,
	OT_ISIS_CIRCLEOFPROTECTION     = 11,
	OT_ATHENA_TARGETLOCK           = 12,
	OT_WAYPOINT                    = 13,
	OT_OBJECTIVEMINION             = 14,
	OT_RETICLE                     = 15,
	OT_RETICLE_O                   = 16,
	OT_RETICLELOCK                 = 17,
	OT_RETICLELOCK_QUAD            = 18,
	OT_KUMBHAKARNA_SLEEP           = 19,
	OT_SIEGE_MINION                = 20,
	OT_KALDR_PET                   = 21,
	OT_NEUTRAL_BOSS                = 22,
	OT_FLAG                        = 23,
	OT_FLAG_BASE                   = 24,
	OT_RACER                       = 25,
	OT_ADV_TAG                     = 26,
	OT_PERSEPHONE_ULTVINES         = 27,
	OT_GENERIC_PIP                 = 28,
	OT_MAX                         = 29
};


// Enum TgGame.TgObject.ESplineCartActionPoint
enum class ESplineCartActionPoint : uint8_t
{
	SCAP_None                      = 0,
	SCAP_PayloadBegin              = 1,
	SCAP_Checkpoint1               = 2,
	SCAP_Checkpoint2               = 3,
	SCAP_Goal                      = 4,
	SCAP_MAX                       = 5
};


// Enum TgGame.TgObject.OverlayLineCheckState
enum class EOverlayLineCheckState : uint8_t
{
	OLCS_Disallowed                = 0,
	OLCS_Allowed                   = 1,
	OLCS_DidLineCheck              = 2,
	OLCS_MAX                       = 3
};


// Enum TgGame.TgObject.OverlayOffscreenIndicator
enum class EOverlayOffscreenIndicator : uint8_t
{
	OOI_None                       = 0,
	OOI_Left                       = 1,
	OOI_Right                      = 2,
	OOI_MAX                        = 3
};


// Enum TgGame.TgObject.CourierPetPhase
enum class ECourierPetPhase : uint8_t
{
	CPP_WaitAtSpawn                = 0,
	CPP_FollowOwner                = 1,
	CPP_StoreGo                    = 2,
	CPP_StoreDropOff               = 3,
	CPP_MAX                        = 4
};


// Enum TgGame.TgObject.MinimapFactoryType
enum class EMinimapFactoryType : uint8_t
{
	MMF_None                       = 0,
	MMF_FireGiant                  = 1,
	MMF_Kraken                     = 2,
	MMF_Speed                      = 3,
	MMF_Damage                     = 4,
	MMF_Protection                 = 5,
	MMF_Mana                       = 6,
	MMF_Cooldown                   = 7,
	MMF_HealthRegen                = 8,
	MMF_BonusMinions               = 9,
	MMF_Tower                      = 10,
	MMF_Phoenix                    = 11,
	MMF_CapturePoint               = 12,
	MMF_MinorSpawn                 = 13,
	MMF_GoldFury                   = 14,
	MMF_SiegeSpawner               = 15,
	MMF_AttackSpeed                = 16,
	MMF_PortalDemon                = 17,
	MMF_VoidBuff                   = 18,
	MMF_Oracle                     = 19,
	MMF_CH08Objective              = 20,
	MMF_FuryMayan                  = 21,
	MMF_FuryShinto                 = 22,
	MMF_Totem                      = 23,
	MMF_Follower_Mage1             = 24,
	MMF_Follower_DPS1              = 25,
	MMF_Follower_Bruiser1          = 26,
	MMF_Follower_Heal1             = 27,
	MMF_Follower_Tank1             = 28,
	MMF_Lane_AOE1                  = 29,
	MMF_Lane_Tank1                 = 30,
	MMF_Lane_Swarm1                = 31,
	MMF_Follower_Mage2             = 32,
	MMF_Follower_DPS2              = 33,
	MMF_Follower_Bruiser2          = 34,
	MMF_Follower_Heal2             = 35,
	MMF_Follower_Tank2             = 36,
	MMF_Lane_AOE2                  = 37,
	MMF_Lane_Tank2                 = 38,
	MMF_Lane_Swarm2                = 39,
	MMF_Follower_Mage3             = 40,
	MMF_Follower_DPS3              = 41,
	MMF_Follower_Bruiser3          = 42,
	MMF_Follower_Heal3             = 43,
	MMF_Follower_Tank3             = 44,
	MMF_Lane_AOE3                  = 45,
	MMF_Lane_Tank3                 = 46,
	MMF_Lane_Swarm3                = 47,
	MMF_JungleShrineTotem          = 48,
	MMF_Speed_Enhanced             = 49,
	MMF_Mana_Enhanced              = 50,
	MMF_Damage_Enhanced            = 51,
	MMF_Void_Enhanced              = 52,
	MMF_Scorpion                   = 53,
	MMF_Scorpion_Large             = 54,
	MMF_MAX                        = 55
};


// Enum TgGame.TgObject.AlertType
enum class EAlertType : uint8_t
{
	ATT_Regular                    = 0,
	ATT_Beneficial                 = 1,
	ATT_Detrimental                = 2,
	ATT_Spectator                  = 3,
	ATT_Important                  = 4,
	ATT_MainNotify                 = 5,
	ATT_SubNotify                  = 6,
	ATT_MAX                        = 7
};


// Enum TgGame.TgObject.AlertPriority
enum class EAlertPriority : uint8_t
{
	APT_Minimal                    = 0,
	APT_Normal                     = 1,
	APT_High                       = 2,
	APT_Critical                   = 3,
	APT_MAX                        = 4
};


// Enum TgGame.TgObject.ETargetingHighlightStyle
enum class ETargetingHighlightStyle : uint8_t
{
	THS_None                       = 0,
	THS_Silhouette                 = 1,
	THS_HighlightAndBracketWorld   = 2,
	THS_MAX                        = 3
};


// Enum TgGame.TgObject.ETargetingReticleStyle
enum class ETargetingReticleStyle : uint8_t
{
	TRS_None                       = 0,
	TRS_X                          = 1,
	TRS_O                          = 2,
	TRS_MAX                        = 3
};


// Enum TgGame.TgObject.ETargetingPreviewStyle
enum class ETargetingPreviewStyle : uint8_t
{
	TPS_None                       = 0,
	TPS_Target                     = 1,
	TPS_ContrastTarget             = 2,
	TPS_3DArrow                    = 3,
	TPS_MAX                        = 4
};


// Enum TgGame.TgObject.ETargetingLineStyle
enum class ETargetingLineStyle : uint8_t
{
	TLS_None                       = 0,
	TLS_Ruler                      = 1,
	TLS_Line                       = 2,
	TLS_MAX                        = 3
};


// Enum TgGame.TgObject.CH08_GOO_SPOT_TYPES
enum class ECH08_GOO_SPOT_TYPES : uint8_t
{
	CH08GST_LEVEL1                 = 0,
	CH08GST_LEVEL2                 = 1,
	CH08GST_MAX                    = 2
};


// Enum TgGame.TgObject.MiniMapEntityType
enum class EMiniMapEntityType : uint8_t
{
	MMap_LocalSpectator            = 0,
	MMap_LocalPlayer               = 1,
	MMap_Player                    = 2,
	MMap_Bot                       = 3,
	MMap_Factory                   = 4,
	MMap_Deployable                = 5,
	MMap_CapturePoint              = 6,
	MMap_LocalWard                 = 7,
	MMap_CTF_Flag                  = 8,
	MMap_FactoryVisible            = 9,
	MMap_DeviceVolume              = 10,
	MMap_MAX                       = 11
};


// Enum TgGame.TgObject.TgMapTeam
enum class ETgMapTeam : uint8_t
{
	MAPTEAM                        = 0,
	MAPTEAM01                      = 1,
	MAPTEAM02                      = 2,
	MAPTEAM03                      = 3,
	MAPTEAM04                      = 4,
	MAPTEAM_NEUTRAL                = 5,
	MAPTEAM_MAX                    = 6
};


// Enum TgGame.TgObject.PLAYER_COMBAT_EVENT_TYPE
enum class EPLAYER_COMBAT_EVENT_TYPE : uint8_t
{
	PCET_None                      = 0,
	PCET_Spawn                     = 1,
	PCET_MAX                       = 2
};


// Enum TgGame.TgObject.ITEM_EVENT_TYPE
enum class EITEM_EVENT_TYPE : uint8_t
{
	IET_None                       = 0,
	IET_CastStart                  = 1,
	IET_CastComplete               = 2,
	IET_CastInterrupt              = 3,
	IET_ItemPurchase               = 4,
	IET_ItemSell                   = 5,
	IET_AbilityPurchase            = 6,
	IET_MAX                        = 7
};


// Enum TgGame.TgObject.DAMAGE_INFO_TYPE
enum class EDAMAGE_INFO_TYPE : uint8_t
{
	DIT_None                       = 0,
	DIT_Death                      = 1,
	DIT_Damage                     = 2,
	DIT_Status                     = 3,
	DIT_Healing                    = 4,
	DIT_ManaBurn                   = 5,
	DIT_ManaRestore                = 6,
	DIT_Objective                  = 7,
	DIT_Experience                 = 8,
	DIT_Currency                   = 9,
	DIT_Level                      = 10,
	DIT_CritDamage                 = 11,
	DIT_Backstab                   = 12,
	DIT_KillingBlow                = 13,
	DIT_Assist                     = 14,
	DIT_KillingBlowWrath           = 15,
	DIT_Ticket                     = 16,
	DIT_SelfExecute                = 17,
	DIT_HolyCrit                   = 18,
	DIT_MAX                        = 19
};


// Enum TgGame.TgObject.DeviceTargetMode
enum class EDeviceTargetMode : uint8_t
{
	TGDTM_Self                     = 0,
	TGDTM_Melee                    = 1,
	TGDTM_Reticle                  = 2,
	TGDTM_Projectile               = 3,
	TGDTM_AOE                      = 4,
	TGDTM_Deploy                   = 5,
	TGDTM_Ground                   = 6,
	TGDTM_Cone                     = 7,
	TGDTM_Linear                   = 8,
	TGDTM_LockOn                   = 9,
	TGDTM_SpawnPoint               = 10,
	TGDTM_WorldMap                 = 11,
	TGDTM_WorldMapLockOn           = 12,
	TGDTM_PawnSelect               = 13,
	TGDTM_MAX                      = 14
};


// Enum TgGame.TgObject.GameTimerState
enum class EGameTimerState : uint8_t
{
	TGMTS_UNSET                    = 0,
	TGMTS_WAITING_FOR_PLAYERS      = 1,
	TGMTS_SETUP                    = 2,
	TGMTS_MISSION_RUNNING          = 3,
	TGMTS_MISSION_OVERTIME         = 4,
	TGMTS_MISSION_COMPLETE         = 5,
	TGMTS_MISSION_PAUSED           = 6,
	TGMTS_CUSTOM                   = 7,
	TGMTS_ROUND_COMPLETE           = 8,
	TGMTS_MISSION_PRE_OVERTIME     = 9,
	TGMTS_MISSION_OVERTIME_SETUP   = 10,
	TGMTS_MAX                      = 11
};


// Enum TgGame.TgObject.TG_GAME_SEASONAL
enum class ETG_GAME_SEASONAL : uint8_t
{
	TGSN_NONE                      = 0,
	TGSN_HALLOWEEN                 = 1,
	TGSN_WINTER                    = 2,
	TGSN_MAX                       = 3
};


// Enum TgGame.TgObject.TG_GAME_TYPE
enum class ETG_GAME_TYPE : uint8_t
{
	TGT_UNSET                      = 0,
	TGT_CITY                       = 1,
	TGT_ARENA                      = 2,
	TGT_ARENA_TRAINING             = 3,
	TGT_ARENA_PRACTICE             = 4,
	TGT_ARENA_CAPTURE              = 5,
	TGT_ARENA_ESCORT               = 6,
	TGT_ARENA_ESCORT_PRACTICE      = 7,
	TGT_BATTLE                     = 8,
	TGT_BATTLE_EXPERT              = 9,
	TGT_BATTLE_PRACTICE            = 10,
	TGT_BATTLE_JOUST               = 11,
	TGT_BATTLE_CASUAL              = 12,
	TGT_BATTLE_TRAINING            = 13,
	TGT_BATTLE_CONQUEST_TRAINING   = 14,
	TGT_BATTLE_ARAM                = 15,
	TGT_BATTLE_ARAM_PRACTICE       = 16,
	TGT_POINTCAPTURE               = 17,
	TGT_DOMINATION                 = 18,
	TGT_SINGLEPOINTCAPTUREANDHOLD  = 19,
	TGT_IDOL                       = 20,
	TGT_SIEGE                      = 21,
	TGT_BATTLE_TC                  = 22,
	TGT_BATTLE_SHOOTINGRANGE       = 23,
	TGT_BATTLE_JOUST_PRACTICE      = 24,
	TGT_BATTLE_CLASH               = 25,
	TGT_BATTLE_CLASH_PRACTICE      = 26,
	TGT_BATTLE_CLASH_TRAINING      = 27,
	TGT_BATTLE_ENCOUNTER           = 28,
	TGT_CHALLENGE_CTF              = 29,
	TGT_CHALLENGE_RACER            = 30,
	TGT_CHALLENGE_ADVENTURE        = 31,
	TGT_CHALLENGE_ADVENTURE_STORY  = 32,
	TGT_ARENA_ESCORT_SD            = 33,
	TGT_BATTLE_ROUND               = 34,
	TGT_BATTLE_MULTIROUND          = 35,
	TGT_BATTLE_PEP                 = 36,
	TGT_BATTLE_JOUST_DUEL          = 37,
	TGT_MAX                        = 38
};


// Enum TgGame.TgObject.GAME_WIN_STATE
enum class EGAME_WIN_STATE : uint8_t
{
	GWS_NONE                       = 0,
	GWS_TASKFORCE_TWO_WON          = 1,
	GWS_TASKFORCE_ONE_WON          = 2,
	GWS_TIE                        = 3,
	GWS_SD_TF_TWO_WON              = 4,
	GWS_SD_TF_ONE_WON              = 5,
	GWS_SD_TIE                     = 6,
	GWS_MAX                        = 7
};


// Enum TgGame.TgActorFactory.eSelectionMethod
enum class EeSelectionMethod : uint8_t
{
	TGSM_RANDOM                    = 0,
	TGSM_SEQUENTIAL                = 1,
	TGSM_MAX                       = 2
};


// Enum TgGame.TgAIBehaviorNode.EBehaviorStatus
enum class EBehaviorStatus : uint8_t
{
	BEHAVIOR_None                  = 0,
	BEHAVIOR_Complete              = 1,
	BEHAVIOR_Running               = 2,
	BEHAVIOR_Paused                = 3,
	BEHAVIOR_Failed                = 4,
	BEHAVIOR_Aborted               = 5,
	BEHAVIOR_MAX                   = 6
};


// Enum TgGame.TgAIBehaviorNode.EBehaviorComparison
enum class EBehaviorComparison : uint8_t
{
	BEHAVIORCOMPARE_Equal          = 0,
	BEHAVIORCOMPARE_NotEqual       = 1,
	BEHAVIORCOMPARE_LessThan       = 2,
	BEHAVIORCOMPARE_LessThanOrEqual = 3,
	BEHAVIORCOMPARE_GreaterThan    = 4,
	BEHAVIORCOMPARE_GreaterThanOrEqual = 5,
	BEHAVIORCOMPARE_MAX            = 6
};


// Enum TgGame.TgAIController_Behavior.EUseDeviceAimType
enum class EUseDeviceAimType : uint8_t
{
	AIDeviceAim_CombatTarget       = 0,
	AIDeviceAim_Self               = 1,
	AIDeviceAim_MAX                = 2
};


// Enum TgGame.TgAIController_Behavior.EEffectGroupCategory
enum class EEffectGroupCategory : uint8_t
{
	AIEffectCategory_None          = 0,
	AIEffectCategory_Slow          = 1,
	AIEffectCategory_Stun          = 2,
	AIEffectCategory_Mesmerize     = 3,
	AIEffectCategory_Knockback     = 4,
	AIEffectCategory_Root          = 5,
	AIEffectCategory_Silence       = 6,
	AIEffectCategory_Disarm        = 7,
	AIEffectCategory_Cripple       = 8,
	AIEffectCategory_FearOrPanic   = 9,
	AIEffectCategory_Taunt         = 10,
	AIEffectCategory_Charm         = 11,
	AIEffectCategory_Madness       = 12,
	AIEffectCategory_JungleBuff    = 13,
	AIEffectCategory_MAX           = 14
};


// Enum TgGame.TgAIController_Behavior.EBotDifficultyLevel
enum class EBotDifficultyLevel : uint8_t
{
	AIDifficulty_Practice          = 0,
	AIDifficulty_Easy              = 1,
	AIDifficulty_Medium            = 2,
	AIDifficulty_Hard              = 3,
	AIDifficulty_Pro               = 4,
	AIDifficulty_MAX               = 5
};


// Enum TgGame.TgAIController_Behavior.EActiveType
enum class EActiveType : uint8_t
{
	AIActive_Meditation            = 0,
	AIActive_Shell                 = 1,
	AIActive_Wings                 = 2,
	AIActive_Aegis                 = 3,
	AIActive_Beads                 = 4,
	AIActive_Ankh                  = 5,
	AIActive_Blink                 = 6,
	AIActive_Thorns                = 7,
	AIActive_Spear                 = 8,
	AIActive_Veil                  = 9,
	AIActive_Bracer                = 10,
	AIActive_Horrific              = 11,
	AIActive_Frenzy                = 12,
	AIActive_MAX                   = 13
};


// Enum TgGame.TgAIController_Behavior.EConsumableType
enum class EConsumableType : uint8_t
{
	AIConsumable_HealthPotion      = 0,
	AIConsumable_ManaPotion        = 1,
	AIConsumable_MultiPotion       = 2,
	AIConsumable_HealthChalice     = 3,
	AIConsumable_ManaChalice       = 4,
	AIConsumable_BaronBrew         = 5,
	AIConsumable_Ward              = 6,
	AIConsumable_PhysicalPotion    = 7,
	AIConsumable_MagicalPotion     = 8,
	AIConsumable_SpeedElixer       = 9,
	AIConsumable_DefenseElixer     = 10,
	AIConsumable_PowerElixer       = 11,
	AIConsumable_MAX               = 12
};


// Enum TgGame.TgAIController_Behavior.ERoleType
enum class ERoleType : uint8_t
{
	AIRoleType_Hunter              = 0,
	AIRoleType_Guardian            = 1,
	AIRoleType_Mage                = 2,
	AIRoleType_Assassin            = 3,
	AIRoleType_Warrior             = 4,
	AIRoleType_MAX                 = 5
};


// Enum TgGame.TgAIController_Behavior.EJungleTargetType
enum class EJungleTargetType : uint8_t
{
	AIJungleTarget_Attack          = 0,
	AIJungleTarget_Mana            = 1,
	AIJungleTarget_Speed           = 2,
	AIJungleTarget_BackHarpies     = 3,
	AIJungleTarget_MidHarpies      = 4,
	AIJungleTarget_Boars           = 5,
	AIJungleTarget_FireElementals  = 6,
	AIJungleTarget_FireGiant       = 7,
	AIJungleTarget_GoldFury        = 8,
	AIJungleTarget_Nearest         = 9,
	AIJungleTarget_AttackSpeed     = 10,
	AIJungleTarget_Totem           = 11,
	AIJungleTarget_MAX             = 12
};


// Enum TgGame.TgAIController_Behavior.ECombatTargetType
enum class ECombatTargetType : uint8_t
{
	AICombatTarget_Any             = 0,
	AICombatTarget_God             = 1,
	AICombatTarget_Guardian        = 2,
	AICombatTarget_Minion          = 3,
	AICombatTarget_EliteMinion     = 4,
	AICombatTarget_Tower           = 5,
	AICombatTarget_JungleCamp      = 6,
	AICombatTarget_Pet             = 7,
	AICombatTarget_Decoy           = 8,
	AICombatTarget_Deployable      = 9,
	AICombatTarget_GodBot          = 10,
	AICombatTarget_GodHuman        = 11,
	AICombatTarget_MAX             = 12
};


// Enum TgGame.TgPawn.EEmoteFail
enum class EEmoteFail : uint8_t
{
	EMOTEFAIL_None                 = 0,
	EMOTEFAIL_DoNotOwn             = 1,
	EMOTEFAIL_NoPawn               = 2,
	EMOTEFAIL_Cooldown             = 3,
	EMOTEFAIL_InCombat             = 4,
	EMOTEFAIL_MAX                  = 5
};


// Enum TgGame.TgPawn.EEmote
enum class EEmote : uint8_t
{
	EMOTE_None                     = 0,
	EMOTE_Taunt                    = 1,
	EMOTE_Joke                     = 2,
	EMOTE_Laugh                    = 3,
	EMOTE_Health_Low               = 4,
	EMOTE_Kill_Jungle_Boss         = 5,
	EMOTE_Kill_Phoenix             = 6,
	EMOTE_Kill_Streak              = 7,
	EMOTE_Kill_Tower               = 8,
	EMOTE_Purchase_Consumable      = 9,
	EMOTE_Purchase_Defense         = 10,
	EMOTE_Purchase_Power           = 11,
	EMOTE_Purchase_Utility         = 12,
	EMOTE_Ward_Placed              = 13,
	EMOTE_Kill_God                 = 14,
	EMOTE_Wave                     = 15,
	EMOTE_Dance                    = 16,
	EMOTE_Clap                     = 17,
	EMOTE_God_Special              = 18,
	EMOTE_Furious                  = 19,
	EMOTE_OdySpecial01             = 20,
	EMOTE_GlobalEmote              = 21,
	EMOTE_OwnerAuto                = 22,
	EMOTE_OwnerDev1                = 23,
	EMOTE_OwnerDev2                = 24,
	EMOTE_OwnerDev3                = 25,
	EMOTE_OwnerDev4                = 26,
	EMOTE_OwnerRecall              = 27,
	EMOTE_PetSelfRecall            = 28,
	EMOTE_Generic1                 = 29,
	EMOTE_Generic2                 = 30,
	EMOTE_Generic3                 = 31,
	EMOTE_MAX                      = 32
};


// Enum TgGame.TgPawn.ETweenState
enum class ETweenState : uint8_t
{
	TWEEN_None                     = 0,
	TWEEN_Default                  = 1,
	TWEEN_DefaultImmune            = 2,
	TWEEN_ActiveCollision          = 3,
	TWEEN_ActiveCollision_CollidesWorld = 4,
	TWEEN_BastetPounce             = 5,
	TWEEN_HadesDeathFromBelow      = 6,
	TWEEN_OdinLeap                 = 7,
	TWEEN_HeboWave                 = 8,
	TWEEN_MonkeyLeap               = 9,
	TWEEN_CuChulainnLeap           = 10,
	TWEEN_ArachnePull              = 11,
	TWEEN_ArachneAttach            = 12,
	TWEEN_AnhurDisarm              = 13,
	TWEEN_AnhurImpale              = 14,
	TWEEN_BakasuraTakedown         = 15,
	TWEEN_ThorLeap                 = 16,
	TWEEN_Levitate                 = 17,
	TWEEN_LevitateUnbreakable      = 18,
	TWEEN_Sink                     = 19,
	TWEEN_BacchusBellyFlop         = 20,
	TWEEN_HerculesPunch            = 21,
	TWEEN_HerculesBatterUp         = 22,
	TWEEN_NeithFlipOut             = 23,
	TWEEN_NeithFlipOutPlusKick     = 24,
	TWEEN_MinionKnockbackMelee     = 25,
	TWEEN_MinionKnockbackRanged    = 26,
	TWEEN_AphroditeGetAway         = 27,
	TWEEN_ApolloDive               = 28,
	TWEEN_NeZhaSash                = 29,
	TWEEN_NeZhaWindFire            = 30,
	TWEEN_NeZhaWindFire_SelfKnockDown = 31,
	TWEEN_FenrirMaul               = 32,
	TWEEN_FenrirDoubleJump         = 33,
	TWEEN_AthenaUlt                = 34,
	TWEEN_AthenaShieldWall         = 35,
	TWEEN_ChronosRewind            = 36,
	TWEEN_TyrComboStrike           = 37,
	TWEEN_TyrPush                  = 38,
	TWEEN_TyrUltLeap               = 39,
	TWEEN_ThanatosStrike           = 40,
	TWEEN_SunWukongToCloud         = 41,
	TWEEN_SunWukongAttack          = 42,
	TWEEN_SunWukongCancel          = 43,
	TWEEN_ChaacNum2                = 44,
	TWEEN_ChaacUlt                 = 45,
	TWEEN_KaliStrike               = 46,
	TWEEN_ScyllaNum3               = 47,
	TWEEN_ScyllaTentacle           = 48,
	TWEEN_UllrNum3                 = 49,
	TWEEN_AresTether               = 50,
	TWEEN_KumbhakarnaNum1          = 51,
	TWEEN_KumbhakarnaNum4TimedKnockup = 52,
	TWEEN_TimedKnockup             = 53,
	TWEEN_AutoPortal               = 54,
	TWEEN_ArtemisBoar              = 55,
	TWEEN_FloorPortal              = 56,
	TWEEN_FloorPortal_Friendly     = 57,
	TWEEN_SerqetLastBreathLeap     = 58,
	TWEEN_SerqetLastBreathKnockback = 59,
	TWEEN_CabrakanChargeKnockback  = 60,
	TWEEN_CabrakanUlt              = 61,
	TWEEN_ArachneCreepy            = 62,
	TWEEN_AoKuangUltimate          = 63,
	TWEEN_AoKuangUltimatePart3     = 64,
	TWEEN_AoKuangUltimateMegaKill  = 65,
	TWEEN_AwilixMoonlightPull      = 66,
	TWEEN_AwilixReposition         = 67,
	TWEEN_HouYi_DiveBomb           = 68,
	TWEEN_Osiris_UltLeap           = 69,
	TWEEN_RatatoskrTailSpin        = 70,
	TWEEN_RatatoskrUltimate        = 71,
	TWEEN_RavanaUltimate           = 72,
	TWEEN_ToTarget                 = 73,
	TWEEN_God95ToTarget            = 74,
	TWEEN_SolLeapBack              = 75,
	TWEEN_SolReappear              = 76,
	TWEEN_XingTianLeap             = 77,
	TWEEN_CircleTarget             = 78,
	TWEEN_Kaldr_Lunge              = 79,
	TWEEN_JingWei_AirDash          = 80,
	TWEEN_JingWei_Land             = 81,
	TWEEN_Fafnir_Leap              = 82,
	TWEEN_ErlangShen_Impale        = 83,
	TWEEN_Camazotz_ToothAndNailLeap = 84,
	TWEEN_Camazotz_Dev4            = 85,
	TWEEN_Nike_Dev3                = 86,
	TWEEN_Kismet                   = 87,
	TWEEN_Discordia_ErraticBehavior = 88,
	TWEEN_MOB_GenericLeap          = 89,
	TWEEN_Cerberus_Dev3            = 90,
	TWEEN_ToSocket                 = 91,
	TWEEN_BaronSamediUlt           = 92,
	TWEEN_BaronSamedi_Dev4_Eject   = 93,
	TWEEN_Pele_A03                 = 94,
	TWEEN_Knockback                = 95,
	TWEEN_Knockback_WithCollision  = 96,
	TWEEN_JormUlt                  = 97,
	TWEEN_HorusToTarget            = 98,
	TWEEN_HorusDescent             = 99,
	TWEEN_Set_A03                  = 100,
	TWEEN_Persephone_A03           = 101,
	TWEEN_Yemoja_A03               = 102,
	TWEEN_Heimdallr_A03_Portal     = 103,
	TWEEN_Heimdallr_A04_Intro      = 104,
	TWEEN_Heimdallr_A04            = 105,
	TWEEN_Heimdallr_A04_Delay      = 106,
	TWEEN_Heimdallr_A04_Outro      = 107,
	TWEEN_Mulan_GrapplePull        = 108,
	TWEEN_Mulan_GrappleLeap        = 109,
	TWEEN_Mulan_GrappleWall        = 110,
	TWEEN_BabaYaga_A03             = 111,
	TWEEN_Tsukuyomi_A04            = 112,
	TWEEN_Janus_A04_Portal         = 113,
	TWEEN_MAX                      = 114
};


// Enum TgGame.TgPawn.TG_DEATH_REASON
enum class ETG_DEATH_REASON : uint8_t
{
	DR_NORMAL                      = 0,
	DR_DESPAWN                     = 1,
	DR_DESPAWN_HIDDEN              = 2,
	DR_RECONNECT                   = 3,
	DR_BAKASURA_CONSUME            = 4,
	DR_AOKUANG_ULT                 = 5,
	DR_MEDUSA_STATUE               = 6,
	DR_MAX                         = 7
};


// Enum TgGame.TgPawn.EChargeState
enum class EChargeState : uint8_t
{
	CHARGE_None                    = 0,
	CHARGE_NoTurn                  = 1,
	CHARGE_NoTurnBackwards         = 2,
	CHARGE_Turn                    = 3,
	CHARGE_MercuryUlt              = 4,
	CHARGE_TurnToDesiredRotation   = 5,
	CHARGE_Slide                   = 6,
	CHARGE_TurnIndependant         = 7,
	CHARGE_TurnNoRate              = 8,
	CHARGE_Shove                   = 9,
	CHARGE_LockOn                  = 10,
	CHARGE_FlyingTurn              = 11,
	CHARGE_MAX                     = 12
};


// Enum TgGame.TgPawn.EGrabState
enum class EGrabState : uint8_t
{
	GRAB_None                      = 0,
	GRAB_ArachneLifeDrain          = 1,
	GRAB_FenrirBite                = 2,
	GRAB_LokiAssassinate           = 3,
	GRAB_AthenaUlt                 = 4,
	GRAB_TyrNum1                   = 5,
	GRAB_MercuryDelivery           = 6,
	GRAB_KumbhakarnaToss           = 7,
	GRAB_SerqetLastBreath          = 8,
	GRAB_KhepriAbduct              = 9,
	GRAB_KhepriRevive              = 10,
	GRAB_NoxShadowStep             = 11,
	GRAB_XingTianSweep             = 12,
	GRAB_ErlangShenImpale          = 13,
	GRAB_TerraMegaPunch            = 14,
	GRAB_G84Clone                  = 15,
	GRAB_KuzenboSumoPush           = 16,
	GRAB_BaronSamediUlt            = 17,
	GRAB_KnightDev2B               = 18,
	GRAB_MAX                       = 19
};


// Enum TgGame.TgPawn.STEALTH_TYPE
enum class ESTEALTH_TYPE : uint8_t
{
	STEALTH_TYPE_NONE              = 0,
	STEALTH_TYPE_INSTANT           = 1,
	STEALTH_TYPE_FADING            = 2,
	STEALTH_TYPE_MAX               = 3
};


// Enum TgGame.TgPawn.ELevitateType
enum class ELevitateType : uint8_t
{
	LEVITATE_None                  = 0,
	LEVITATE_Freya                 = 1,
	LEVITATE_NeZha                 = 2,
	LEVITATE_AwilixMoonlight       = 3,
	LEVITATE_JingWeiSelf           = 4,
	LEVITATE_JingWeiEnemy          = 5,
	LEVITATE_Terra                 = 6,
	LEVITATE_MAX                   = 7
};


// Enum TgGame.TgPawn.TG_POSTURE
enum class ETG_POSTURE : uint8_t
{
	TG_POSTURE_DEFAULT             = 0,
	TG_POSTURE_REST                = 1,
	TG_POSTURE_FUSSY               = 2,
	TG_POSTURE_ENRAGED             = 3,
	TG_POSTURE_GENERICFIRE1        = 4,
	TG_POSTURE_GENERICFIRE2        = 5,
	TG_POSTURE_GENERICFIRE3        = 6,
	TG_POSTURE_SCARED              = 7,
	TG_POSTURE_STUNNED             = 8,
	TG_POSTURE_STASIS              = 9,
	TG_POSTURE_KNOCKBACK           = 10,
	TG_POSTURE_MESMERIZE           = 11,
	TG_POSTURE_INTRO               = 12,
	TG_POSTURE_PATROL              = 13,
	TG_POSTURE_DEAD                = 14,
	TG_POSTURE_SEARCHING           = 15,
	TG_POSTURE_FALLING             = 16,
	TG_POSTURE_NONE                = 17,
	TG_POSTURE_MAX                 = 18
};


// Enum TgGame.TgPawn.OverlayState
enum class EOverlayState : uint8_t
{
	OMS_Normal                     = 0,
	OMS_ForceVisible               = 1,
	OMS_ForceHidden                = 2,
	OMS_MAX                        = 3
};


// Enum TgGame.TgPawn.OverlayMICType
enum class EOverlayMICType : uint8_t
{
	OMT_Outline                    = 0,
	OMT_Fade                       = 1,
	OMT_AthenaUltTarget            = 2,
	OMT_HitPulse                   = 3,
	OMT_ThanatosHarvester          = 4,
	OMT_MAX                        = 5
};


// Enum TgGame.TgPawn.EFloorPortalState
enum class EFloorPortalState : uint8_t
{
	FLOOR_PORTAL_NONE              = 0,
	FLOOR_PORTAL_PRETELEPORT       = 1,
	FLOOR_PORTAL_POSTTELEPORT      = 2,
	FLOOR_PORTAL_MAX               = 3
};


// Enum TgGame.TgPawn.EHitReactionType
enum class EHitReactionType : uint8_t
{
	HIT_REACTION_Anim              = 0,
	HIT_Reaction_Procedural        = 1,
	HIT_MAX                        = 2
};


// Enum TgGame.TgProperty.TG_PAWN_PROPERTIES
enum class ETG_PAWN_PROPERTIES : uint8_t
{
	TGPIDX_ATTACK_SPEED            = 0,
	TGPIDX_CHARACTER_VISION_RANGE  = 1,
	TGPIDX_COOLDOWN_REDUCTION_PERC = 2,
	TGPIDX_CRITICAL_STRIKE         = 3,
	TGPIDX_CRITICAL_STRIKE_DAMAGE  = 4,
	TGPIDX_CRIT_CHANCE_MODIFIER_PERC = 5,
	TGPIDX_DEPLOY_RATE_MODIFIER    = 6,
	TGPIDX_ENERGY_MAX              = 7,
	TGPIDX_ENERGY                  = 8,
	TGPIDX_EP5                     = 9,
	TGPIDX_GOLD_GAIN_PERC          = 10,
	TGPIDX_GOLD_PER_5_PERC         = 11,
	TGPIDX_XP_PER_5_PERC           = 12,
	TGPIDX_GROUND_SPEED            = 13,
	TGPIDX_HEALTH_MAX              = 14,
	TGPIDX_HEALTH_MAX_PERCENT      = 15,
	TGPIDX_HEALTH                  = 16,
	TGPIDX_HP5                     = 17,
	TGPIDX_MANA                    = 18,
	TGPIDX_MANA_MAX                = 19,
	TGPIDX_MANA_MAX_PERCENT        = 20,
	TGPIDX_MP5                     = 21,
	TGPIDX_SHIELD                  = 22,
	TGPIDX_SHIELD_MAX              = 23,
	TGPIDX_PENETRATION_MAGICAL     = 24,
	TGPIDX_PENETRATION_MAGICAL_PERC = 25,
	TGPIDX_PENETRATION_PHYSICAL    = 26,
	TGPIDX_PENETRATION_PHYSICAL_PERC = 27,
	TGPIDX_PHYSICAL_LIFESTEAL      = 28,
	TGPIDX_LIFESTEAL_BLOCK         = 29,
	TGPIDX_LIFESTEAL_REDUCTION     = 30,
	TGPIDX_POWER_MAGICAL_BOT       = 31,
	TGPIDX_POWER_PHYSICAL_BOT      = 32,
	TGPIDX_PROTECTION_FEAR_AND_PANIC = 33,
	TGPIDX_PROTECTION_KNOCKBACK    = 34,
	TGPIDX_PROTECTION_MAGICAL      = 35,
	TGPIDX_PROTECTION_MAGICAL_PERC = 36,
	TGPIDX_PROTECTION_PHYSICAL     = 37,
	TGPIDX_PROTECTION_PHYSICAL_PERC = 38,
	TGPIDX_PROTECTION_ROOT         = 39,
	TGPIDX_PROTECTION_CRIPPLE      = 40,
	TGPIDX_PROTECTION_SILENCE      = 41,
	TGPIDX_PROTECTION_SLOW         = 42,
	TGPIDX_PROTECTION_STUN         = 43,
	TGPIDX_PROTECTION_MESMERIZE    = 44,
	TGPIDX_PROTECTION_PULL         = 45,
	TGPIDX_PROTECTION_ATTACK_SLOW  = 46,
	TGPIDX_PROTECTION_TIDI         = 47,
	TGPIDX_PROTECTION_CC           = 48,
	TGPIDX_PROTECTION_VORTEX       = 49,
	TGPIDX_CC_IMMUNITY             = 50,
	TGPIDX_BASIC_ATTACK_SLOW_IMMUNITY = 51,
	TGPIDX_ABSORB_BASIC_ATTACK     = 52,
	TGPIDX_PUSHBACK                = 53,
	TGPIDX_REDUCTION_MAGICAL       = 54,
	TGPIDX_REDUCTION_MAGICAL_PERC  = 55,
	TGPIDX_REDUCTION_PHYSICAL      = 56,
	TGPIDX_REDUCTION_PHYSICAL_PERC = 57,
	TGPIDX_REVIVE_REDUCTION_PERC   = 58,
	TGPIDX_SILENT_MOVEMENT         = 59,
	TGPIDX_SPELL_VAMP              = 60,
	TGPIDX_TAUNT                   = 61,
	TGPIDX_XP_GAIN_PERC            = 62,
	TGPIDX_POWER_PHYSICAL_PERC     = 63,
	TGPIDX_POWER_MAGICAL_PERC      = 64,
	TGPIDX_HEALING_TAKEN_PERC      = 65,
	TGPIDX_HEALING_DEALT_PERC      = 66,
	TGPIDX_DAMAGE_TAKEN_PERC       = 67,
	TGPIDX_DAMAGE_REDUCTION_FLAT   = 68,
	TGPIDX_DAMAGE_DEALT_PERC       = 69,
	TGPIDX_DAMAGE_DEALT_PERC_BASIC = 70,
	TGPIDX_POWER_PHYSICAL_ITEM     = 71,
	TGPIDX_POWER_MAGICAL_ITEM      = 72,
	TGPIDX_POWER_UTILITY_BOT       = 73,
	TGPIDX_POWER_UTILITY_ITEM      = 74,
	TGPIDX_SLOW_DIMINISHING        = 75,
	TGPIDX_ATTACK_SLOW             = 76,
	TGPIDX_MINIMAP_WARD_VISION_PERC = 77,
	TGPIDX_MINIMAP_LOS_IGNORED     = 78,
	TGPIDX_MINIMAP_DETECTOR        = 79,
	TGPIDX_MINION_DAMAGE_BONUS     = 80,
	TGPIDX_DODGE_BASIC             = 81,
	TGPIDX_NO_BACKPEDAL_PENALTY    = 82,
	TGPIDX_GOLD_PER                = 83,
	TGPIDX_XP_PER                  = 84,
	TGPIDX_HP5_PERC                = 85,
	TGPIDX_BASIC_ATTACK_DAMAGE     = 86,
	TGPIDX_PHYSICAL_IMMUNITY       = 87,
	TGPIDX_MAGICAL_IMMUNITY        = 88,
	TGPIDX_DAMAGE_TAKEN_PERC_PHYS  = 89,
	TGPIDX_DAMAGE_TAKEN_PERC_MAG   = 90,
	TGPIDX_DAMAGE_TAKEN_PERC_CRIT  = 91,
	TGPIDX_DAMAGE_TAKEN_FLAT_CRIT  = 92,
	TGPIDX_DISABLE_CC_IMMUNITY_GLOW = 93,
	TGPIDX_POWER_HEALING_PERC_ITEM = 94,
	TGPIDX_OBJECTIVE_DAMAGE_BONUS  = 95,
	TGPIDX_MANA_COST_MODIFIER      = 96,
	TGPIDX_STRUCTURE_DAMAGE_MODIFIER = 97,
	TGPIDX_COOLDOWN_EXTENSION      = 98,
	TGPIDX_PHYS_ABILITY_LIFESTEAL  = 99,
	TGPIDX_GOLD_BONUS              = 100,
	TGPIDX_GOLD_BONUS_TEAM         = 101,
	TGPIDX_XP_BONUS                = 102,
	TGPIDX_XP_BONUS_TEAM           = 103,
	TGPIDX_TIDI                    = 104,
	TGPIDX_IGNORE_BACKDOOR_PROTECTIONS = 105,
	TGPIDX_EFFECT_FORM_STACKING_THRESHOLD = 106,
	TGPIDX_LOCAL_TIDI              = 107,
	TGPIDX_FORWARD_GROUNDSPEED_PERC = 108,
	TGPIDX_BACKPEDAL_GROUNDSPEED_PERC = 109,
	TGPIDX_STRAFE_GROUNDSPEED_PERC = 110,
	TGPIDX_BASIC_ATTACK_GROUNDSPEED_MELEE_PERC = 111,
	TGPIDX_BASIC_ATTACK_GROUNDSPEED_RANGED_PERC = 112,
	TGPIDX_DAMAGE_TAKEN_PERC_INHAND = 113,
	TGPIDX_MAX                     = 114
};


// Enum TgGame.TgPawn.ECollisionTransitionState
enum class ECollisionTransitionState : uint8_t
{
	COLTRAN_None                   = 0,
	COLTRAN_On                     = 1,
	COLTRAN_Off                    = 2,
	COLTRAN_MAX                    = 3
};


// Enum TgGame.TgSpecialFx.ELightFxState
enum class ELightFxState : uint8_t
{
	LFX_UNMANAGED                  = 0,
	LFX_ACTIVE                     = 1,
	LFX_KILLEDBYMGR                = 2,
	LFX_DYING                      = 3,
	LFX_INACTIVE                   = 4,
	LFX_MAX                        = 5
};


// Enum TgGame.TgPawn.TG_TELEPORT_STATE
enum class ETG_TELEPORT_STATE : uint8_t
{
	TELEPORT_NONE                  = 0,
	TELEPORT_ENTER                 = 1,
	TELEPORT_EXIT                  = 2,
	TELEPORT_ENTER_BLINK           = 3,
	TELEPORT_EXIT_BLINK            = 4,
	TELEPORT_ENTER_THOR_HAMMER     = 5,
	TELEPORT_EXIT_THOR_HAMMER      = 6,
	TELEPORT_ISIS_IDMET_BUILDUP    = 7,
	TELEPORT_ISIS_IDMET_HUMANOID   = 8,
	TELEPORT_LOKI_ASSASSINATE_ENTER = 9,
	TELEPORT_LOKI_ASSASSINATE_EXIT = 10,
	TELEPORT_NEITH_REBOUND_FROM_HUMANOID = 11,
	TELEPORT_NEITH_REBOUND_FROM_BROKENWEAVE = 12,
	TELEPORT_NEITH_UNRAVEL_AOE     = 13,
	TELEPORT_DAMAGE_REDIRECT       = 14,
	TELEPORT_HUNBATZ_ENTER         = 15,
	TELEPORT_HUNBATZ_EXIT          = 16,
	TELEPORT_FREYA_PULSE_AOE       = 17,
	TELEPORT_HEL_REBOUND_RESTORATION = 18,
	TELEPORT_AHMUZENCAB_SWARM_INFECT = 19,
	TELEPORT_AHMUZENCAB_HIVE_HEAL  = 20,
	TELEPORT_NEMESIS_PARRY         = 21,
	TELEPORT_SCYLLA_COBRA_STRIKE   = 22,
	TELEPORT_SCYLLA_COBRA_EXPLOSION = 23,
	TELEPORT_KUMBHAKARNA_BELLYBUCK = 24,
	TELEPORT_KUMBHAKARNA_UPPERCUT  = 25,
	TELEPORT_KUMBHAKARNA_SLEEPTAKEHIT = 26,
	TELEPORT_AUTOPORTAL_ENTER      = 27,
	TELEPORT_AUTOPORTAL_EXIT       = 28,
	TELEPORT_SIEGE_EXIT            = 29,
	TELEPORT_LASTBREATH_EXPLOSION  = 30,
	TELEPORT_SERQET_AMBUSH_ON      = 31,
	TELEPORT_SERQET_AMBUSH_OFF     = 32,
	TELEPORT_NUWA_ENVIRONMENT      = 33,
	TELEPORT_ODIN_RAVENSHOUT_AOE   = 34,
	TELEPORT_ARACHNE_COCOON_EXPLOSION = 35,
	TELEPORT_ENTER_AO_WATER        = 36,
	TELEPORT_EXIT_AO_WATER         = 37,
	TELEPORT_HOUYI_DIVEBOMB_EXPLOSION = 38,
	TELEPORT_CUPID_HEARTBOMB_INSTANT = 39,
	TELEPORT_AHPUCH_CORPSE_WARMUP  = 40,
	TELEPORT_SOL_REAPPEAR          = 41,
	TELEPORT_G72_FLASH             = 42,
	TELEPORT_RAIJIN_THUNDER_ENTER  = 43,
	TELEPORT_RAIJIN_THUNDER_EXIT   = 44,
	TELEPORT_KALDR_ENTER           = 45,
	TELEPORT_KALDR_EXIT            = 46,
	TELEPORT_ERLANG_SHEN_DOG_ENTER = 47,
	TELEPORT_ERLANG_SHEN_DOG_EXIT  = 48,
	TELEPORT_RELIC_ENTER           = 49,
	TELEPORT_RELIC_EXIT            = 50,
	TELEPORT_ANUBIS_ENVIRONMENT    = 51,
	TELEPORT_APEP_STRIKE           = 52,
	TELEPORT_FLICKER_ENTER         = 53,
	TELEPORT_FLICKER_EXIT          = 54,
	TELEPORT_TF1_KILLED_CAMP       = 55,
	TELEPORT_TF2_KILLED_CAMP       = 56,
	TELEPORT_DAJI_MOVEMENT         = 57,
	TELEPORT_SKYDOME_FX            = 58,
	TELEPORT_GOD95_EXPLOSION_INSTANT = 59,
	TELEPORT_GOD95_A01_WARNING     = 60,
	TELEPORT_FREYA_EXPLOSION_INSTANT = 61,
	TELEPORT_KNIGHT_EXPLOSION_INSTANT = 62,
	TELEPORT_WIZARD_A03_ENTER      = 63,
	TELEPORT_WIZARD_A03_EXIT       = 64,
	TELEPORT_SET_A03_ENTER         = 65,
	TELEPORT_SET_A03_EXIT          = 66,
	TELEPORT_HORUS_A04_BLINK       = 67,
	TELEPORT_NGM3BLINK_ENTER       = 68,
	TELEPORT_NGM3BLINK_EXIT        = 69,
	TELEPORT_HEIMDALLR_ENTER       = 70,
	TELEPORT_HEIMDALLR_EXIT        = 71,
	TELEPORT_HOUYI_T5_A01          = 72,
	TELEPORT_HOUYI_T5_A02_OUT      = 73,
	TELEPORT_HOUYI_T5_A02_IN       = 74,
	TELEPORT_JANUS_ENTER           = 75,
	TELEPORT_JANUS_EXIT            = 76,
	TELEPORT_MAX                   = 77
};


// Enum TgGame.TgPawn.ESkinLevelMechanic
enum class ESkinLevelMechanic : uint8_t
{
	SLM_Manual                     = 0,
	SLM_Auto                       = 1,
	SLM_Gated                      = 2,
	SLM_MAX                        = 3
};


// Enum TgGame.TgPawn.ENewChargeState
enum class ENewChargeState : uint8_t
{
	NEWCHARGE_None                 = 0,
	NEWCHARGE_Accel                = 1,
	NEWCHARGE_MAX                  = 2
};


// Enum TgGame.TgPawn.SkyJumpPhase
enum class ESkyJumpPhase : uint8_t
{
	SJP_None                       = 0,
	SJP_Summon                     = 1,
	SJP_Ascend                     = 2,
	SJP_Riding                     = 3,
	SJP_Dismount                   = 4,
	SJP_Death                      = 5,
	SJP_Death_While_Summon         = 6,
	SJP_MAX                        = 7
};


// Enum TgGame.TgAIBehaviorCondition_PawnState.PawnStateName
enum class EPawnStateName : uint8_t
{
	PSN_Auto                       = 0,
	PSN_Idle                       = 1,
	PSN_Dying                      = 2,
	PSN_Evade                      = 3,
	PSN_Downed                     = 4,
	PSN_MAX                        = 5
};


// Enum TgGame.TgAILocalPositionSolver.ERepulsorWeightMethod
enum class ERepulsorWeightMethod : uint8_t
{
	RWM_Cubic                      = 0,
	RWM_Lerp                       = 1,
	RWM_Slerp                      = 2,
	RWM_MAX                        = 3
};


// Enum TgGame.TgAIObstacleAvoidance.EObstacleAvoidanceStatus
enum class EObstacleAvoidanceStatus : uint8_t
{
	OAS_NoPath                     = 0,
	OAS_Pathing                    = 1,
	OAS_PathFinished               = 2,
	OAS_MAX                        = 3
};


// Enum TgGame.TgBehaviorTracker.ETrackerActionTypes
enum class ETrackerActionTypes : uint8_t
{
	TBAT_Prompt                    = 0,
	TBAT_Record                    = 1,
	TBAT_MAX                       = 2
};


// Enum TgGame.TgBehaviorTracker.ETrackedBehaviorType
enum class ETrackedBehaviorType : uint8_t
{
	BTIR_DeathCount                = 0,
	BTIR_DeathFrequency            = 1,
	BTIR_Idle                      = 2,
	BTIR_OutOfCombat               = 3,
	BTIR_BuildValue                = 4,
	BTIR_Communication             = 5,
	BTIR_Mutes                     = 6,
	BTIR_VGS                       = 7,
	BTIR_MAX                       = 8
};


// Enum TgGame.TgBehaviorTracker.ETrackedBehaviorCategory
enum class ETrackedBehaviorCategory : uint8_t
{
	TBC_Feeding                    = 0,
	TBC_AFK                        = 1,
	TBC_Behavior                   = 2,
	TBC_MAX                        = 3
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaA02IngredientMajority
enum class EBabaYagaA02IngredientMajority : uint8_t
{
	BYIM_IngredientA               = 0,
	BYIM_IngredientB               = 1,
	BYIM_IngredientC               = 2,
	BYIM_Neutral                   = 3,
	BYIM_MAX                       = 4
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaA02Ingredients
enum class EBabaYagaA02Ingredients : uint8_t
{
	BYI_IngredientA                = 0,
	BYI_IngredientB                = 1,
	BYI_IngredientC                = 2,
	BYI_MAX                        = 3
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaA01AnimState
enum class EBabaYagaA01AnimState : uint8_t
{
	BYA01A_Circle                  = 0,
	BYA01A_Straight                = 1,
	BYA01A_MAX                     = 2
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaTargeterDevice
enum class EBabaYagaTargeterDevice : uint8_t
{
	BYT_Inhand                     = 0,
	BYT_A02                        = 1,
	BYT_A04                        = 2,
	BYT_MAX                        = 3
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaA02VisualState
enum class EBabaYagaA02VisualState : uint8_t
{
	BYA02VS_Equipped               = 0,
	BYA02VS_Stored                 = 1,
	BYA02VS_Consumed               = 2,
	BYA02VS_MAX                    = 3
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaA02AnimState
enum class EBabaYagaA02AnimState : uint8_t
{
	BYA02A_None                    = 0,
	BYA02A_Brew                    = 1,
	BYA02A_Store                   = 2,
	BYA02A_Retrieve                = 3,
	BYA02A_MAX                     = 4
};


// Enum TgGame.TgPawn_BabaYaga.BabaYagaA02IngredientTotals
enum class EBabaYagaA02IngredientTotals : uint8_t
{
	BYIT_Low                       = 0,
	BYIT_Mid                       = 1,
	BYIT_High                      = 2,
	BYIT_MAX                       = 3
};


// Enum TgGame.TgPawn_Bellona.EBellonaWeaponSwapState
enum class EBellonaWeaponSwapState : uint8_t
{
	SWAPSTATE_PreSwap              = 0,
	SWAPSTATE_DeviceSwapped        = 1,
	SWAPSTATE_FullSwap             = 2,
	SWAPSTATE_MAX                  = 3
};


// Enum TgGame.TgPawn_Bellona.EBellonaWeaponSet
enum class EBellonaWeaponSet : uint8_t
{
	BWS_Sword                      = 0,
	BWS_SwordShield                = 1,
	BWS_Hammer                     = 2,
	BWS_Scourge                    = 3,
	BWS_EmptyHands                 = 4,
	BWS_MAX                        = 5
};


// Enum TgGame.TgAnimBlendByDirection.EBlendDirTypes
enum class EBlendDirTypes : uint8_t
{
	FBDir_Forward                  = 0,
	FBDir_Back                     = 1,
	FBDir_Left                     = 2,
	FBDir_Right                    = 3,
	FBDir_ForwardRight             = 4,
	FBDir_ForwardLeft              = 5,
	FBDir_BackRight                = 6,
	FBDir_BackLeft                 = 7,
	FBDir_Standing                 = 8,
	FBDir_None                     = 9,
	FBDir_MAX                      = 10
};


// Enum TgGame.TgAnimBlendByDirection.EBlendByDirectionSpeedType
enum class EBlendByDirectionSpeedType : uint8_t
{
	EBBDST_Velocity                = 0,
	EBBDST_Accel                   = 1,
	EBBDST_MAX                     = 2
};


// Enum TgGame.TgAnimBlendByFall.EBlendFallTypes
enum class EBlendFallTypes : uint8_t
{
	FBT_Up                         = 0,
	FBT_UpLoop                     = 1,
	FBT_Down                       = 2,
	FBT_PreLand                    = 3,
	FBT_Land                       = 4,
	FBT_Jump                       = 5,
	FBT_None                       = 6,
	FBT_MovingLand                 = 7,
	FBT_MAX                        = 8
};


// Enum TgGame.TgAnimBlendByFire_ZhongKui.DemonScrollState
enum class EDemonScrollState : uint8_t
{
	DEMONSCROLL_CHARGING           = 0,
	DEMONSCROLL_CHARGED            = 1,
	DEMONSCROLL_DISCHARGING        = 2,
	DEMONSCROLL_DISCHARGED         = 3,
	DEMONSCROLL_MAX                = 4
};


// Enum TgGame.TgAnimBlendByFlying.EFlyDirTypes
enum class EFlyDirTypes : uint8_t
{
	FDir_Forward                   = 0,
	FDir_Back                      = 1,
	FDir_Left                      = 2,
	FDir_Right                     = 3,
	FDir_Up                        = 4,
	FDir_Down                      = 5,
	FDir_UpMidair                  = 6,
	FDir_None                      = 7,
	FDir_MAX                       = 8
};


// Enum TgGame.TgPawn_Freya.TgPawn_Freya_WeaponType
enum class ETgPawn_Freya_WeaponType : uint8_t
{
	TGPFWT_MELEE                   = 0,
	TGPFWT_RANGED                  = 1,
	TGPFWT_ULTIMATE                = 2,
	TGPFWT_MAX                     = 3
};


// Enum TgGame.TgPawn_G84.MirrorImageStates
enum class EMirrorImageStates : uint8_t
{
	MirrorImageState_IntroA        = 0,
	MirrorImageState_IntroB        = 1,
	MirrorImageState_IdleA         = 2,
	MirrorImageState_IdleB         = 3,
	MirrorImageState_Attack        = 4,
	MirrorImageState_Outro         = 5,
	MirrorImageState_MAX           = 6
};


// Enum TgGame.TgPawn_Racer.RacerFloatGameStatsIndices
enum class ERacerFloatGameStatsIndices : uint8_t
{
	RacerFloatGameStatsIndices_Lap1Time = 0,
	RacerFloatGameStatsIndices_Lap2Time = 1,
	RacerFloatGameStatsIndices_Lap3Time = 2,
	RacerFloatGameStatsIndices_Lap4Time = 3,
	RacerFloatGameStatsIndices_MAX = 4
};


// Enum TgGame.TgPawn_Racer.RacerIntGameStatsIndices
enum class ERacerIntGameStatsIndices : uint8_t
{
	RacerIntGameStatsIndices_Place = 0,
	RacerIntGameStatsIndices_LapsCompleted = 1,
	RacerIntGameStatsIndices_CurrentItem = 2,
	RacerIntGameStatsIndices_ItemsUsed = 3,
	RacerIntGameStatsIndices_WrongWay = 4,
	RacerIntGameStatsIndices_ItemHits = 5,
	RacerIntGameStatsIndices_SpeedPads = 6,
	RacerIntGameStatsIndices_DriftBoosts = 7,
	RacerIntGameStatsIndices_MAX   = 8
};


// Enum TgGame.TgPawn_Racer.RacerActionAnimNames
enum class ERacerActionAnimNames : uint8_t
{
	RacerActionAnimNames_Accel     = 0,
	RacerActionAnimNames_Wall      = 1,
	RacerActionAnimNames_Brake     = 2,
	RacerActionAnimNames_EngineShake = 3,
	RacerActionAnimNames_Fire_F    = 4,
	RacerActionAnimNames_Fire_B    = 5,
	RacerActionAnimNames_Fire_G    = 6,
	RacerActionAnimNames_Fwd_Turn_L = 7,
	RacerActionAnimNames_Fwd_Turn_L_Drift = 8,
	RacerActionAnimNames_Fwd_Turn_R = 9,
	RacerActionAnimNames_Fwd_Turn_R_Drift = 10,
	RacerActionAnimNames_HitReaction_B = 11,
	RacerActionAnimNames_HitReaction_F = 12,
	RacerActionAnimNames_HitReaction_L = 13,
	RacerActionAnimNames_HitReaction_R = 14,
	RacerActionAnimNames_Idle      = 15,
	RacerActionAnimNames_Jump      = 16,
	RacerActionAnimNames_KnockedUp = 17,
	RacerActionAnimNames_OnGrass   = 18,
	RacerActionAnimNames_Rev_Turn_L = 19,
	RacerActionAnimNames_Rev_Turn_L_Drift = 20,
	RacerActionAnimNames_Rev_Turn_R = 21,
	RacerActionAnimNames_Rev_Turn_R_Drift = 22,
	RacerActionAnimNames_SpeedBoost = 23,
	RacerActionAnimNames_SpinOut   = 24,
	RacerActionAnimNames_Victory   = 25,
	RacerActionAnimNames_Defeat    = 26,
	RacerActionAnimNames_Honk      = 27,
	RacerActionAnimNames_PassL     = 28,
	RacerActionAnimNames_PassR     = 29,
	RacerActionAnimNames_Taunt     = 30,
	RacerActionAnimNames_Wave      = 31,
	RacerActionAnimNames_Fwd_Turn_L_Loose_Drift = 32,
	RacerActionAnimNames_Fwd_Turn_L_Counter_Drift = 33,
	RacerActionAnimNames_Fwd_Turn_R_Loose_Drift = 34,
	RacerActionAnimNames_Fwd_Turn_R_Counter_Drift = 35,
	RacerActionAnimNames_MAX       = 36
};


// Enum TgGame.TgPawn_Racer.RacerGear
enum class ERacerGear : uint8_t
{
	RacerGear_Drive                = 0,
	RacerGear_Neutral              = 1,
	RacerGear_Reverse              = 2,
	RacerGear_MAX                  = 3
};


// Enum TgGame.TgPawn_Racer.RacerDriftState
enum class ERacerDriftState : uint8_t
{
	RacerDriftState_Inactive       = 0,
	RacerDriftState_DriftRight     = 1,
	RacerDriftState_DriftLeft      = 2,
	RacerDriftState_MAX            = 3
};


// Enum TgGame.TgPawn_Racer.RacerFinishState
enum class ERacerFinishState : uint8_t
{
	RacerFinishState_NoStart       = 0,
	RacerFinishState_Countdown     = 1,
	RacerFinishState_NotFinished   = 2,
	RacerFinishState_VictoryLap    = 3,
	RacerFinishState_Spectating    = 4,
	RacerFinishState_Disconnected  = 5,
	RacerFinishState_MAX           = 6
};


// Enum TgGame.TgAnimBlendBySpeed.ESpeedType
enum class ESpeedType : uint8_t
{
	EST_Velocity                   = 0,
	EST_AccelAndMaxSpeed           = 1,
	EST_MAX                        = 2
};


// Enum TgGame.TgAnimMetaData_SkelControl_BoneScale_KeyFrame.EOnRelevanceChange
enum class EOnRelevanceChange : uint8_t
{
	ORC_NORMAL                     = 0,
	ORC_FORCE_KEYFRAME             = 1,
	ORC_FORCE_ACTIVE               = 2,
	ORC_FORCE_INACTIVE             = 3,
	ORC_FORCE_OTHER                = 4,
	ORC_MAX                        = 5
};


// Enum TgGame.TgAnimMetaData_SkinLevel.StartingSkinLevel
enum class EStartingSkinLevel : uint8_t
{
	SSL_NONE                       = 0,
	SSL_CURRENT                    = 1,
	SSL_NEXT                       = 2,
	SSL_CUSTOM                     = 3,
	SSL_MAX                        = 4
};


// Enum TgGame.TgAnimNodeBlendByKnockdown.EKnockDownChildren
enum class EKnockDownChildren : uint8_t
{
	KNOCKDOWNANIM_Input            = 0,
	KNOCKDOWNANIM_DownState        = 1,
	KNOCKDOWNANIM_GetUp            = 2,
	KNOCKDOWNANIM_MAX              = 3
};


// Enum TgGame.TgPawn_Mulan.MulanA03AnimState
enum class EMulanA03AnimState : uint8_t
{
	MAS3_Intro                     = 0,
	MAS3_HitIntro                  = 1,
	MAS3_ShortWallHit              = 2,
	MAS3_LongWallHit               = 3,
	MAS3_GodHit                    = 4,
	MAS3_Miss                      = 5,
	MAS3_MAX                       = 6
};


// Enum TgGame.TgPawn_DaJi.EDajiUltState
enum class EDajiUltState : uint8_t
{
	DAJI_ULT_NORMAL                = 0,
	DAJI_ULT_BUILDUP               = 1,
	DAJI_ULT_MAIN                  = 2,
	DAJI_ULT_TAKEDOWN_TARGETING    = 3,
	DAJI_ULT_TAKEDOWN              = 4,
	DAJI_ULT_DIED                  = 5,
	DAJI_ULT_MAX                   = 6
};


// Enum TgGame.TgAnimNodeBlendList_EquipScreen.EEquipScreenAnimTypes
enum class EEquipScreenAnimTypes : uint8_t
{
	ESAT_Default                   = 0,
	ESAT_Weapon                    = 1,
	ESAT_Helmet                    = 2,
	ESAT_Backpack                  = 3,
	ESAT_Suit                      = 4,
	ESAT_MAX                       = 5
};


// Enum TgGame.TgPawn_HouYi.EHouYiDivebombState
enum class EHouYiDivebombState : uint8_t
{
	HDBS_None                      = 0,
	HDBS_Buildup                   = 1,
	HDBS_Rising                    = 2,
	HDBS_InAir                     = 3,
	HDBS_Takedown                  = 4,
	HDBS_DiedInAir                 = 5,
	HDBS_MAX                       = 6
};


// Enum TgGame.TgPawn_HouYi.EHouyiDev1State
enum class EHouyiDev1State : uint8_t
{
	HDS_INACTIVE                   = 0,
	HDS_CHARGING                   = 1,
	HDS_ACTIVE                     = 2,
	HDS_MAX                        = 3
};


// Enum TgGame.TgPawn_HouYiSkin.HouYiSkinState
enum class EHouYiSkinState : uint8_t
{
	HYSS_IWannBeTheVeryBest        = 0,
	HYSS_TheBestThatEverWas        = 1,
	HYSS_MAX                       = 2
};


// Enum TgGame.TgPawn_HouYiSkin.HouYiPetAnimType
enum class EHouYiPetAnimType : uint8_t
{
	HYPAT_PlayAndGo                = 0,
	HYPAT_StopAndPlay              = 1,
	HYPAT_MAX                      = 2
};


// Enum TgGame.TgPawn_HouYiSkin.HouYiPetEvolution
enum class EHouYiPetEvolution : uint8_t
{
	HYPE_Auto                      = 0,
	HYPE_A01                       = 1,
	HYPE_A02                       = 2,
	HYPE_A03                       = 3,
	HYPE_MAX                       = 4
};


// Enum TgGame.TgPawn_HouYiSkin.HouYiPetType
enum class EHouYiPetType : uint8_t
{
	HYPT_Bot                       = 0,
	HYPT_Mesh                      = 1,
	HYPT_MAX                       = 2
};


// Enum TgGame.TgPawn_Thoth.EThothInhandState
enum class EThothInhandState : uint8_t
{
	ThothInhandState_Basic         = 0,
	ThothInhandState_Dev1          = 1,
	ThothInhandState_Dev2          = 2,
	ThothInhandState_Dev4          = 3,
	ThothInhandState_MAX           = 4
};


// Enum TgGame.TgAnimNodeBlendNPC.NPCAnimationStates
enum class ENPCAnimationStates : uint8_t
{
	NPCAS_NoCustomerPresent        = 0,
	NPCAS_CustomerPresent          = 1,
	NPCAS_Greeting                 = 2,
	NPCAS_NoSale                   = 3,
	NPCAS_CallOut                  = 4,
	NPCAS_Sale                     = 5,
	NPCAS_TransCustomerPresentToNotPresent = 6,
	NPCAS_None                     = 7,
	NPCAS_MAX                      = 8
};


// Enum TgGame.TgAnimNodeFidget.EFidgetType
enum class EFidgetType : uint8_t
{
	FT_Timed                       = 0,
	FT_ChanceOnIdleCompletes       = 1,
	FT_MAX                         = 2
};


// Enum TgGame.TgAnimNotify_AudioGroup.TG_MESH_SOURCE
enum class ETG_MESH_SOURCE : uint8_t
{
	TG_MESH_SOURCE_PAWN            = 0,
	TG_MESH_SOURCE_IN_HAND_DEVICE  = 1,
	TG_MESH_SOURCE_MAX             = 2
};


// Enum TgGame.TgAnimNotify_InterpolateMorphTargetWeight.InterruptMorphTargetBehavior
enum class EInterruptMorphTargetBehavior : uint8_t
{
	ResetToInitial                 = 0,
	ResetToValue                   = 1,
	RestToTarget                   = 2,
	InterruptMorphTargetBehavior_MAX = 3
};


// Enum TgGame.TgAnimNotify_ToggleMeshAttachment.eMeshAssemblyType
enum class EeMeshAssemblyType : uint8_t
{
	EMT_NONE                       = 0,
	EMT_MATCH                      = 1,
	EMT_VICTORY                    = 2,
	EMT_DEFEAT                     = 3,
	EMT_MAX                        = 4
};


// Enum TgGame.TgAnimNotify_ToggleRigidBodies.ERigidBodyFixationChange
enum class ERigidBodyFixationChange : uint8_t
{
	RBF_Fix                        = 0,
	RBF_Unfix                      = 1,
	RBF_Toggle                     = 2,
	RBF_MAX                        = 3
};


// Enum TgGame.TgAnimTurnInPlace.ForcedTransitionAngle
enum class EForcedTransitionAngle : uint8_t
{
	FTA_NONE                       = 0,
	FTA                            = 1,
	FTA01                          = 2,
	FTA_MAX                        = 3
};


// Enum TgGame.TgArenaManager.EArenaRoundState
enum class EArenaRoundState : uint8_t
{
	ARS_Pre                        = 0,
	ARS_Active                     = 1,
	ARS_Post                       = 2,
	ARS_Empty                      = 3,
	ARS_MAX                        = 4
};


// Enum TgGame.TgBotFactory.eBotSelection
enum class EeBotSelection : uint8_t
{
	BS_RANDOM                      = 0,
	BS_SEQUENTIAL                  = 1,
	BS_MAX                         = 2
};


// Enum TgGame.TgBotFactory_Adventure.EChestType
enum class EChestType : uint8_t
{
	TGCHEST_Normal                 = 0,
	TGCHEST_Elite                  = 1,
	TGCHEST_MAX                    = 2
};


// Enum TgGame.TgRepInfo_Factory_FireGiantGC2015a.EFireGiantChestState
enum class EFireGiantChestState : uint8_t
{
	CHEST_CLOSED                   = 0,
	CHEST_OPENING                  = 1,
	CHEST_OPENED                   = 2,
	CHEST_MAX                      = 3
};


// Enum TgGame.TgBotFactory_LeashedConfigurable.EQUEUESELECTIONTYPE
enum class EQUEUESELECTIONTYPE : uint8_t
{
	EQST_SEQUENTIAL                = 0,
	EQST_RANDOM                    = 1,
	EQST_RANDNOREPEAT              = 2,
	EQST_TIME                      = 3,
	EQST_CUSTOM                    = 4,
	EQST_KISMET                    = 5,
	EQST_MAX                       = 6
};


// Enum TgGame.TgBotFactory_LeashedConfigurable.EQUEUEPROFILESELECTION
enum class EQUEUEPROFILESELECTION : uint8_t
{
	EQPS_RANDOM                    = 0,
	EQPS_TIME                      = 1,
	EQPS_KISMET                    = 2,
	EQPS_MAX                       = 3
};


// Enum TgGame.TgBotFactory_Minions.MinionFactoryType
enum class EMinionFactoryType : uint8_t
{
	MFT_Conquest                   = 0,
	MFT_Joust                      = 1,
	MFT_Assault                    = 2,
	MFT_Mayan                      = 3,
	MFT_Other                      = 4,
	MFT_ConquestS2                 = 5,
	MFT_JoustS2                    = 6,
	MFT_Clash_Egypt                = 7,
	MFT_ConquestS5                 = 8,
	MFT_MAX                        = 9
};


// Enum TgGame.TgBotStart_Formation.BotStartFormation_Position
enum class EBotStartFormation_Position : uint8_t
{
	POS_Front                      = 0,
	POS_TopLeft                    = 1,
	POS_TopMid                     = 2,
	POS_TopRight                   = 3,
	POS_CenterLeft                 = 4,
	POS_CenterMid                  = 5,
	POS_CenterRight                = 6,
	POS_BottomLeft                 = 7,
	POS_BottomMid                  = 8,
	POS_BottomRight                = 9,
	POS_Undefined                  = 10,
	POS_MAX                        = 11
};


// Enum TgGame.TgCameraModifier_LobbyCameraTransition.CameraTransType
enum class ECameraTransType : uint8_t
{
	CTT_None                       = 0,
	CTT_PanRight                   = 1,
	CTT_PanLeft                    = 2,
	CTT_PanUp                      = 3,
	CTT_PanDown                    = 4,
	CTT_FadeToWhite                = 5,
	CTT_FadeToWhiteFast            = 6,
	CTT_MAX                        = 7
};


// Enum TgGame.TgPawn_Depthzy.DepthzyMeshSwapStance
enum class EDepthzyMeshSwapStance : uint8_t
{
	DMSS_Base                      = 0,
	DMSS_Large                     = 1,
	DMSS_MAX                       = 2
};


// Enum TgGame.TgPlayerController.EWatchOtherPlayersMode
enum class EWatchOtherPlayersMode : uint8_t
{
	WOPM_NONE                      = 0,
	WOPM_PLAYER                    = 1,
	WOPM_MAX                       = 2
};


// Enum TgGame.TgPlayerController.EGiveGoldResult
enum class EGiveGoldResult : uint8_t
{
	GGR_PlayerNotFound             = 0,
	GGR_PlayerNotFriendly          = 1,
	GGR_NotEnoughGold              = 2,
	GGR_Success                    = 3,
	GGR_MAX                        = 4
};


// Enum TgGame.TgPlayerController.EClientGameEvent
enum class EClientGameEvent : uint8_t
{
	ECGE_StoreReroll               = 0,
	ECGE_BuyXp                     = 1,
	ECGE_BankGold                  = 2,
	ECGE_ShareGold                 = 3,
	ECGE_LockStore                 = 4,
	ECGE_PurchaseUnit              = 5,
	ECGE_SellUnit                  = 6,
	ECGE_BuffUnit                  = 7,
	ECGE_ResetAllPurchases         = 8,
	ECGE_MAX                       = 9
};


// Enum TgGame.TgGameplayCurvesSet.ECurveSetTypes
enum class ECurveSetTypes : uint8_t
{
	CST_None                       = 0,
	CST_Recoil                     = 1,
	CST_RecoilSimple               = 2,
	CST_AccuracyBloom              = 3,
	CST_DamageFalloff              = 4,
	CST_DamageFalloffAOE           = 5,
	CST_DamagePerShotHit           = 6,
	CST_SpreadTendency             = 7,
	CST_RuckusSpinUpControl        = 8,
	CST_GravityFromZVelocity       = 9,
	CST_AirControlFromZVelocity    = 10,
	CST_WallRunVerticalMovement    = 11,
	CST_AimAssist                  = 12,
	CST_AimAssistKeyframes         = 13,
	CST_AimAcceleration            = 14,
	CST_TargetTracking             = 15,
	CST_HitMarkerScaleByDamage     = 16,
	CST_GravityFromCustom          = 17,
	CST_ProjectileSpeedOverTime    = 18,
	CST_FlakInhandSlow             = 19,
	CST_FlakInhandKnockback        = 20,
	CST_ThreatLevelByRange         = 21,
	CST_AimAssistBoundsScale       = 22,
	CST_ProjFrictionOverTime       = 23,
	CST_ProjGravityOverTime        = 24,
	CST_ScopeWeaponFOV             = 25,
	CST_ScopeWorldFOV              = 26,
	CST_AimAssistBoundsByFOV       = 27,
	CST_SpeedOverDistance          = 28,
	CST_PositionFromPitch          = 29,
	CST_RecoilVisual               = 30,
	CST_StackDamageMultiplier      = 31,
	CST_MoveSpeedOverTime          = 32,
	CST_BulletMagnetOverDist       = 33,
	CST_Friction                   = 34,
	CST_Basic                      = 35,
	CST_Aiming                     = 36,
	CST_MAX                        = 37
};


// Enum TgGame.TgCharmComponent.EFiringState
enum class EFiringState : uint8_t
{
	FIRINGSTATE_NONE               = 0,
	FIRINGSTATE_PREHIT             = 1,
	FIRINGSTATE_POSTHIT            = 2,
	FIRINGSTATE_MAX                = 3
};


// Enum TgGame.TgClientSettings.ECastMode
enum class ECastMode : uint8_t
{
	CM_Default                     = 0,
	CM_Quick                       = 1,
	CM_Instant                     = 2,
	CM_Use_Global                  = 3,
	CM_MAX                         = 4
};


// Enum TgGame.TgClientSettings.EFriendStateNotifications
enum class EFriendStateNotifications : uint8_t
{
	FSN_Never                      = 0,
	FSN_Lobby_Only                 = 1,
	FSN_InGame_Only                = 2,
	FSN_Always                     = 3,
	FSN_MAX                        = 4
};


// Enum TgGame.TgClientSettings.ENamePlateName
enum class ENamePlateName : uint8_t
{
	NPN_PlayerName                 = 0,
	NPN_GodName                    = 1,
	NPN_None                       = 2,
	NPN_MAX                        = 3
};


// Enum TgGame.TgClientSettings.EColorBlindOption
enum class EColorBlindOption : uint8_t
{
	CB_None                        = 0,
	CB_Protanope                   = 1,
	CB_Deuteranope                 = 2,
	CB_Tritanope                   = 3,
	CB_MAX                         = 4
};


// Enum TgGame.TgClientSettings.ETgClientSettingVersion
enum class ETgClientSettingVersion : uint8_t
{
	TCSV_Baseline                  = 0,
	TCSV_Season3Launch             = 1,
	TCSV_Racer                     = 2,
	TCSV_AimAssist                 = 3,
	TCSV_Crossplay                 = 4,
	TCSV_StreamerMode              = 5,
	TCSV_KBM                       = 6,
	TCSV_Crossplay_Settings_Update = 7,
	TCSV_Clan_Notification_Settings_Update = 8,
	TCSV_MAX                       = 9
};


// Enum TgGame.TgTimerManager.TGT_EVENT
enum class ETGT_EVENT : uint8_t
{
	TGTE_DONE                      = 0,
	TGTE_START                     = 1,
	TGTE_UPDATE                    = 2,
	TGTE_PAUSED                    = 3,
	TGTE_MAX                       = 4
};


// Enum TgGame.TgDevice.ETargetingModeStatus
enum class ETargetingModeStatus : uint8_t
{
	TMS_None                       = 0,
	TMS_PreFire                    = 1,
	TMS_CannotFire                 = 2,
	TMS_CannotPlace                = 3,
	TMS_OK                         = 4,
	TMS_MAX                        = 5
};


// Enum TgGame.TgDevice.EWeaponFireType
enum class EWeaponFireType : uint8_t
{
	EWFT_InstantHit                = 0,
	EWFT_Projectile                = 1,
	EWFT_Custom                    = 2,
	EWFT_Arcing                    = 3,
	EWFT_Melee                     = 4,
	EWFT_None                      = 5,
	EWFT_MAX                       = 6
};


// Enum TgGame.TgDevice.EDeviceChangeEvent
enum class EDeviceChangeEvent : uint8_t
{
	DCE_Created                    = 0,
	DCE_ToggleState                = 1,
	DCE_CanFire                    = 2,
	DCE_Selected                   = 3,
	DCE_Cooldown                   = 4,
	DCE_PtsAlloc                   = 5,
	DCE_Refire                     = 6,
	DCE_InstanceCount              = 7,
	DCE_DeviceBuildup              = 8,
	DCE_MAX                        = 9
};


// Enum TgGame.TgDevice_BabaYaga_A01.BabaYagaProjStatusType
enum class EBabaYagaProjStatusType : uint8_t
{
	BYPST_Slow                     = 0,
	BYPST_Silence                  = 1,
	BYPST_Speed                    = 2,
	BYPST_Protections              = 3,
	BYPST_MAX                      = 4
};


// Enum TgGame.TgDevice_BabaYaga_A01.BabaYagaProjShape
enum class EBabaYagaProjShape : uint8_t
{
	BYPS_Left                      = 0,
	BYPS_Right                     = 1,
	BYPS_Split                     = 2,
	BYPS_Circle                    = 3,
	BYPS_MAX                       = 4
};


// Enum TgGame.TgCustomBlockingTypeInterface.TG_CUSTOM_BLOCKING_TYPE
enum class ETG_CUSTOM_BLOCKING_TYPE : uint8_t
{
	CBT_None                       = 0,
	CBT_Friendly                   = 1,
	CBT_Enemy                      = 2,
	CBT_All                        = 3,
	CBT_MAX                        = 4
};


// Enum TgGame.TgDeploy_Yemoja_A04.YemojaInterriorProxy
enum class EYemojaInterriorProxy : uint8_t
{
	YIP_River                      = 0,
	YIP_ZipperHit                  = 1,
	YIP_Vision                     = 2,
	YIP_MAX                        = 3
};


// Enum TgGame.TgDeploy_Yemoja_A04.YemojaWaveProxy
enum class EYemojaWaveProxy : uint8_t
{
	YWP_Left                       = 0,
	YWP_Right                      = 1,
	YWP_MAX                        = 2
};


// Enum TgGame.TgSpectatorController.EZoomState
enum class EZoomState : uint8_t
{
	ZOOM_None                      = 0,
	ZOOM_In                        = 1,
	ZOOM_Out                       = 2,
	ZOOM_MAX                       = 3
};


// Enum TgGame.TgSpectatorController.SpecFlightMode
enum class ESpecFlightMode : uint8_t
{
	SFM_Normal                     = 0,
	SFM_Heli                       = 1,
	SFM_HeliNoVert                 = 2,
	SFM_MAX                        = 3
};


// Enum TgGame.TgSpectatorController.SpectatorCameraMode
enum class ESpectatorCameraMode : uint8_t
{
	SpecCam_None                   = 0,
	SpecCam_Fly                    = 1,
	SpecCam_FollowThirdPerson      = 2,
	SpecCam_FollowTopDown          = 3,
	SpecCam_Camera                 = 4,
	SpecCam_Overview               = 5,
	SpecCam_LockedView             = 6,
	SpecCam_MAX                    = 7
};


// Enum TgGame.TgSpectatorController.SpectatorCameraCycle
enum class ESpectatorCameraCycle : uint8_t
{
	SpecCycle_None                 = 0,
	SpecCycle_PlayerFriendly       = 1,
	SpecCycle_PlayerEnemy          = 2,
	SpecCycle_Player               = 3,
	SpecCycle_TowerFriendly        = 4,
	SpecCycle_TowerEnemy           = 5,
	SpecCycle_Tower                = 6,
	SpecCycle_Cinematic            = 7,
	SpecCycle_Action               = 8,
	SpecCycle_MAX                  = 9
};


// Enum TgGame.TgSpectatorController.ESpectatorMode
enum class ESpectatorMode : uint8_t
{
	SPECMODE_Manual                = 0,
	SPECMODE_Director              = 1,
	SPECMODE_Assisted              = 2,
	SPECMODE_Broadcast1            = 3,
	SPECMODE_Broadcast2            = 4,
	SPECMODE_Broadcast3            = 5,
	SPECMODE_Broadcast4            = 6,
	SPECMODE_MAX                   = 7
};


// Enum TgGame.TgDeployable.DeployableCollisionComponentInitType
enum class EDeployableCollisionComponentInitType : uint8_t
{
	DCCIT_MeshSetup                = 0,
	DCCIT_FireMode_MinimumRadius   = 1,
	DCCIT_FireMode_DamageRadius    = 2,
	DCCIT_CustomValues             = 3,
	DCCIT_MAX                      = 4
};


// Enum TgGame.TgDeploy_ForceField.TG_DAMAGETYPE_INDEX
enum class ETG_DAMAGETYPE_INDEX : uint8_t
{
	TDT_THERMAL                    = 0,
	TDT_PHYSICAL                   = 1,
	TDT_MAGICAL                    = 2,
	TDT_BIO                        = 3,
	TDT_MAX                        = 4
};


// Enum TgGame.TgDeploy_Artillery.ArtilleryType
enum class EArtilleryType : uint8_t
{
	Artillery_Player               = 0,
	Artillery_Self                 = 1,
	Artillery_MAX                  = 2
};


// Enum TgGame.TgDeploy_BabaYaga_A01.BabaYagaWarningShape
enum class EBabaYagaWarningShape : uint8_t
{
	BYWS_Left                      = 0,
	BYWS_Right                     = 1,
	BYWS_Split                     = 2,
	BYWS_MAX                       = 3
};


// Enum TgGame.TgDeploy_BabaYaga_A04.BabaYagaA04TargetType
enum class EBabaYagaA04TargetType : uint8_t
{
	BYTT_God                       = 0,
	BYTT_Minion                    = 1,
	BYTT_MAX                       = 2
};


// Enum TgGame.TgDeploy_EffectVolume_WithEncroachment.EDeployableEncroachmentEvent
enum class EDeployableEncroachmentEvent : uint8_t
{
	DEE_Touch                      = 0,
	DEE_Untouch                    = 1,
	DEE_MAX                        = 2
};


// Enum TgGame.TgDeploy_Odin_Spears_V2.OdinOctogonSection
enum class EOdinOctogonSection : uint8_t
{
	OOS_Square                     = 0,
	OOS_Diamond                    = 1,
	OOS_MAX                        = 2
};


// Enum TgGame.TgDeploy_Odin_Spears_V2.OdinRingSection
enum class EOdinRingSection : uint8_t
{
	ORS_Top                        = 0,
	ORS_TopRight                   = 1,
	ORS_Right                      = 2,
	ORS_BottomRight                = 3,
	ORS_Bottom                     = 4,
	ORS_BottomLeft                 = 5,
	ORS_Left                       = 6,
	ORS_TopLeft                    = 7,
	ORS_MAX                        = 8
};


// Enum TgGame.TgDeploy_Persephone_A01.EPersephoneWarriorState
enum class EPersephoneWarriorState : uint8_t
{
	PWS_NONE                       = 0,
	PWS_BUILDUP                    = 1,
	PWS_RUNNING                    = 2,
	PWS_FIRING                     = 3,
	PWS_MAX                        = 4
};


// Enum TgGame.TgDeploy_Persephone_A02.PersephoneA02DeployStage
enum class EPersephoneA02DeployStage : uint8_t
{
	PDS_First                      = 0,
	PDS_Second                     = 1,
	PDS_Third                      = 2,
	PDS_MAX                        = 3
};


// Enum TgGame.TgDevice_Wizard_B02.EWizardB02Position
enum class EWizardB02Position : uint8_t
{
	WB2P_Left                      = 0,
	WB2P_Right                     = 1,
	WB2P_MAX                       = 2
};


// Enum TgGame.TgDeploy_Yemoja_B01.EYemojaB01Stages
enum class EYemojaB01Stages : uint8_t
{
	YEMOJAB01_Outer                = 0,
	YEMOJAB01_Inner                = 1,
	YEMOJAB01_Center               = 2,
	YEMOJAB01_MAX                  = 3
};


// Enum TgGame.TgDeployable_Heimdallr_A03.HeimdallrA03ActiveStatus
enum class EHeimdallrA03ActiveStatus : uint8_t
{
	HAAS_None                      = 0,
	HAAS_Origin                    = 1,
	HAAS_Destination               = 2,
	HAAS_MAX                       = 3
};


// Enum TgGame.TgDeployable_Heimdallr_A03.HeimdallrDeployableFxState
enum class EHeimdallrDeployableFxState : uint8_t
{
	HDFS_Closed                    = 0,
	HDFS_Breaking                  = 1,
	HDFS_Open                      = 2,
	HDFS_MAX                       = 3
};


// Enum TgGame.TgDeployable_Heimdallr_A04.HeimA04VisibilityState
enum class EHeimA04VisibilityState : uint8_t
{
	HVS_First                      = 0,
	HVS_Second                     = 1,
	HVS_MAX                        = 2
};


// Enum TgGame.TgDeployable_Heimdallr_A04.HeimA04FXConstruction
enum class EHeimA04FXConstruction : uint8_t
{
	HMFS_Barrier                   = 0,
	HMFS_Break                     = 1,
	HMFS_MAX                       = 2
};


// Enum TgGame.TgDeployable_Heimdallr_A04.HeimA04MeshConstruction
enum class EHeimA04MeshConstruction : uint8_t
{
	HMCS_Inner                     = 0,
	HMCS_Outer                     = 1,
	HMCS_MAX                       = 2
};


// Enum TgGame.TgDeployable_Jorm_ArcV2.eJormArcState
enum class EeJormArcState : uint8_t
{
	JAS_None                       = 0,
	JAS_Leaping                    = 1,
	JAS_Stable                     = 2,
	JAS_Falling                    = 3,
	JAS_MAX                        = 4
};


// Enum TgGame.TgDeployable_Susano_Dev4_Typhoon.ESusanoTyphoonState
enum class ESusanoTyphoonState : uint8_t
{
	TGPAWN_STS_None                = 0,
	TGPAWN_STS_Growing             = 1,
	TGPAWN_STS_Traveling           = 2,
	TGPAWN_STS_MAX                 = 3
};


// Enum TgGame.TgDeployable_Terra_CrushingShale.ETerraCrushingShaleDestructionState
enum class ETerraCrushingShaleDestructionState : uint8_t
{
	ShaleDestroyed_Crush           = 0,
	ShaleDestroyed_Shatter         = 1,
	ShaleDestroyed_Timeout         = 2,
	ShaleDestroyed_MAX             = 3
};


// Enum TgGame.TgDevice_TwoPhase.ETwoPhaseState
enum class ETwoPhaseState : uint8_t
{
	DTP_Normal                     = 0,
	DTP_Waiting                    = 1,
	DTP_AltFireReady               = 2,
	DTP_AltFireActive              = 3,
	DTP_MAX                        = 4
};


// Enum TgGame.TgDevice_TwoPhase.ETwoPhaseCustomValueType
enum class ETwoPhaseCustomValueType : uint8_t
{
	DTPCV_NormalFire               = 0,
	DTPCV_AltFire                  = 1,
	DTPCV_Never                    = 2,
	DTPCV_MAX                      = 3
};


// Enum TgGame.TgDevice_TimerFromParent.ETargetingTimerCheckpointType
enum class ETargetingTimerCheckpointType : uint8_t
{
	TTCT_BuildUp                   = 0,
	TTCT_StartFire                 = 1,
	TTCT_Fire                      = 2,
	TTCT_StopFire                  = 3,
	TTCT_MAX                       = 4
};


// Enum TgGame.TgDevice_Staging.EBlockAegisType
enum class EBlockAegisType : uint8_t
{
	BAT_Never                      = 0,
	BAT_BuildUp                    = 1,
	BAT_WhileFiring                = 2,
	BAT_FullFireLoop               = 3,
	BAT_MAX                        = 4
};


// Enum TgGame.TgDevice_TogglableDeployable.ETogglableDeployableState
enum class ETogglableDeployableState : uint8_t
{
	TDS_Normal                     = 0,
	TDS_Waiting                    = 1,
	TDS_ToggleReady                = 2,
	TDS_MAX                        = 3
};


// Enum TgGame.TgDevice_Charge.ChargeFiringType
enum class EChargeFiringType : uint8_t
{
	CFT_Fire                       = 0,
	CFT_PreFire                    = 1,
	CFT_PostFire                   = 2,
	CFT_MAX                        = 3
};


// Enum TgGame.TgDevice_Charge.ChargeStopOnHitType
enum class EChargeStopOnHitType : uint8_t
{
	CSHT_None                      = 0,
	CSHT_AnyValidTarget            = 1,
	CSHT_GodOnly                   = 2,
	CSHT_NotGod                    = 3,
	CSHT_SpecialTarget             = 4,
	CSHT_MAX                       = 5
};


// Enum TgGame.TgDevice_Charge.ChargeEndState
enum class EChargeEndState : uint8_t
{
	CES_Miss                       = 0,
	CES_Hit                        = 1,
	CES_Interrupted                = 2,
	CES_MAX                        = 3
};


// Enum TgGame.TgDevice_BabaYaga_A02.BabaYagaA02ArrayIndex
enum class EBabaYagaA02ArrayIndex : uint8_t
{
	BYAI_Potion1                   = 0,
	BYAI_Potion2                   = 1,
	BYAI_MAX                       = 2
};


// Enum TgGame.TgDevice_BabaYaga_A02_Consumable.BabaYagaA02Icons
enum class EBabaYagaA02Icons : uint8_t
{
	BYIC_MajorA                    = 0,
	BYIC_MajorB                    = 1,
	BYIC_MajorC                    = 2,
	BYIC_Neutral                   = 3,
	BYIC_MAX                       = 4
};


// Enum TgGame.TgDevice_BabaYaga_A04_Sub.BabaYagaA04FireTimings
enum class EBabaYagaA04FireTimings : uint8_t
{
	BY4FT_FireAPreHitDelay         = 0,
	BY4FT_FireAPostHitDelay        = 1,
	BY4FT_FireBPreHitDelay         = 2,
	BY4FT_FireBPostHitDelay        = 3,
	BY4FT_FireCPreHitDelay         = 4,
	BY4FT_FireCPostHitDelay        = 5,
	BY4FT_FireDPreHitDelay         = 6,
	BY4FT_FireDPostHitDelay        = 7,
	BY4FT_MAX                      = 8
};


// Enum TgGame.TgDevice_BabaYaga_A04_Sub.BabaYagaA04FireType
enum class EBabaYagaA04FireType : uint8_t
{
	BY4F_FireA                     = 0,
	BY4F_FireB                     = 1,
	BY4F_FireC                     = 2,
	BY4F_FireD                     = 3,
	BY4F_BlockedFire               = 4,
	BY4F_MAX                       = 5
};


// Enum TgGame.TgDevice_WarningDeployable.EWarningDeployableTimingType
enum class EWarningDeployableTimingType : uint8_t
{
	WDTT_Buildup                   = 0,
	WDTT_StartFire                 = 1,
	WDTT_Fire                      = 2,
	WDTT_ProjectileShutdown        = 3,
	WDTT_StopFire                  = 4,
	WDTT_MAX                       = 5
};


// Enum TgGame.TgDevice_BabaYagaHut_A04_Reposition.BabaYagaHutA04RepositionType
enum class EBabaYagaHutA04RepositionType : uint8_t
{
	BYHR_ToOwner                   = 0,
	BYHR_ToOrigin                  = 1,
	BYHR_MAX                       = 2
};


// Enum TgGame.TgDevice_BastetPounce.EBastetPounceState
enum class EBastetPounceState : uint8_t
{
	BPS_Normal                     = 0,
	BPS_InForwardWaiting           = 1,
	BPS_ShouldPounceBack           = 2,
	BPS_InBackwardWaiting          = 3,
	BPS_MAX                        = 4
};


// Enum TgGame.TgPawn_BastetV2.BastetSphinxPosition
enum class EBastetSphinxPosition : uint8_t
{
	BSP_Left                       = 0,
	BSP_Right                      = 1,
	BSP_MAX                        = 2
};


// Enum TgGame.TgPawn_BastetV2.BastetA01LeapState
enum class EBastetA01LeapState : uint8_t
{
	BLS_ForwardLeap                = 0,
	BLS_ForwardLand                = 1,
	BLS_BackwardLeap               = 2,
	BLS_BackwardLand               = 3,
	BLS_MAX                        = 4
};


// Enum TgGame.TgDevice_Bastet_A03.BastetA03FireType
enum class EBastetA03FireType : uint8_t
{
	BFT_Left                       = 0,
	BFT_Right                      = 1,
	BFT_MAX                        = 2
};


// Enum TgGame.TgDevice_Bellona_ShieldBash.EShieldBashState
enum class EShieldBashState : uint8_t
{
	BASH_INACTIVE                  = 0,
	BASH_START                     = 1,
	BASH_ACTIVE                    = 2,
	BASH_MAX                       = 3
};


// Enum TgGame.TgDevice_Bellona_SpinToStrike.ESpinToStrikeState
enum class ESpinToStrikeState : uint8_t
{
	STRIKE_INACTIVE                = 0,
	STRIKE_START                   = 1,
	STRIKE_ACTIVE                  = 2,
	STRIKE_MAX                     = 3
};


// Enum TgGame.TgPawn_Cerberus.ECerberusA01Anims
enum class ECerberusA01Anims : uint8_t
{
	CA1A_S                         = 0,
	CA1A_L                         = 1,
	CA1A_M                         = 2,
	CA1A_LM                        = 3,
	CA1A_R                         = 4,
	CA1A_LR                        = 5,
	CA1A_RM                        = 6,
	CA1A_LMR                       = 7,
	CA1A_MAX                       = 8
};


// Enum TgGame.TgPawn_Cerberus.ECerberusHead
enum class ECerberusHead : uint8_t
{
	CH_Snake                       = 0,
	CH_LeftHead                    = 1,
	CH_MiddleHead                  = 2,
	CH_RightHead                   = 3,
	CH_MAX                         = 4
};


// Enum TgGame.TgDevice_CH05_Seaweed.CURRENTSEAWEEDSTATE
enum class ECURRENTSEAWEEDSTATE : uint8_t
{
	TGCSS_FIRST                    = 0,
	TGCSS_SECOND                   = 1,
	TGCSS_MAX                      = 2
};


// Enum TgGame.TgDevice_Danzaburou_A04.DanzaburouA04FireType
enum class EDanzaburouA04FireType : uint8_t
{
	D4FT_Undecided                 = 0,
	D4FT_Charge                    = 1,
	D4FT_Projectile                = 2,
	D4FT_MAX                       = 3
};


// Enum TgGame.TgDevice_Danzaburou_PSV.DanzaburouMoneyPouchType
enum class EDanzaburouMoneyPouchType : uint8_t
{
	DMPT_Pouch1                    = 0,
	DMPT_Pouch2                    = 1,
	DMPT_Pouch3                    = 2,
	DMPT_Pouch4                    = 3,
	DMPT_MAX                       = 4
};


// Enum TgGame.TgDevice_Depthzy_A03.DepthzyRollingLinePosition
enum class EDepthzyRollingLinePosition : uint8_t
{
	DRLP_Left                      = 0,
	DRLP_Right                     = 1,
	DRLP_MAX                       = 2
};


// Enum TgGame.TgDevice_Depthzy_B01.DepthzyClawPosition
enum class EDepthzyClawPosition : uint8_t
{
	DCP_Center                     = 0,
	DCP_Left                       = 1,
	DCP_Right                      = 2,
	DCP_MAX                        = 3
};


// Enum TgGame.TgDevice_Dialogue.EDialogueComplianceType
enum class EDialogueComplianceType : uint8_t
{
	DCT_NOT_FOUND                  = 0,
	DCT_FOUND_TRIGGER              = 1,
	DCT_FOUND_NO_TRIGGER           = 2,
	DCT_MAX                        = 3
};


// Enum TgGame.TgPawn_NPC_Wizard.EWizardEquipPoint
enum class EWizardEquipPoint : uint8_t
{
	WEP_AUTO                       = 0,
	WEP_PASSIVE                    = 1,
	WEP_OFFHAND                    = 2,
	WEP_OFFHAND01                  = 3,
	WEP_OFFHAND02                  = 4,
	WEP_OFFHAND03                  = 5,
	WEP_MAX                        = 6
};


// Enum TgGame.TgPawn_NPC_Wizard.EWizardType
enum class EWizardType : uint8_t
{
	WT_Minor                       = 0,
	WT_Major                       = 1,
	WT_Champ                       = 2,
	WT_MAX                         = 3
};


// Enum TgGame.TgPawn_ErlangShen.ERLANG_SHEN_TRANSFORM
enum class ERLANG_SHEN_TRANSFORM : uint8_t
{
	ERLANG_SHEN_TRANSFORM_SELF     = 0,
	ERLANG_SHEN_TRANSFORM_MINK     = 1,
	ERLANG_SHEN_TRANSFORM_TURTLE   = 2,
	ERLANG_SHEN_TRANSFORM_MAX      = 3
};


// Enum TgGame.TgDevice_G72_Dev1.G72_AuraType
enum class EG72_AuraType : uint8_t
{
	G72A_AWis                      = 0,
	G72A_AVal                      = 1,
	G72A_MAX                       = 2
};


// Enum TgGame.TgDevice_God94_PSV.EGod94PassiveType
enum class EGod94PassiveType : uint8_t
{
	G94PassiveType_None            = 0,
	G94PassiveType_A               = 1,
	G94PassiveType_B               = 2,
	G94PassiveType_MAX             = 3
};


// Enum TgGame.TgDevice_Heimdallr_A03.HeimdallrA03State
enum class EHeimdallrA03State : uint8_t
{
	HeimA03_Inactive               = 0,
	HeimA03_Active                 = 1,
	HeimA03_Firing                 = 2,
	HeimA03_Cooldown               = 3,
	HeimA03_MAX                    = 4
};


// Enum TgGame.TgDevice_Heimdallr_A03.HeimdallrDeployableOrder
enum class EHeimdallrDeployableOrder : uint8_t
{
	HDO_First                      = 0,
	HDO_Second                     = 1,
	HDO_MAX                        = 2
};


// Enum TgGame.TgDevice_Heimdallr_PSV.HeimdallrPSVStateFlag
enum class EHeimdallrPSVStateFlag : uint8_t
{
	HPSF_Visible                   = 0,
	HPSF_Marked                    = 1,
	HPSF_Unmarked                  = 2,
	HPSF_MAX                       = 3
};


// Enum TgGame.TgDevice_Horus_Dev4_Staging.EHorusTeleportDeployable
enum class EHorusTeleportDeployable : uint8_t
{
	HORUS_TP_START                 = 0,
	HORUS_TP_END                   = 1,
	HORUS_TP_MAX                   = 2
};


// Enum TgGame.TgDevice_Horus_Dev4_Staging.EHorusUltState
enum class EHorusUltState : uint8_t
{
	HORUS_ULT_NONE                 = 0,
	HORUS_ULT_BUILDUP              = 1,
	HORUS_ULT_RISING               = 2,
	HORUS_ULT_FLYING               = 3,
	HORUS_ULT_TELEPORTING          = 4,
	HORUS_ULT_LANDED               = 5,
	HORUS_ULT_DIED                 = 6,
	HORUS_ULT_MAX                  = 7
};


// Enum TgGame.TgDevice_Janus_A02_V2.DeathGateProjectileType
enum class EDeathGateProjectileType : uint8_t
{
	DGPT_Sinusoid                  = 0,
	DGPT_Middle                    = 1,
	DGPT_MAX                       = 2
};


// Enum TgGame.TgDevice_Knight_Dev3A.EKnightDev3AState
enum class EKnightDev3AState : uint8_t
{
	KD3A_INACTIVE                  = 0,
	KD3A_STRIKE                    = 1,
	KD3A_SPIN                      = 2,
	KD3A_MAX                       = 3
};


// Enum TgGame.TgDevice_Monkey_FuriousMonkey.EFuriousMonkeyState
enum class EFuriousMonkeyState : uint8_t
{
	FMS_Normal                     = 0,
	FMS_ProjectileOut              = 1,
	FMS_PostProjectile             = 2,
	FMS_MAX                        = 3
};


// Enum TgGame.TgMulanEvolutionInterface.MulanEvolutionState
enum class EMulanEvolutionState : uint8_t
{
	MES_EVOLUTIONBASE              = 0,
	MES_EVOLUTION1                 = 1,
	MES_EVOLUTION2                 = 2,
	MES_EVOLUTION3                 = 3,
	MES_MAX                        = 4
};


// Enum TgGame.TgDevice_Neith_BrokenWeave.WeaveSpawnType
enum class EWeaveSpawnType : uint8_t
{
	TG_WEAVESPAWNTYPE_BACKFLIP     = 0,
	TG_WEAVESPAWNTYPE_PAWNDEATH    = 1,
	TG_WEAVESPAWNTYPE_UNTRACKED    = 2,
	TG_WEAVESPAWNTYPE_MAX          = 3
};


// Enum TgGame.TgDevice_Nike_Dev2_V2.ENikeDev2AnimState
enum class ENikeDev2AnimState : uint8_t
{
	NIKE_DEV2_IDLE                 = 0,
	NIKE_DEV2_SHIELD_INTRO         = 1,
	NIKE_DEV2_SHIELD_ACTIVE        = 2,
	NIKE_DEV2_PREFIRE              = 3,
	NIKE_DEV2_POSTFIRE             = 4,
	NIKE_DEV2_MAX                  = 5
};


// Enum TgGame.TgDevice_NuWa_Passive.CRYSTAL_TYPE
enum class ECRYSTAL_TYPE : uint8_t
{
	CRYSTAL_TYPE_NONE              = 0,
	CRYSTAL_TYPE_AURA              = 1,
	CRYSTAL_TYPE_SELF              = 2,
	CRYSTAL_TYPE_MAX               = 3
};


// Enum TgGame.TgDevice_Odin_A03.OdinSpearState
enum class EOdinSpearState : uint8_t
{
	OSS_None                       = 0,
	OSS_Stage1                     = 1,
	OSS_Stage2                     = 2,
	OSS_Stage3                     = 3,
	OSS_MAX                        = 4
};


// Enum TgGame.TgDevice_Olorun_Dev1.EOlorunDev1State
enum class EOlorunDev1State : uint8_t
{
	OLORUN_DEV1_IDLE               = 0,
	OLORUN_DEV1_INTRO              = 1,
	OLORUN_DEV1_CHARGING           = 2,
	OLORUN_DEV1_PREFIRE            = 3,
	OLORUN_DEV1_POSTFIRE           = 4,
	OLORUN_DEV1_MAX                = 5
};


// Enum TgGame.TgDevice_Olorun_Dev2.EOlorunDev2State
enum class EOlorunDev2State : uint8_t
{
	OLORUN_DEV2_IDLE               = 0,
	OLORUN_DEV2_STIM_PREFIRE       = 1,
	OLORUN_DEV2_STIM_POSTFIRE      = 2,
	OLORUN_DEV2_SUN_PREFIRE        = 3,
	OLORUN_DEV2_SUN_POSTFIRE       = 4,
	OLORUN_DEV2_MAX                = 5
};


// Enum TgGame.TgDevice_ProcOnNearbyDeath.ProcOnNearbyDeathFaction
enum class EProcOnNearbyDeathFaction : uint8_t
{
	PONDF_All                      = 0,
	PONDF_Friendly                 = 1,
	PONDF_Enemy                    = 2,
	PONDF_MAX                      = 3
};


// Enum TgGame.TgDevice_Raijin_Dev4.EBeatSelect
enum class EBeatSelect : uint8_t
{
	BEAT                           = 0,
	BEAT01                         = 1,
	BEAT02                         = 2,
	BEAT_MAX                       = 3
};


// Enum TgGame.TgDevice_Raijin_KotoDrums.EKotoBeat
enum class EKotoBeat : uint8_t
{
	KOTO                           = 0,
	KOTO01                         = 1,
	KOTO02                         = 2,
	KOTO_MAX                       = 3
};


// Enum TgGame.TgDevice_Scylla_Num3.EScyllaSentinelState
enum class EScyllaSentinelState : uint8_t
{
	SSS_Normal                     = 0,
	SSS_Waiting                    = 1,
	SSS_ToggleReady                = 2,
	SSS_ToggleActive               = 3,
	SSS_MAX                        = 4
};


// Enum TgGame.TgDevice_Set_A03.EDeviceSetA03State
enum class EDeviceSetA03State : uint8_t
{
	SetA03State_Inactive           = 0,
	SetA03State_Teleport_Success   = 1,
	SetA03State_Teleport_Fail      = 2,
	SetA03State_MAX                = 3
};


// Enum TgGame.TgPawn_Sol.ESolUltState
enum class ESolUltState : uint8_t
{
	SUS_Inactive                   = 0,
	SUS_Charging                   = 1,
	SUS_Exploded                   = 2,
	SUS_MAX                        = 3
};


// Enum TgGame.TgPawn_Sol.ESolInstabilityState
enum class ESolInstabilityState : uint8_t
{
	SOL_INSTABILITY_None           = 0,
	SOL_INSTABILITY_Stage1         = 1,
	SOL_INSTABILITY_Stage2         = 2,
	SOL_INSTABILITY_MAX            = 3
};


// Enum TgGame.TgPawn_SunWukong.WUKONG_OX_HIT_ANIM
enum class EWUKONG_OX_HIT_ANIM : uint8_t
{
	WUKONG_OX_HIT_ANIM_LEFT        = 0,
	WUKONG_OX_HIT_ANIM_RIGHT       = 1,
	WUKONG_OX_HIT_ANIM_MAX         = 2
};


// Enum TgGame.TgPawn_SunWukong.WUKONG_ULTIMATE
enum class EWUKONG_ULTIMATE : uint8_t
{
	WUKONG_ULTIMATE_INACTIVE       = 0,
	WUKONG_ULTIMATE_BUILDUP        = 1,
	WUKONG_ULTIMATE_LEAPBACK       = 2,
	WUKONG_ULTIMATE_EAT            = 3,
	WUKONG_ULTIMATE_ATTACK         = 4,
	WUKONG_ULTIMATE_CANCEL         = 5,
	WUKONG_ULTIMATE_DEATH          = 6,
	WUKONG_ULTIMATE_MAX            = 7
};


// Enum TgGame.TgPawn_SunWukong.WUKONG_TRANSFORM
enum class EWUKONG_TRANSFORM : uint8_t
{
	WUKONG_TRANSFORM_SELF          = 0,
	WUKONG_TRANSFORM_EAGLE         = 1,
	WUKONG_TRANSFORM_TIGER         = 2,
	WUKONG_TRANSFORM_OX            = 3,
	WUKONG_TRANSFORM_MAX           = 4
};


// Enum TgGame.TgDevice_Susano_Dev3.ESusanoDev3State
enum class ESusanoDev3State : uint8_t
{
	SusanoWindState_Inactive       = 0,
	SusanoWindState_ProjFired      = 1,
	SusanoWindState_WaitForTeleport = 2,
	SusanoWindState_MAX            = 3
};


// Enum TgGame.TgDevice_Terra_CrushingShale.ETerraDev3State
enum class ETerraDev3State : uint8_t
{
	TerraDev3State_Inactive        = 0,
	TerraDev3State_Deploying       = 1,
	TerraDev3State_SingleDeployed  = 2,
	TerraDev3State_Deployed        = 3,
	TerraDev3State_Crush           = 4,
	TerraDev3State_WallDestroyed   = 5,
	TerraDev3State_MAX             = 6
};


// Enum TgGame.TgDevice_XingTian_AxeSweepShieldBash.EXingAttackState
enum class EXingAttackState : uint8_t
{
	ATTACK_INACTIVE                = 0,
	ATTACK_SWEEP                   = 1,
	ATTACK_BASH                    = 2,
	ATTACK_MAX                     = 3
};


// Enum TgGame.TgDevice_Yemoja_A03.EYemojaRiptideOrientation
enum class EYemojaRiptideOrientation : uint8_t
{
	YRO_Forwards                   = 0,
	YRO_Backwards                  = 1,
	YRO_MAX                        = 2
};


// Enum TgGame.TgDevice_Zeus_SuperLightningBolt.ELightningBoltState
enum class ELightningBoltState : uint8_t
{
	LBS_Normal                     = 0,
	LBS_ProjectileOut              = 1,
	LBS_PostProjectile             = 2,
	LBS_MAX                        = 3
};


// Enum TgGame.TgDeviceFire.DeviceTargeterType
enum class EDeviceTargeterType : uint8_t
{
	TGDTT_None                     = 0,
	TGDTT_Self                     = 1,
	TGDTT_Friend                   = 2,
	TGDTT_Enemy                    = 3,
	TGDTT_Enemy_And_Self           = 4,
	TGDTT_Friend_Only              = 5,
	TGDTT_Not_Self                 = 6,
	TGDTT_All                      = 7,
	TGDTT_MAX                      = 8
};


// Enum TgGame.TgDeviceFire.ESweepType
enum class ESweepType : uint8_t
{
	Sweep_Static                   = 0,
	Sweep_Rotating                 = 1,
	Sweep_Moving                   = 2,
	Sweep_MAX                      = 3
};


// Enum TgGame.TgPawn_Artio.EArtioStances
enum class EArtioStances : uint8_t
{
	EArtioStances_Druid            = 0,
	EArtioStances_Bear             = 1,
	EArtioStances_MAX              = 2
};


// Enum TgGame.TgDeviceFire_Cerberus_SpawnPet.ESoulGodRanks
enum class ESoulGodRanks : uint8_t
{
	SGR                            = 0,
	SGR01                          = 1,
	SGR02                          = 2,
	SGR03                          = 3,
	SGR04                          = 4,
	SGR_MAX                        = 5
};


// Enum TgGame.TgDeviceFire_DistanceThreshold.DistanceThresholdCheckType
enum class EDistanceThresholdCheckType : uint8_t
{
	DTCT_GreaterThan               = 0,
	DTCT_GreaterOrEqual            = 1,
	DTCT_LessThan                  = 2,
	DTCT_LessOrEqual               = 3,
	DTCT_MAX                       = 4
};


// Enum TgGame.TgRepInfo_Player.LayeredBuffEffects
enum class ELayeredBuffEffects : uint8_t
{
	LBE_MinionFireBuff             = 0,
	LBE_MinionOniFuryBuff          = 1,
	LBE_MAX                        = 2
};


// Enum TgGame.TgRepInfo_Player.DEVICE_STATS
enum class EDEVICE_STATS : uint8_t
{
	DS_ID                          = 0,
	DS_DAMAGE                      = 1,
	DS_HEALING                     = 2,
	DS_PLAYER_KILLS                = 3,
	DS_BOT_KILLS                   = 4,
	DS_DPM                         = 5,
	DS_HPM                         = 6,
	DS_MODE_COUNT                  = 7,
	DS_BUFF_VALUE                  = 8,
	DS_MAX                         = 9
};


// Enum TgGame.TgRepInfo_Player.GAME_SCORE_TYPE
enum class EGAME_SCORE_TYPE : uint8_t
{
	GSTYPE_FLAG_CAPTURES           = 0,
	GSTYPE_FLAG_RETURNS            = 1,
	GSTYPE_FLAG_CARRIER_KILLS      = 2,
	GSTYPE_FLAG_FLAG_PICKUPS       = 3,
	GSTYPE_FLAG_CARRY_TIME         = 4,
	GSTYPE_FLAG_MAX                = 5
};


// Enum TgGame.TgRepInfo_Player.SCORE_TYPE
enum class ESCORE_TYPE : uint8_t
{
	STYPE_REPPTS                   = 0,
	STYPE_KILLS                    = 1,
	STYPE_ASSISTS                  = 2,
	STYPE_DAMAGETAKEN              = 3,
	STYPE_DAMAGE                   = 4,
	STYPE_BUFFVALUE                = 5,
	STYPE_HEALING                  = 6,
	STYPE_DEFENSE                  = 7,
	STYPE_DEATHS                   = 8,
	STYPE_OBJS                     = 9,
	STYPE_KILLS_BOT                = 10,
	STYPE_EARNED_XP                = 11,
	STYPE_EARNED_GOLD              = 12,
	STYPE_CURRENT_GOLD             = 13,
	STYPE_GOLD_PER_MIN             = 14,
	STYPE_XP_PER_MIN               = 15,
	STYPE_PLAYER_DMG               = 16,
	STYPE_BOT_DMG                  = 17,
	STYPE_STRUCT_DMG               = 18,
	STYPE_OBJ_ASSISTS              = 19,
	STYPE_WARDS_PLACED             = 20,
	STYPE_TIME_DEAD                = 21,
	STYPE_DMG_MITIGATED            = 22,
	STYPE_MAX                      = 23
};


// Enum TgGame.TgRatatoskrAcorn.EAcornType
enum class EAcornType : uint8_t
{
	ACORN_None                     = 0,
	ACORN_White                    = 1,
	ACORN_Blue                     = 2,
	ACORN_Yellow                   = 3,
	ACORN_Sapphire                 = 4,
	ACORN_Emerald                  = 5,
	ACORN_Opal                     = 6,
	ACORN_Topaz                    = 7,
	ACORN_Lively                   = 8,
	ACORN_Evergreen                = 9,
	ACORN_Thickbark                = 10,
	ACORN_Nettle                   = 11,
	ACORN_Bristlebush              = 12,
	ACORN_Thistlethorn             = 13,
	ACORN_MAX                      = 14
};


// Enum TgGame.TgDeviceForm_Cerberus_Dev2.CerberusHeadsDevForm2
enum class ECerberusHeadsDevForm2 : uint8_t
{
	CHDF2_Middle                   = 0,
	CHDF2_Left                     = 1,
	CHDF2_Right                    = 2,
	CHDF2_Fill                     = 3,
	CHDF2_MAX                      = 4
};


// Enum TgGame.TgDeviceForm_Thoth_Dash.EThothDashTargetingMode
enum class EThothDashTargetingMode : uint8_t
{
	EThothDashTargetingMode_NormalDash = 0,
	EThothDashTargetingMode_BonusDash = 1,
	EThothDashTargetingMode_NoDash = 2,
	EThothDashTargetingMode_MAX    = 3
};


// Enum TgGame.TgDeviceVolume.VolumeMapVisibilityType
enum class EVolumeMapVisibilityType : uint8_t
{
	VMVT_Default                   = 0,
	VMVT_Special01                 = 1,
	VMVT_Special02                 = 2,
	VMVT_Special03                 = 3,
	VMVT_MAX                       = 4
};


// Enum TgGame.TgDeviceVolume.VolumeMiniMapType
enum class EVolumeMiniMapType : uint8_t
{
	VMMT_Pyro                      = 0,
	VMMT_REPLACE_ME                = 1,
	VMMT_MAX                       = 2
};


// Enum TgGame.TgDistributionFloatSoundAttenuation.SoundAttenuationType
enum class ESoundAttenuationType : uint8_t
{
	TG_ATTENUATION_None            = 0,
	TG_ATTENUATION_Sm_foley        = 1,
	TG_ATTENUATION_Lg_foley        = 2,
	TG_ATTENUATION_Melee_Hit       = 3,
	TG_ATTENUATION_Sm_gun          = 4,
	TG_ATTENUATION_Med_gun         = 5,
	TG_ATTENUATION_Lg_gun          = 6,
	TG_ATTENUATION_Sm_exp          = 7,
	TG_ATTENUATION_Med_exp         = 8,
	TG_ATTENUATION_Lg_exp          = 9,
	TG_ATTENUATION_MAX             = 10
};


// Enum TgGame.TgDominantDirectionalLightSwitchableComponent.SwitchableDominantLightMode
enum class ESwitchableDominantLightMode : uint8_t
{
	SDLM_Unset                     = 0,
	SDLM_Dynamic                   = 1,
	SDLM_DominantDynamic           = 2,
	SDLM_MAX                       = 3
};


// Enum TgGame.TgDoorMarker.DoorStatus
enum class EDoorStatus : uint8_t
{
	TGD_NONE                       = 0,
	TGD_LOCKED                     = 1,
	TGD_OPEN                       = 2,
	TGD_CLOSE                      = 3,
	TGD_MAX                        = 4
};


// Enum TgGame.TgEffectForm_BuffBelt.EBuffBeltPriority
enum class EBuffBeltPriority : uint8_t
{
	BBP_Default                    = 0,
	BBP_Debuff                     = 1,
	BBP_InstigatorBuff             = 2,
	BBP_MAX                        = 3
};


// Enum TgGame.TgEffectForm_Depthzy_SBreak.SBreakMicState
enum class ESBreakMicState : uint8_t
{
	SBMS_Active                    = 0,
	SBMS_FadingOut                 = 1,
	SBMS_Removed                   = 2,
	SBMS_MAX                       = 3
};


// Enum TgGame.TgPawn_Cerberus_Soul.ECerberusSoul
enum class ECerberusSoul : uint8_t
{
	SOUL_DAMAGE                    = 0,
	SOUL_HEAL                      = 1,
	SOUL_MAX                       = 2
};


// Enum TgGame.TgPawn_Cerberus_Soul.ESoulFXSet
enum class ESoulFXSet : uint8_t
{
	SFXS_Owner                     = 0,
	SFXS_Connected                 = 1,
	SFXS_Unconnected               = 2,
	SFXS_MAX                       = 3
};


// Enum TgGame.TgEffectGroup.AttackType
enum class EAttackType : uint8_t
{
	TGAT_None                      = 0,
	TGAT_Melee                     = 1,
	TGAT_Range                     = 2,
	TGAT_AOE                       = 3,
	TGAT_Falling                   = 4,
	TGAT_MAX                       = 5
};


// Enum TgGame.TgEffectManager.ERevealType
enum class ERevealType : uint8_t
{
	REVEAL_GLOBAL                  = 0,
	REVEAL_TEAM                    = 1,
	REVEAL_INSTIGATOR              = 2,
	REVEAL_INSTIGATOR_NO_PING      = 3,
	REVEAL_MAX                     = 4
};


// Enum TgGame.TgEffectParameterTransition.EffectParameterTransitionRepeatStrategy
enum class EffectParameterTransitionRepeatStrategy : uint8_t
{
	EPTRS_Loop                     = 0,
	EPTRS_Oscillate                = 1,
	EPTRS_MAX                      = 2
};


// Enum TgGame.TgFlagContentData.FlagContentDataType
enum class EFlagContentDataType : uint8_t
{
	FCDT_None                      = 0,
	FCDT_Egyptian_Lobby            = 1,
	FCDT_Egyptian_Wall             = 2,
	FCDT_Norse_Lobby               = 3,
	FCDT_Norse_Wall                = 4,
	FCDT_Greek_Lobby               = 5,
	FCDT_Greek_Wall                = 6,
	FCDT_Roman_Lobby               = 7,
	FCDT_Roman_Wall                = 8,
	FCDT_Chinese_Lobby             = 9,
	FCDT_Chinese_Wall              = 10,
	FCDT_Mayan_Lobby               = 11,
	FCDT_Mayan_Wall                = 12,
	FCDT_Hindu_Lobby               = 13,
	FCDT_Hindu_Wall                = 14,
	FCDT_Japanese_Lobby            = 15,
	FCDT_Japanese_Wall             = 16,
	FCDT_Celtic_Lobby              = 17,
	FCDT_Celtic_Wall               = 18,
	FCDT_Slavic_Lobby              = 19,
	FCDT_Slavic_Wall               = 20,
	FCDT_Voodoo_Lobby              = 21,
	FCDT_Voodoo_Wall               = 22,
	FCDT_Polynesian_Lobby          = 23,
	FCDT_Polynesian_Wall           = 24,
	FCDT_Arthurian_Lobby           = 25,
	FCDT_Arthurian_Wall            = 26,
	FCDT_Yoruba_Lobby              = 27,
	FCDT_Yoruba_Wall               = 28,
	FCDT_GreatOldOnes_Lobby        = 29,
	FCDT_GreatOldOnes_Wall         = 30,
	FCDT_MAX                       = 31
};


// Enum TgGame.TgRepInfo_Game.MAP_LANE
enum class EMAP_LANE : uint8_t
{
	MAP_LANE_NONE                  = 0,
	MAP_LANE_LEFT                  = 1,
	MAP_LANE_MIDDLE                = 2,
	MAP_LANE_RIGHT                 = 3,
	MAP_LANE_MAX                   = 4
};


// Enum TgGame.TgRepInfo_Game.MissionTimerState
enum class EMissionTimerState : uint8_t
{
	MTS_STOPPED                    = 0,
	MTS_RUNNING                    = 1,
	MTS_PAUSED                     = 2,
	MTS_MAX                        = 3
};


// Enum TgGame.TgRepInfo_Game.EFlagState
enum class EFlagState : uint8_t
{
	FLAG_Home                      = 0,
	FLAG_HeldFriendly              = 1,
	FLAG_HeldEnemy                 = 2,
	FLAG_Down                      = 3,
	FLAG_MAX                       = 4
};


// Enum TgGame.TgGame_Mission.PauseMode
enum class EPauseMode : uint8_t
{
	TGPM_None                      = 0,
	TGPM_Default                   = 1,
	TGPM_Vote                      = 2,
	TGPM_Free                      = 3,
	TGPM_MAX                       = 4
};


// Enum TgGame.TgGame_Battle_Adventure.EAdventureLootType
enum class EAdventureLootType : uint8_t
{
	ALT_Gear                       = 0,
	ALT_Currency                   = 1,
	ALT_Deployable                 = 2,
	ALT_CampItem                   = 3,
	ALT_MAX                        = 4
};


// Enum TgGame.TgGame_Battle_CTF.CTFMessageEvent
enum class ECTFMessageEvent : uint8_t
{
	TG_CTFME_CAPTURE               = 0,
	TG_CTFME_PICKUP                = 1,
	TG_CTFME_DROP                  = 2,
	TG_CTFME_RESET                 = 3,
	TG_CTFME_RETURN                = 4,
	TG_CTFME_LEAD_GAIN             = 5,
	TG_CTFME_LEAD_LOSS             = 6,
	TG_CTFME_GAME_OVER             = 7,
	TG_CTFME_OVERTIME              = 8,
	TG_CTFME_MAX                   = 9
};


// Enum TgGame.TgGame_Battle_CTF.CTFStatEvent
enum class ECTFStatEvent : uint8_t
{
	TG_CTFSE_FLAG_PICKUP           = 0,
	TG_CTFSE_FLAG_TIME             = 1,
	TG_CTFSE_FLAG_CAP              = 2,
	TG_CTFSE_CARRIER_KILLED        = 3,
	TG_CTFSE_FLAG_RETURNED         = 4,
	TG_CTFSE_MELEE_KILL            = 5,
	TG_CTFSE_MAX                   = 6
};


// Enum TgGame.TgGame_Battle_Encounters.ERoundState
enum class ERoundState : uint8_t
{
	BERS_Purchasing                = 0,
	BERS_Transition                = 1,
	BERS_Active                    = 2,
	BERS_Pass                      = 3,
	BERS_Fail                      = 4,
	BERS_MAX                       = 5
};


// Enum TgGame.TgGame_Battle_Round.BattleRoundState
enum class EBattleRoundState : uint8_t
{
	BRS_ResetLocation              = 0,
	BRS_ResetDevices               = 1,
	BRS_Setup                      = 2,
	BRS_Active                     = 3,
	BRS_WindDown                   = 4,
	BRS_Over                       = 5,
	BRS_MAX                        = 6
};


// Enum TgGame.TgGame_Battle_Siege2.SIEGE2_BATTLE_PHASE
enum class ESIEGE2_BATTLE_PHASE : uint8_t
{
	SBP_DAY                        = 0,
	SBP_NIGHT                      = 1,
	SBP_MAX                        = 2
};


// Enum TgGame.TgGame_MultiRounds.EGameMultiRoundState
enum class EGameMultiRoundState : uint8_t
{
	GMRS_ItemStore                 = 0,
	GMRS_RoundSetup                = 1,
	GMRS_RoundActive               = 2,
	GMRS_RoundInactive             = 3,
	GMRS_RoundReset                = 4,
	GMRS_Complete                  = 5,
	GMRS_MAX                       = 6
};


// Enum TgGame.TgGameConfig_MultiRounds.EXpPurchaseType
enum class EXpPurchaseType : uint8_t
{
	EXPT_Levels                    = 0,
	EXPT_FlatXp                    = 1,
	EXPT_XpPerc                    = 2,
	EXPT_MAX                       = 3
};


// Enum TgGame.TgGameConfig_MultiRounds.ERoundStoreType
enum class ERoundStoreType : uint8_t
{
	ERST_Random                    = 0,
	ERST_TeamDraft                 = 1,
	ERST_MAX                       = 2
};


// Enum TgGame.TgInventory_RandomizedShop.RandomizedShopItemTier
enum class ERandomizedShopItemTier : uint8_t
{
	RSIT_Tier1                     = 0,
	RSIT_Tier2                     = 1,
	RSIT_Tier3                     = 2,
	RSIT_MAX                       = 3
};


// Enum TgGame.TgRepInfo_Player_BotShop.EBotStoreReplicationType
enum class EBotStoreReplicationType : uint8_t
{
	EBSRT_Bots                     = 0,
	EBSRT_MAX                      = 1
};


// Enum TgGame.TgRepInfo_Player_BotShop.EBotInventoryReplicationType
enum class EBotInventoryReplicationType : uint8_t
{
	EBIRT_BotsActive               = 0,
	EBIRT_BotsInactive             = 1,
	EBIRT_BotsEffect               = 2,
	EBIRT_ShopUpdate               = 3,
	EBIRT_MAX                      = 4
};


// Enum TgGame.TgInventoryManager.PendingTransactionType
enum class EPendingTransactionType : uint8_t
{
	PTT_None                       = 0,
	PTT_Purchase                   = 1,
	PTT_Upgrade                    = 2,
	PTT_Sell                       = 3,
	PTT_UpgradeRetry               = 4,
	PTT_Swap                       = 5,
	PTT_MAX                        = 6
};


// Enum TgGame.TgInventoryObject.EReplicatedState
enum class EReplicatedState : uint8_t
{
	IORS_Ok                        = 0,
	IORS_Edited                    = 1,
	IORS_Deleted                   = 2,
	IORS_MAX                       = 3
};


// Enum TgGame.TgInventoryObject_Listen_AhMuzenCabBees.EBeesApplyType
enum class EBeesApplyType : uint8_t
{
	BEES_Default                   = 0,
	BEES_BasicAttack               = 1,
	BEES_BasicAttackStrain         = 2,
	BEES_MAX                       = 3
};


// Enum TgGame.TgInventoryObject_Listen_BastetPassive.BastetPSVTravelState
enum class EBastetPSVTravelState : uint8_t
{
	BTS_IsTraveling                = 0,
	BTS_WasTraveling               = 1,
	BTS_MAX                        = 2
};


// Enum TgGame.TgInventoryObject_Listen_DeviceCooldown.EDeviceTypeCooldown
enum class EDeviceTypeCooldown : uint8_t
{
	EDTC_Movement                  = 0,
	EDTC_Offhands                  = 1,
	EDTC_Relics                    = 2,
	EDTC_MAX                       = 3
};


// Enum TgGame.TgInventoryObject_Listen_DeviceCooldown.EDeviceCooldownType
enum class EDeviceCooldownType : uint8_t
{
	EDCT_Flat                      = 0,
	EDCT_Percent                   = 1,
	EDCT_MAX                       = 2
};


// Enum TgGame.TgInventoryObject_Listen_SuccessfulHit.EDeviceSuccessfulHitType
enum class EDeviceSuccessfulHitType : uint8_t
{
	SUCCESSFULHIT_PER_TICK         = 0,
	SUCCESSFULHIT_PER_FIRE         = 1,
	SUCCESSFULHIT_PER_MAX          = 2
};


// Enum TgGame.TgPawn_Yemoja.EYemojaPassiveObjectiveTiers
enum class EYemojaPassiveObjectiveTiers : uint8_t
{
	YPOT_MANA_T1                   = 0,
	YPOT_LEVEL_T1                  = 1,
	YPOT_LEVEL_T2                  = 2,
	YPOT_MAX                       = 3
};


// Enum TgGame.TgPawn_Yemoja.EYemojaStance
enum class EYemojaStance : uint8_t
{
	YS_Bubbles                     = 0,
	YS_Crystal                     = 1,
	YS_MAX                         = 2
};


// Enum TgGame.TgLevelStreamingSpectator.SpectatorStreamingMethod
enum class ESpectatorStreamingMethod : uint8_t
{
	SSM_OnlyLoadIfSpectating       = 0,
	SSM_OnlyLoadIfNotSpectating    = 1,
	SSM_AlwaysLoad                 = 2,
	SSM_MAX                        = 3
};


// Enum TgGame.TgMapTracker_Depthzy_IState.DepthzyMapFlags
enum class EDepthzyMapFlags : uint8_t
{
	DMF_PlayArea                   = 0,
	DMF_Interior                   = 1,
	DMF_MAX                        = 2
};


// Enum TgGame.TgMenuContentData.MenuContentDataType
enum class EMenuContentDataType : uint8_t
{
	MCDT_None                      = 0,
	MCDT_Login                     = 1,
	MCDT_Login2                    = 2,
	MCDT_Login3                    = 3,
	MCDT_MainMenu                  = 4,
	MCDT_MainMenu_Featured         = 5,
	MCDT_MainMenu_Featured01       = 6,
	MCDT_MainMenu_Featured02       = 7,
	MCDT_MainMenu_Featured03       = 8,
	MCDT_MainMenu_Featured04       = 9,
	MCDT_MainMenu_Featured05       = 10,
	MCDT_MainMenu_BetaPromo        = 11,
	MCDT_MainMenu_GodPack          = 12,
	MCDT_MainMenu_FacebookPromo    = 13,
	MCDT_MainMenu_TwitterPromo     = 14,
	MCDT_MainMenu_NewPlayer_Feature = 15,
	MCDT_MainMenu_NewPlayer_Feature01 = 16,
	MCDT_MainMenu_NewPlayer_Feature02 = 17,
	MCDT_Play                      = 18,
	MCDT_Store                     = 19,
	MCDT_Social_Friends            = 20,
	MCDT_Social_Followers          = 21,
	MCDT_Social_Blocked            = 22,
	MCDT_Settings                  = 23,
	MCDT_Lobby                     = 24,
	MCDT_Home                      = 25,
	MCDT_MAX                       = 26
};


// Enum TgGame.TgNavRouteIndicator.eSetRouteResult
enum class EeSetRouteResult : uint8_t
{
	SetRoute_Failed                = 0,
	SetRoute_OK                    = 1,
	SetRoute_AtDestination         = 2,
	SetRoute_MAX                   = 3
};


// Enum TgGame.TgOwnedPlaceableMesh.OwnedMeshSkinType
enum class EOwnedMeshSkinType : uint8_t
{
	OBST_Fountain                  = 0,
	OBST_Configurable              = 1,
	OBST_MAX                       = 2
};


// Enum TgGame.TgPawn_Adv_Cart.AdvCartTowerState
enum class EAdvCartTowerState : uint8_t
{
	ACTS_Dead                      = 0,
	ACTS_Tier1                     = 1,
	ACTS_Tier2                     = 2,
	ACTS_Tier3                     = 3,
	ACTS_MaxHealth                 = 4,
	ACTS_MAX                       = 5
};


// Enum TgGame.TgPawn_Adv_Cart.AdvCartFoxState
enum class EAdvCartFoxState : uint8_t
{
	ACFS_Moving                    = 0,
	ACFS_StoppedImmune             = 1,
	ACFS_StoppedVulnerable         = 2,
	ACFS_MAX                       = 3
};


// Enum TgGame.TgPawn_AoKuang.EAoKuangUltimateState
enum class EAoKuangUltimateState : uint8_t
{
	AO_ULT_NORMAL                  = 0,
	AO_ULT_DASH                    = 1,
	AO_ULT_NORMALSTUN              = 2,
	AO_ULT_MEGAKILLSTUN            = 3,
	AO_ULT_DRAGONBUILDUP           = 4,
	AO_ULT_DRAGONACTIVE            = 5,
	AO_ULT_DRAGONTAKEDOWN          = 6,
	AO_ULT_DRAGONCANCEL            = 7,
	AO_ULT_DRAGONDEAD              = 8,
	AO_ULT_MAX                     = 9
};


// Enum TgGame.TgPawn_AoKuang.EDragonBushelState
enum class EDragonBushelState : uint8_t
{
	BUSHEL                         = 0,
	BUSHEL01                       = 1,
	BUSHEL02                       = 2,
	BUSHEL03                       = 3,
	BUSHEL04                       = 4,
	BUSHEL05                       = 5,
	BUSHEL06                       = 6,
	BUSHEL_DISSIPATE               = 7,
	BUSHEL_COMBINE                 = 8,
	BUSHEL_MAX                     = 9
};


// Enum TgGame.TgPawn_AoKuang.AOKUANG_TRANSFORM
enum class EAOKUANG_TRANSFORM : uint8_t
{
	AOFORM_NORMAL                  = 0,
	AOFORM_DRAGON                  = 1,
	AOFORM_MAX                     = 2
};


// Enum TgGame.TgPawn_ArachneV2.EArachneUltState
enum class EArachneUltState : uint8_t
{
	ARACHNE_ULT_NORMAL             = 0,
	ARACHNE_ULT_BUILDUP            = 1,
	ARACHNE_ULT_MAIN               = 2,
	ARACHNE_ULT_FIRED              = 3,
	ARACHNE_ULT_LANDED             = 4,
	ARACHNE_ULT_CANCELLED          = 5,
	ARACHNE_ULT_DIED               = 6,
	ARACHNE_ULT_MAX                = 7
};


// Enum TgGame.TgPawn_WiseCleric.EDestroyAnimStages
enum class EDestroyAnimStages : uint8_t
{
	TowerDestruction_FullHealth_Idle = 0,
	TowerDestruction_FirstDestruction = 1,
	TowerDestruction_SecondDestruction = 2,
	TowerDestruction_MAX           = 3
};


// Enum TgGame.TgPawn_Athena.LeapingLungeState
enum class ELeapingLungeState : uint8_t
{
	LEAPINGLUNGE_INACTIVE          = 0,
	LEAPINGLUNGE_ACTIVE            = 1,
	LEAPINGLUNGE_HITTARGET         = 2,
	LEAPINGLUNGE_MAX               = 3
};


// Enum TgGame.TgPawn_Awilix.eMoonlightState
enum class EeMoonlightState : uint8_t
{
	EML_UNBUFFED                   = 0,
	EML_BUFFED                     = 1,
	EML_MAX                        = 2
};


// Enum TgGame.TgPawn_Awilix.eStarlightLanceState
enum class EeStarlightLanceState : uint8_t
{
	ESL_NONE                       = 0,
	ESL_NORMAL                     = 1,
	ESL_KNOCKUP                    = 2,
	ESL_MAX                        = 3
};


// Enum TgGame.TgPawn_Awilix.eMountState
enum class EeMountState : uint8_t
{
	EMS_NONE                       = 0,
	EMS_MOUNTED                    = 1,
	EMS_LEAP                       = 2,
	EMS_CANCEL                     = 3,
	EMS_MAX                        = 4
};


// Enum TgGame.TgPawn_BabaYaga_Hut.BabaYagaHutState
enum class EBabaYagaHutState : uint8_t
{
	BYHS_Active                    = 0,
	BYHS_Idle                      = 1,
	BYHS_Ulting                    = 2,
	BYHS_MAX                       = 3
};


// Enum TgGame.TgPawn_BabaYaga_Hut.BabaYagaHutA04FireType
enum class EBabaYagaHutA04FireType : uint8_t
{
	BYH4F_FireA                    = 0,
	BYH4F_FireB                    = 1,
	BYH4F_FireC                    = 2,
	BYH4F_FireD                    = 3,
	BYH4F_MAX                      = 4
};


// Enum TgGame.TgPawn_Bacchus.TgPawn_Bacchus_DrunkType
enum class ETgPawn_Bacchus_DrunkType : uint8_t
{
	TGPBDT_THIRSTY                 = 0,
	TGPBDT_TIPSY                   = 1,
	TGPBDT_SMASHED                 = 2,
	TGPBDT_MAX                     = 3
};


// Enum TgGame.TgPawn_BaronSamedi.EBaronCross
enum class EBaronCross : uint8_t
{
	BARON_CROSS_Left               = 0,
	BARON_CROSS_Right              = 1,
	BARON_CROSS_MAX                = 2
};


// Enum TgGame.TgPawn_BaronSamedi.EBaronCoffin
enum class EBaronCoffin : uint8_t
{
	BARON_COFFIN_None              = 0,
	BARON_COFFIN_Intro             = 1,
	BARON_COFFIN_Loop              = 2,
	BARON_COFFIN_OutroMiss         = 3,
	BARON_COFFIN_OutroHit          = 4,
	BARON_COFFIN_MAX               = 5
};


// Enum TgGame.TgPawn_BaronSamediSkin.EBaronSamediSkinState
enum class EBaronSamediSkinState : uint8_t
{
	BSSS_Hunter                    = 0,
	BSSS_Hybrid                    = 1,
	BSSS_Horror                    = 2,
	BSSS_MAX                       = 3
};


// Enum TgGame.TgPawn_Camazotz.ECamazotzUltState
enum class ECamazotzUltState : uint8_t
{
	CAM_ULT_NORMAL                 = 0,
	CAM_ULT_BUILDUP                = 1,
	CAM_ULT_MAIN                   = 2,
	CAM_ULT_TAKEDOWN               = 3,
	CAM_ULT_DIED                   = 4,
	CAM_ULT_MAX                    = 5
};


// Enum TgGame.TgPawn_Camazotz.ECamazotzWeaponType
enum class ECamazotzWeaponType : uint8_t
{
	CAM_WT_MELEE                   = 0,
	CAM_WT_ULTIMATE                = 1,
	CAM_WT_MAX                     = 2
};


// Enum TgGame.TgPawn_SoloObjective.SoloObjectiveHitDirection
enum class ESoloObjectiveHitDirection : uint8_t
{
	SOHD_None                      = 0,
	SOHD_HitFromFront              = 1,
	SOHD_HitFromBack               = 2,
	SOHD_HitFromLeft               = 3,
	SOHD_HitFromRight              = 4,
	SOHD_MAX                       = 5
};


// Enum TgGame.TgPawn_ChaacSkin.ChaacKillAssistEvolutionStates
enum class EChaacKillAssistEvolutionStates : uint8_t
{
	CKAES_Stage0                   = 0,
	CKAES_Stage1                   = 1,
	CKAES_Stage2                   = 2,
	CKAES_Stage3                   = 3,
	CKAES_MAX                      = 4
};


// Enum TgGame.TgPawn_ChaacSkin.ChaacSkinStates
enum class EChaacSkinStates : uint8_t
{
	CSS_Priest                     = 0,
	CSS_Optimism                   = 1,
	CSS_Passion                    = 2,
	CSS_Rage                       = 3,
	CSS_MAX                        = 4
};


// Enum TgGame.TgPawn_CuChulainn.CuChulainnFerocityLevel
enum class ECuChulainnFerocityLevel : uint8_t
{
	LEVEL1                         = 0,
	LEVEL2                         = 1,
	LEVEL3                         = 2,
	CuChulainnFerocityLevel_MAX    = 3
};


// Enum TgGame.TgPawn_Fenrir.EBiteState
enum class EBiteState : uint8_t
{
	BITE_None                      = 0,
	BITE_Grow                      = 1,
	BITE_BeforeGrab                = 2,
	BITE_Grab                      = 3,
	BITE_Throwdown                 = 4,
	BITE_Shrink                    = 5,
	BITE_MAX                       = 6
};


// Enum TgGame.TgPawn_Geb.GebBoulderState
enum class EGebBoulderState : uint8_t
{
	GBS_Normal                     = 0,
	GBS_Boulder                    = 1,
	GBS_BoulderHit                 = 2,
	GBS_MAX                        = 3
};


// Enum TgGame.TgPawn_God95.EGod95UltState
enum class EGod95UltState : uint8_t
{
	God95_ULT_NORMAL               = 0,
	God95_ULT_BUILDUP              = 1,
	God95_ULT_TARGETING            = 2,
	God95_ULT_FIRING_INTRO         = 3,
	God95_ULT_FIRING_LOOP          = 4,
	God95_ULT_FIRING_OUTRO         = 5,
	God95_ULT_MAX                  = 6
};


// Enum TgGame.TgPawn_GuanYuV2.GuanYuPassiveState
enum class EGuanYuPassiveState : uint8_t
{
	GYPS_Inactive                  = 0,
	GYPS_Active                    = 1,
	GYPS_Warning                   = 2,
	GYPS_MAX                       = 3
};


// Enum TgGame.TgPawn_GuanYuV2.GuanYuUltPhase
enum class EGuanYuUltPhase : uint8_t
{
	GUANYUV2_UltNone               = 0,
	GUANYUV2_UltPhase1             = 1,
	GUANYUV2_UltPhase2             = 2,
	GUANYUV2_MAX                   = 3
};


// Enum TgGame.TgPawn_Guardian.EThroneState
enum class EThroneState : uint8_t
{
	THRONE_ONTHRONE                = 0,
	THRONE_TRANSITIONING           = 1,
	THRONE_OFFTHRONE               = 2,
	THRONE_MAX                     = 3
};


// Enum TgGame.TgPawn_Hachiman.HachimanUltHorsePhase
enum class EHachimanUltHorsePhase : uint8_t
{
	HACHIMAN_HorseIn               = 0,
	HACHIMAN_HorseRiding           = 1,
	HACHIMAN_HorseOut              = 2,
	HACHIMAN_HorseNone             = 3,
	HACHIMAN_MAX                   = 4
};


// Enum TgGame.TgPawn_HelV3.HEL_STANCE
enum class EHEL_STANCE : uint8_t
{
	HEL_STANCE_DARK                = 0,
	HEL_STANCE_LIGHT               = 1,
	HEL_STANCE_INVALID             = 2,
	HEL_STANCE_MAX                 = 3
};


// Enum TgGame.TgPawn_HelV3Skin.HelSkinState
enum class EHelSkinState : uint8_t
{
	HSS_Base                       = 0,
	HSS_Evolved                    = 1,
	HSS_MAX                        = 2
};


// Enum TgGame.TgPawn_JingWei.TGJingWeiDev4Phase
enum class ETGJingWeiDev4Phase : uint8_t
{
	TGJingWeiDev4Phase_Inactive    = 0,
	TGJingWeiDev4Phase_Buildup     = 1,
	TGJingWeiDev4Phase_Charge      = 2,
	TGJingWeiDev4Phase_Floating    = 3,
	TGJingWeiDev4Phase_Landing     = 4,
	TGJingWeiDev4Phase_MAX         = 5
};


// Enum TgGame.TgPawn_Jormungandr.EJormungandrShakeState
enum class EJormungandrShakeState : uint8_t
{
	JORM_SHAKE_EMERGE              = 0,
	JORM_SHAKE_SUBMERGE            = 1,
	JORM_SHAKE_MAX                 = 2
};


// Enum TgGame.TgPawn_Jormungandr.EJormungandrUltimateState
enum class EJormungandrUltimateState : uint8_t
{
	JORM_ULT_NONE                  = 0,
	JORM_ULT_BUILDUP               = 1,
	JORM_ULT_MAIN                  = 2,
	JORM_ULT_TAKEDOWN              = 3,
	JORM_ULT_DIED                  = 4,
	JORM_ULT_MAX                   = 5
};


// Enum TgGame.TgPawn_Jormungandr.EJomungandrSubmergeState
enum class EJomungandrSubmergeState : uint8_t
{
	JORM_DEV3_NONE                 = 0,
	JORM_DEV3_DIVING               = 1,
	JORM_DEV3_SUBMERGED            = 2,
	JORM_DEV3_EMERGING             = 3,
	JORM_DEV3_MAX                  = 4
};


// Enum TgGame.TgPawn_LanePusher.EDestroyedAnimStages
enum class EDestroyedAnimStages : uint8_t
{
	EngineDestruction_FullHealth_Idle = 0,
	EngineDestruction_FirstDestruction = 1,
	EngineDestruction_SecondDestruction = 2,
	EngineDestruction_MAX          = 3
};


// Enum TgGame.TgPawn_Juggernaut.EJuggernautActiveArcher
enum class EJuggernautActiveArcher : uint8_t
{
	ACTIVEARCHER_FRONT             = 0,
	ACTIVEARCHER_BACK              = 1,
	ACTIVEARCHER_MAX               = 2
};


// Enum TgGame.TgPawn_Knight.EKnightUltStance
enum class EKnightUltStance : uint8_t
{
	KUS_A                          = 0,
	KUS_B                          = 1,
	KUS_C                          = 2,
	KUS_MAX                        = 3
};


// Enum TgGame.TgPawn_Knight.EKnightStance
enum class EKnightStance : uint8_t
{
	KS_Normal                      = 0,
	KS_Spartan                     = 1,
	KS_MAX                         = 2
};


// Enum TgGame.TgPawn_Knight.EKnight4BState
enum class EKnight4BState : uint8_t
{
	K4BS_None                      = 0,
	K4BS_FinalSmash                = 1,
	K4BS_MAX                       = 2
};


// Enum TgGame.TgPawn_KukulkanSkin.EWindsOfChangeSkinState
enum class EWindsOfChangeSkinState : uint8_t
{
	WOCSS_Celestial                = 0,
	WOCSS_Life                     = 1,
	WOCSS_Void                     = 2,
	WOCSS_MAX                      = 3
};


// Enum TgGame.TgPawn_NeZha.WindFireWheelsPhase
enum class EWindFireWheelsPhase : uint8_t
{
	WFWP_None                      = 0,
	WFWP_Miss                      = 1,
	WFWP_LiftMiss                  = 2,
	WFWP_SelfDied                  = 3,
	WFWP_Lift                      = 4,
	WFWP_Dash                      = 5,
	WFWP_KnockDown                 = 6,
	WFWP_Landed                    = 7,
	WFWP_TargetEscaped             = 8,
	WFWP_MAX                       = 9
};


// Enum TgGame.TgPawn_NeZha.ArmillarySashPhase
enum class EArmillarySashPhase : uint8_t
{
	ASP_None                       = 0,
	ASP_Throw                      = 1,
	ASP_Hit                        = 2,
	ASP_Miss                       = 3,
	ASP_MAX                        = 4
};


// Enum TgGame.TgPawn_NeZha.NEZHA_PASSIVE_STATE
enum class ENEZHA_PASSIVE_STATE : uint8_t
{
	NPS_OUTOFCOMBAT                = 0,
	NPS_INCOMBAT                   = 1,
	NPS_TRANSITION                 = 2,
	NPS_MAX                        = 3
};


// Enum TgGame.TgPawn_Nike.ENikeUltVisualsState
enum class ENikeUltVisualsState : uint8_t
{
	NIKEULTVISUALS_ACTIVE          = 0,
	NIKEULTVISUALS_INACTIVE        = 1,
	NIKEULTVISUALS_MAX             = 2
};


// Enum TgGame.TgPawn_NuWa.NUWA_FORM
enum class ENUWA_FORM : uint8_t
{
	NUWA_FORM_NORMAL               = 0,
	NUWA_FORM_SNAKE                = 1,
	NUWA_FORM_MAX                  = 2
};


// Enum TgGame.TgPawn_NuWaV2.ENuWaUltState
enum class ENuWaUltState : uint8_t
{
	NUWA_ULT_NORMAL                = 0,
	NUWA_ULT_BUILDUP               = 1,
	NUWA_ULT_MAIN                  = 2,
	NUWA_ULT_TAKEDOWN              = 3,
	NUWA_ULT_DIED                  = 4,
	NUWA_ULT_MAX                   = 5
};


// Enum TgGame.TgPawn_Osiris.EOsirisBodypartsMissing
enum class EOsirisBodypartsMissing : uint8_t
{
	OBM_NONE                       = 0,
	OBM_HAND_LEFT                  = 1,
	OBM_HAND_RIGHT                 = 2,
	OBM_ARM_LEFT                   = 3,
	OBM_ARM_RIGHT                  = 4,
	OBM_LEG_LEFT                   = 5,
	OBM_LEG_RIGHT                  = 6,
	OBM_HEAD                       = 7,
	OBM_CHEST                      = 8,
	OBM_MAX                        = 9
};


// Enum TgGame.TgPawn_Osiris.ESoulTearState
enum class ESoulTearState : uint8_t
{
	STS_None                       = 0,
	STS_HitMinions                 = 1,
	STS_HitGod                     = 2,
	STS_MAX                        = 3
};


// Enum TgGame.TgPawn_Ram.ERamUltState
enum class ERamUltState : uint8_t
{
	RAM_ULT_NORMAL                 = 0,
	RAM_ULT_BUILDUP                = 1,
	RAM_ULT_MAIN                   = 2,
	RAM_ULT_TAKEDOWN               = 3,
	RAM_ULT_DIED                   = 4,
	RAM_ULT_MAX                    = 5
};


// Enum TgGame.TgPawn_Ram.ERamProjectile
enum class ERamProjectile : uint8_t
{
	RIP_DEFAULT                    = 0,
	RIP_QUIVER_TOGGLE              = 1,
	RIP_DODGE_SPECIAL              = 2,
	RIP_MAX                        = 3
};


// Enum TgGame.TgPawn_Ratatoskr.ERatatoskrUltimateState
enum class ERatatoskrUltimateState : uint8_t
{
	RATULT_None                    = 0,
	RATULT_Targeting               = 1,
	RATULT_Buildup                 = 2,
	RATULT_Climb                   = 3,
	RATULT_TreeHopping             = 4,
	RATULT_Takedown                = 5,
	RATULT_DiedTree                = 6,
	RATULT_DiedFlying              = 7,
	RATULT_MAX                     = 8
};


// Enum TgGame.TgPawn_Scylla.EScyllaUltimateState
enum class EScyllaUltimateState : uint8_t
{
	SCYLLAULT_Normal               = 0,
	SCYLLAULT_Buildup              = 1,
	SCYLLAULT_Active               = 2,
	SCYLLAULT_Takedown             = 3,
	SCYLLAULT_DieInUlt             = 4,
	SCYLLAULT_MAX                  = 5
};


// Enum TgGame.TgPawn_Thanatos.HoveringDeathState
enum class EHoveringDeathState : uint8_t
{
	HOVERINGDEATH_INACTIVE         = 0,
	HOVERINGDEATH_GROUNDBUILDUP    = 1,
	HOVERINGDEATH_RISING           = 2,
	HOVERINGDEATH_INAIR            = 3,
	HOVERINGDEATH_DASH             = 4,
	HOVERINGDEATH_GROUNDDEATH      = 5,
	HOVERINGDEATH_AIRDEATH         = 6,
	HOVERINGDEATH_MAX              = 7
};


// Enum TgGame.TgPawn_Tyr.ETyrStance
enum class ETyrStance : uint8_t
{
	TYR_STANCE_Aggressive          = 0,
	TYR_STANCE_Defensive           = 1,
	TYR_STANCE_MAX                 = 2
};


// Enum TgGame.TgPawn_Ullr.EUllrInhandWeapon
enum class EUllrInhandWeapon : uint8_t
{
	UIW_RANGED                     = 0,
	UIW_MELEE                      = 1,
	UIW_MAX                        = 2
};


// Enum TgGame.TgPawn_Ullr.EUllrEquippedDevice
enum class EUllrEquippedDevice : uint8_t
{
	UED_Inhand                     = 0,
	UED_Offhand1                   = 1,
	UED_Offhand2                   = 2,
	UED_Offhand3                   = 3,
	UED_MAX                        = 4
};


// Enum TgGame.TgPawn_Vamana.VAMANA_SIZE
enum class EVAMANA_SIZE : uint8_t
{
	VAMANA_SIZE_NORMAL             = 0,
	VAMANA_SIZE_GROWING            = 1,
	VAMANA_SIZE_GIANT              = 2,
	VAMANA_SIZE_SHRINKING          = 3,
	VAMANA_SIZE_MAX                = 4
};


// Enum TgGame.TgPawn_XingTian.EXingTianUltState
enum class EXingTianUltState : uint8_t
{
	XTULT_None                     = 0,
	XTULT_Spin                     = 1,
	XTULT_Fling                    = 2,
	XTULT_Miss                     = 3,
	XTULT_MAX                      = 4
};


// Enum TgGame.TgPawn_Zeus.EZeusShieldThrowState
enum class EZeusShieldThrowState : uint8_t
{
	ZEUSSHIELD_ATTACHED            = 0,
	ZEUSSHIELD_DETACHED            = 1,
	ZEUSSHIELD_RECOVER             = 2,
	ZEUSSHIELD_MAX                 = 3
};


// Enum TgGame.TgPawn_ZhongKui.EZhongKuiAbsorbState
enum class EZhongKuiAbsorbState : uint8_t
{
	ZAS_OFF                        = 0,
	ZAS_RAMPUP                     = 1,
	ZAS_ON                         = 2,
	ZAS_WINDDOWN                   = 3,
	ZAS_MAX                        = 4
};


// Enum TgGame.TgPhysAnimTestActor.EPATAState
enum class EPATAState : uint8_t
{
	PATA_FixedAll                  = 0,
	PATA_FixedLower                = 1,
	PATA_MotorRagdoll              = 2,
	PATA_Floppy                    = 3,
	PATA_Recover                   = 4,
	PATA_MAX                       = 5
};


// Enum TgGame.TgProj_Simulated.eSimProjEvent
enum class EeSimProjEvent : uint8_t
{
	Proj_Spawn                     = 0,
	Proj_Exploded                  = 1,
	Proj_Shutdown                  = 2,
	Proj_Hit                       = 3,
	Proj_Target                    = 4,
	Proj_HitWall                   = 5,
	Proj_Sync                      = 6,
	Proj_UpdateTiDi                = 7,
	Proj_UpdateStimmedShotFX       = 8,
	Proj_MAX                       = 9
};


// Enum TgGame.TgProj_BabaYaga_A01.BabaYagaDeployableFxType
enum class EBabaYagaDeployableFxType : uint8_t
{
	BYDFXT_Long                    = 0,
	BYDFXT_Short                   = 1,
	BYDFXT_Circle                  = 2,
	BYDFXT_MAX                     = 3
};


// Enum TgGame.TgRepInfo_CTF_FlagBase.TgRepInfo_FlagBase_BaseState
enum class ETgRepInfo_FlagBase_BaseState : uint8_t
{
	CTF_BASE_NONE                  = 0,
	CTF_BASE_DELIVER_ACTIVE        = 1,
	CTF_BASE_DELIVER_INACTIVE      = 2,
	CTF_BASE_CAPTURE               = 3,
	CTF_BASE_DEFEND                = 4,
	CTF_BASE_MAX                   = 5
};


// Enum TgGame.TgRepInfo_CTF_Flag.TgRepInfo_Flag_FlagState
enum class ETgRepInfo_Flag_FlagState : uint8_t
{
	CTF_NONE                       = 0,
	CTF_CAPTURE                    = 1,
	CTF_RETURN                     = 2,
	CTF_MAX                        = 3
};


// Enum TgGame.TgRepInfo_Player_Store.EStoreReplicationType
enum class EStoreReplicationType : uint8_t
{
	ESRT_Items                     = 0,
	ESRT_Consumables               = 1,
	ESRT_Relics                    = 2,
	ESRT_MAX                       = 3
};


// Enum TgGame.TgRepInfo_VortexVolume.VortexVolumeState
enum class EVortexVolumeState : uint8_t
{
	VVS_Off                        = 0,
	VVS_Warmup                     = 1,
	VVS_Persist                    = 2,
	VVS_Rampdown                   = 3,
	VVS_MAX                        = 4
};


// Enum TgGame.TgRoundSchedule.ETaskForceSelectionStrategy
enum class ETaskForceSelectionStrategy : uint8_t
{
	TFSS_AssignedTaskForces        = 0,
	TFSS_ByLeastMatchups           = 1,
	TFSS_ByTeamRankings            = 2,
	TFSS_MAX                       = 3
};


// Enum TgGame.TgSeqAct_ForceClientTutorialAction.eForcedClientTutorialAction
enum class EeForcedClientTutorialAction : uint8_t
{
	FCTA_BlockAvl                  = 0,
	FCTA_UnblockAvl                = 1,
	FCTA_Open                      = 2,
	FCTA_Close                     = 3,
	FCTA_MAX                       = 4
};


// Enum TgGame.TgSeqAct_ModifyPropValue.TgPropValueType
enum class ETgPropValueType : uint8_t
{
	TGPVT_Value                    = 0,
	TGPVT_MinVal                   = 1,
	TGPVT_MaxVal                   = 2,
	TGPVT_MAX                      = 3
};


// Enum TgGame.TgSeqAct_RequestMission.EMissionDifficultyLevel
enum class EMissionDifficultyLevel : uint8_t
{
	DL_Easy                        = 0,
	DL_Medium                      = 1,
	DL_Hard                        = 2,
	DL_MAX                         = 3
};


// Enum TgGame.TgSeqAct_ToggleWaypoint.SequenceWaypointInputLinks
enum class ESequenceWaypointInputLinks : uint8_t
{
	SWIL_WaypointOn                = 0,
	SWIL_WaypointOff               = 1,
	SWIL_WaypointToggle            = 2,
	SWIL_MAX                       = 3
};


// Enum TgGame.TgSeqAct_TutorialHighlighter.eTutorialHighlighterElement
enum class EeTutorialHighlighterElement : uint8_t
{
	THE_Hide_All                   = 0,
	THE_Ability1                   = 1,
	THE_ActiveItem                 = 2,
	THE_ConsumableItem             = 3,
	THE_Gold                       = 4,
	THE_ItemShop_Gold              = 5,
	THE_ItemShop_Item              = 6,
	THE_ItemShop_Item2             = 7,
	THE_ItemShop_Item3             = 8,
	THE_ItemShop_Purchase          = 9,
	THE_ItemShop_AllItems          = 10,
	THE_ItemShop_RemoveOverlay     = 11,
	THE_ItemShop_AddBlocker        = 12,
	THE_Stats_Display              = 13,
	THE_Objective_Display          = 14,
	THE_PlayerLevel_Display        = 15,
	THE_ItemShop_T2L               = 16,
	THE_ItemShop_T2R               = 17,
	THE_ItemShop_T3L               = 18,
	THE_ItemShop_T3R               = 19,
	THE_ItemShop_BootItem          = 20,
	THE_ItemShop_AddBlocker2       = 21,
	THE_ItemShop_Item_Grid         = 22,
	THE_ItemShop_Item_Grid01       = 23,
	THE_ItemShop_Item_Grid02       = 24,
	THE_ItemShop_Item_Grid03       = 25,
	THE_ItemShop_T2M               = 26,
	THE_ItemShop_T3Executioner     = 27,
	THE_MAX                        = 28
};


// Enum TgGame.TgSeqAct_TutorialImage.eTutorialImageActionEnum
enum class EeTutorialImageActionEnum : uint8_t
{
	TIAE_Show                      = 0,
	TIAE_Hide                      = 1,
	TIAE_MAX                       = 2
};


// Enum TgGame.TgSeqCond_HasCondition.ConditionType
enum class EConditionType : uint8_t
{
	TGCT_POISON                    = 0,
	TGCT_DISEASE                   = 1,
	TGCT_REGENERATION              = 2,
	TGCT_STUN                      = 3,
	TGCT_STEALTH                   = 4,
	TGCT_EMP_STUN                  = 5,
	TGCT_IGNITE                    = 6,
	TGCT_INVULNERABLE              = 7,
	TGCT_SLOW                      = 8,
	TGCT_MAX                       = 9
};


// Enum TgGame.TgSeqEvent_MICParameterEvent.eMICEventType
enum class EeMICEventType : uint8_t
{
	MET_NONE                       = 0,
	MET_DEFENSE_ALARM              = 1,
	MET_MAX                        = 2
};


// Enum TgGame.TgSeqEvent_MultiRoundsTimer.EMultiRoundsEvent
enum class EMultiRoundsEvent : uint8_t
{
	MRE_Mision_SetupStarted        = 0,
	MRE_Mision_MissionStarted      = 1,
	MRE_Mision_PreGuardianPhase    = 2,
	MRE_Mision_GuardianPhase       = 3,
	MRE_Mision_MissionEnded        = 4,
	MRE_Mision_RoundReset          = 5,
	MRE_Mision_RoundEnded          = 6,
	MRE_Mision_TimedObjectiveUnlock = 7,
	MRE_Mision_OvertimeTransition  = 8,
	MRE_Mision_OvertimeSetup       = 9,
	MRE_Mision_OvertimeStarted     = 10,
	MRE_ItemStoreBegin             = 11,
	MRE_ItemStoreEnd               = 12,
	MRE_RoundSetupBegin            = 13,
	MRE_RoundSetupEnd              = 14,
	MRE_RoundActiveStart           = 15,
	MRE_RoundActiveEnd             = 16,
	MRE_RoundInactiveStart         = 17,
	MRE_RoundInactiveEnd           = 18,
	MRE_RoundResetStart            = 19,
	MRE_RoundResetEnd              = 20,
	MRE_CompleteStart              = 21,
	MRE_CompleteEnd                = 22,
	MRE_MAX                        = 23
};


// Enum TgGame.TgSeqEvent_Named.TSE_NAME
enum class ETSE_NAME : uint8_t
{
	TSE_NONE                       = 0,
	TSE_MENU_CLOSE                 = 1,
	TSE_MOVIE_DONE                 = 2,
	TSE_MAX                        = 3
};


// Enum TgGame.TgSeqEvent_TutorialEvent.TUTORIAL_EVENT
enum class ETUTORIAL_EVENT : uint8_t
{
	TUTEVT_OPENED_ITEM_SHOP        = 0,
	TUTEVT_BOUGHT_ITEM             = 1,
	TUTEVT_CLOSED_ITEM_SHOP        = 2,
	TUTEVT_OPENED_SKILLS           = 3,
	TUTEVT_BOUGHT_SKILL            = 4,
	TUTEVT_CLOSED_SKILLS           = 5,
	TUTEVT_USED_ABILITY            = 6,
	TUTEVT_USED_RECALL             = 7,
	TUTEVT_TARGETED                = 8,
	TUTEVT_OPENED_INTRO            = 9,
	TUTEVT_CLOSED_INTRO            = 10,
	TUTEVT_USED_ACTIVE_ITEM        = 11,
	TUTEVT_SELECTED_SHOP_ITEM      = 12,
	TUTEVT_SELECTED_SHOP_ITEM2     = 13,
	TUTEVT_SELECTED_SHOP_ITEM3     = 14,
	TUTEVT_USED_CONSUMABLE_ITEM    = 15,
	TUTEVT_SELECTED_ALL_ITEMS      = 16,
	TUTEVT_SELECTED_TIER2          = 17,
	TUTEVT_SELECTED_TIER3          = 18,
	TUTEVT_EFFECT_EARNED           = 19,
	TUTEVT_GRID_SELECTED           = 20,
	TUTEVT_GOD_SELECTED            = 21,
	TUTEVT_SELECTED_SHOP_ITEM4     = 22,
	TUTEVT_MAX                     = 23
};


// Enum TgGame.TgSeqEvent_TutorialEvent.TUTORIAL_TARGET_TYPE
enum class ETUTORIAL_TARGET_TYPE : uint8_t
{
	TUT_TARGET_TOWER               = 0,
	TUT_TARGET_PHOENIX             = 1,
	TUT_TARGET_GUARDIAN            = 2,
	TUT_TARGET_MAX                 = 3
};


// Enum TgGame.TgSiegePushActor.EPushState
enum class EPushState : uint8_t
{
	PushState_Paused               = 0,
	PushState_Forward              = 1,
	PushState_PendingReverse       = 2,
	PushState_Reverse              = 3,
	PushState_MAX                  = 4
};


// Enum TgGame.TgSkelCon_ScaleByTranslation.SkelControlAxis
enum class ESkelControlAxis : uint8_t
{
	skelControlX                   = 0,
	skelControlY                   = 1,
	skelControlZ                   = 2,
	SkelControlAxis_MAX            = 3
};


// Enum TgGame.TgSkelCon_ScalarParamByTranslation.TranslationRoundingType
enum class ETranslationRoundingType : uint8_t
{
	TRT_None                       = 0,
	TRT_Round                      = 1,
	TRT_Floor                      = 2,
	TRT_Ceiling                    = 3,
	TRT_MAX                        = 4
};


// Enum TgGame.TgSkelCon_WithMesh.MeshOnType
enum class EMeshOnType : uint8_t
{
	EXTRAMESH_ON_INACTIVE          = 0,
	EXTRAMESH_ON_ACTIVE            = 1,
	EXTRAMESH_ON_STRENGTHABOVE     = 2,
	EXTRAMESH_ON_STRENGTHBELOW     = 3,
	EXTRAMESH_ON_MAX               = 4
};


// Enum TgGame.TgSkelControlSingleBone_DisplayGroup.DisplayGroupOnType
enum class EDisplayGroupOnType : uint8_t
{
	DISPLAYGROUP_ON_INACTIVE       = 0,
	DISPLAYGROUP_ON_ACTIVE         = 1,
	DISPLAYGROUP_ON_STRENGTHABOVE  = 2,
	DISPLAYGROUP_ON_STRENGTHBELOW  = 3,
	DISPLAYGROUP_ON_MAX            = 4
};


// Enum TgGame.TgSkeletalMeshActor_Loader.ELobbyMeshType
enum class ELobbyMeshType : uint8_t
{
	ELMT_GodSelection              = 0,
	ELMT_Home                      = 1,
	ELMT_Event                     = 2,
	ELMT_GodsPage                  = 3,
	ELMT_MAX                       = 4
};


// Enum TgGame.TgSkeletalMeshActor_Loader.LobbyAnimPose
enum class ELobbyAnimPose : uint8_t
{
	LAP_Match                      = 0,
	LAP_Victory                    = 1,
	LAP_Defeat                     = 2,
	LAP_InGame                     = 3,
	LAP_MAX                        = 4
};


// Enum TgGame.TgSkeletalMeshActor_LobbyBase.ELobbyEventType
enum class ELobbyEventType : uint8_t
{
	LET_None                       = 0,
	LET_Hovered                    = 1,
	LET_Selected                   = 2,
	LET_MAX                        = 3
};


// Enum TgGame.TgSkeletalMeshActorSpawnable_BabaYagaPotion.BabaYagaPotionAnimState
enum class EBabaYagaPotionAnimState : uint8_t
{
	BYPA_Intro                     = 0,
	BYPA_SwapIn                    = 1,
	BYPA_Looping                   = 2,
	BYPA_SwapOut                   = 3,
	BYPA_Stored                    = 4,
	BYPA_MAX                       = 5
};


// Enum TgGame.TgSkeletalMeshActorSpawnable_DepthzyIStateMesh.DepthzyIStateMeshType
enum class EDepthzyIStateMeshType : uint8_t
{
	DISMT_Eye1                     = 0,
	DISMT_Tentacle1                = 1,
	DISMT_Tentacle2                = 2,
	DISMT_Tentacle3                = 3,
	DISMT_MAX                      = 4
};


// Enum TgGame.TgSkeletalMeshActorSpawnable_OlorunClone.EOlorunCloneState
enum class EOlorunCloneState : uint8_t
{
	OLORUN_CLONE_NONE              = 0,
	OLORUN_CLONE_INTRO             = 1,
	OLORUN_CLONE_CHARGING          = 2,
	OLORUN_CLONE_OUTRO             = 3,
	OLORUN_CLONE_MAX               = 4
};


// Enum TgGame.TgSoundGroup.eTG_SOUNDS
enum class EeTG_SOUNDS : uint8_t
{
	TGS_FOOTSTEP                   = 0,
	TGS_DODGE                      = 1,
	TGS_JUMP                       = 2,
	TGS_LAND                       = 3,
	TGS_DOUBLEJUMP                 = 4,
	TGS_DOUBLELAND                 = 5,
	TGS_DYING                      = 6,
	TGS_HIT                        = 7,
	TGS_MAX                        = 8
};


// Enum TgGame.TgSpecialFxLightManager.SpecialFxLightState
enum class ESpecialFxLightState : uint8_t
{
	FxLight_Normal                 = 0,
	FxLight_Dying                  = 1,
	FxLight_Kill                   = 2,
	FxLight_MAX                    = 3
};


// Enum TgGame.TgTeleportPlayerVolume.TgTeleportVolumeType
enum class ETgTeleportVolumeType : uint8_t
{
	Inactive                       = 0,
	Respawn                        = 1,
	TgTeleportVolumeType_MAX       = 2
};


// Enum TgGame.TgValueDataItem.TgValueType
enum class ETgValueType : uint8_t
{
	TGVT_None                      = 0,
	TGVT_Bool                      = 1,
	TGVT_Int                       = 2,
	TGVT_Float                     = 3,
	TGVT_Qword                     = 4,
	TGVT_Dword                     = 5,
	TGVT_MAX                       = 6
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct TgGame.TgActor_CH08_GooSpawner.CH08_GOO_SPAWNER
// 0x0030
struct FCH08_GOO_SPAWNER
{
	struct FVector                                     vSpawnLocation;                                           // 0x0000(0x000C)
	int                                                nGooSpawnCount;                                           // 0x000C(0x0004)
	unsigned long                                      bIsActive : 1;                                            // 0x0010(0x0004)
	float                                              fSpawnOffsetZ;                                            // 0x0014(0x0004)
	float                                              fMaxSpread;                                               // 0x0018(0x0004)
	float                                              fMinSpread;                                               // 0x001C(0x0004)
	float                                              fRespawnDelay;                                            // 0x0020(0x0004)
	float                                              fTimeRemaining;                                           // 0x0024(0x0004)
	class ATgCollisionProxy_CH08*                      collisionProxy;                                           // 0x0028(0x0008)
};

// ScriptStruct TgGame.TgAnimNodeSequence_WithMultiMesh.AnimMeshEntry
// 0x0018
struct FAnimMeshEntry
{
	int                                                m_nMeshId;                                                // 0x0000(0x0004) (Edit)
	struct FName                                       m_nmSocketName;                                           // 0x0004(0x0008) (Edit)
	struct FName                                       m_nmFullBodyName;                                         // 0x000C(0x0008) (Edit)
	unsigned long                                      m_bUseSocketRelativeLoc : 1;                              // 0x0014(0x0004) (Edit)
	unsigned long                                      m_bUseSocketRelativeRot : 1;                              // 0x0014(0x0004) (Edit)
	unsigned long                                      m_bIgnoreOwnerHidden : 1;                                 // 0x0014(0x0004) (Edit)
	unsigned long                                      m_bIgnoreOwnerRotation : 1;                               // 0x0014(0x0004) (Edit)
};

// ScriptStruct TgGame.TgPlayerController.FLOOD
// 0x0008
struct FFLOOD
{
	int                                                m_nCount;                                                 // 0x0000(0x0004)
	float                                              m_fLastUpdate;                                            // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgPlayerController.PlayerBuildRecs
// 0x0128
struct FPlayerBuildRecs
{
	int                                                m_nSupportRecommendedItems[0xC];                          // 0x0000(0x0004) (Const)
	int                                                m_nCarryRecommendedItems[0xC];                            // 0x0030(0x0004) (Const)
	int                                                m_nMidRecommendedItems[0xC];                              // 0x0060(0x0004) (Const)
	int                                                m_nSoloRecommendedItems[0xC];                             // 0x0090(0x0004) (Const)
	int                                                m_nJungleRecommendedItems[0xC];                           // 0x00C0(0x0004) (Const)
	int                                                m_nGenericRecommendedItems[0xC];                          // 0x00F0(0x0004) (Const)
	TEnumAsByte<EConquestRole>                         m_eCurrentRecommendedRole;                                // 0x0120(0x0001) (Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0121(0x0003) MISSED OFFSET
	unsigned long                                      m_bUseRecommendedItems : 1;                               // 0x0124(0x0004) (Const)
};

// ScriptStruct TgGame.TgPlayerController.sSimProjectileFireInfo
// 0x0034
struct FsSimProjectileFireInfo
{
	struct FVector                                     vLocation;                                                // 0x0000(0x000C)
	struct FVector                                     vDirectionMunged;                                         // 0x000C(0x000C)
	int                                                nFlashProjectile;                                         // 0x0018(0x0004)
	int                                                nOwnerFireModeId;                                         // 0x001C(0x0004)
	int                                                nActorId;                                                 // 0x0020(0x0004)
	float                                              fGeneric1;                                                // 0x0024(0x0004)
	float                                              fGeneric2;                                                // 0x0028(0x0004)
	TEnumAsByte<ECMTargetType>                         ActorType;                                                // 0x002C(0x0001)
	unsigned char                                      byTiDi;                                                   // 0x002D(0x0001)
	unsigned char                                      byLocalTiDi;                                              // 0x002E(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x002F(0x0001) MISSED OFFSET
	unsigned long                                      bClientProcessed : 1;                                     // 0x0030(0x0004)
};

// ScriptStruct TgGame.TgPlayerController.sDeferredProjectileFireInfo
// 0x0038
struct FsDeferredProjectileFireInfo
{
	struct FsSimProjectileFireInfo                     Info;                                                     // 0x0000(0x0034)
	int                                                nDeferCount;                                              // 0x0034(0x0004)
};

// ScriptStruct TgGame.TgPlayerController.AbilityLevelInfo
// 0x0008
struct FAbilityLevelInfo
{
	int                                                Ability[0x2];                                             // 0x0000(0x0004)
};

// ScriptStruct TgGame.TgProperty.TgPropertyInstance
// 0x001C
struct FTgPropertyInstance
{
	int                                                m_nPropIndex;                                             // 0x0000(0x0004)
	int                                                m_nPropertyId;                                            // 0x0004(0x0004)
	float                                              m_fBase;                                                  // 0x0008(0x0004)
	float                                              m_fRaw;                                                   // 0x000C(0x0004)
	float                                              m_fMinimum;                                               // 0x0010(0x0004)
	float                                              m_fMaximum;                                               // 0x0014(0x0004)
	float                                              m_fScalingFactor;                                         // 0x0018(0x0004)
};

// ScriptStruct TgGame.TgClientSettings.TgListLastSeen
// 0x0030
struct FTgListLastSeen
{
	struct FString                                     sStoreDeals;                                              // 0x0000(0x0010) (Edit, Config, GlobalConfig, NeedCtorLink)
	struct FString                                     sStoreChests;                                             // 0x0010(0x0010) (Edit, Config, GlobalConfig, NeedCtorLink)
	struct FString                                     sStoreGodsSkins;                                          // 0x0020(0x0010) (Edit, Config, GlobalConfig, NeedCtorLink)
};

// ScriptStruct TgGame.TgCollisionProxy_CH08.CH08_PAWN_LOCATION_HISTORY
// 0x0018
struct FCH08_PAWN_LOCATION_HISTORY
{
	class ATgPawn*                                     trackedPawn;                                              // 0x0000(0x0008)
	struct FVector                                     vPreviousLocation;                                        // 0x0008(0x000C)
	unsigned long                                      bDeleteAfterUpdate : 1;                                   // 0x0014(0x0004)
};

// ScriptStruct TgGame.TgObject.CH08_GOO_SPOT
// 0x0018
struct FCH08_GOO_SPOT
{
	struct FVector                                     vGooLocation;                                             // 0x0000(0x000C)
	TEnumAsByte<ECH08_GOO_SPOT_TYPES>                  nGooType;                                                 // 0x000C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	int                                                nGooId;                                                   // 0x0010(0x0004)
	int                                                nSpawnerId;                                               // 0x0014(0x0004)
};

// ScriptStruct TgGame.TgCollisionProxy_FX.ProxyFxInfo
// 0x0010
struct FProxyFxInfo
{
	class UTgSpecialFx*                                Fx;                                                       // 0x0000(0x0008)
	class ATgPawn*                                     Target;                                                   // 0x0008(0x0008)
};

// ScriptStruct TgGame.TgObject.OnDamagedParams
// 0x00A4
struct FOnDamagedParams
{
	class ATgPawn*                                     attacker;                                                 // 0x0000(0x0008)
	class ATgDevice*                                   Dev;                                                      // 0x0008(0x0008)
	class UTgEffectGroup*                              eg;                                                       // 0x0010(0x0008)
	struct FImpactInfo                                 Impact;                                                   // 0x0018(0x0078) (Component)
	float                                              fBuffedDamage;                                            // 0x0090(0x0004)
	float                                              fMitigatedDamage;                                         // 0x0094(0x0004)
	float                                              fPreDamageHealth;                                         // 0x0098(0x0004)
	unsigned long                                      bCritical : 1;                                            // 0x009C(0x0004)
	int                                                nPropertyId;                                              // 0x00A0(0x0004)
};

// ScriptStruct TgGame.TgValueDataItem.TgDataItemValue
// 0x000C
struct FTgDataItemValue
{
	TEnumAsByte<ETgValueType>                          eType;                                                    // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FQWord                                      Dummy;                                                    // 0x0004(0x0008) (Const, Native)
};

// ScriptStruct TgGame.TgObject.TG_HUD_INFO_EFFECTS
// 0x0014
struct FTG_HUD_INFO_EFFECTS
{
	int                                                nEffectGroupId;                                           // 0x0000(0x0004)
	int                                                nIconStackId;                                             // 0x0004(0x0004)
	int                                                nStackCount;                                              // 0x0008(0x0004)
	float                                              fDurationSecs;                                            // 0x000C(0x0004)
	float                                              fRemainingSecs;                                           // 0x0010(0x0004)
};

// ScriptStruct TgGame.TgObject.TG_HUD_INFO
// 0x013E
struct FTG_HUD_INFO
{
	TEnumAsByte<EOverlayType>                          eOverlayType;                                             // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                nActorId;                                                 // 0x0004(0x0004)
	unsigned long                                      bEnemy : 1;                                               // 0x0008(0x0004)
	struct FString                                     objectiveString;                                          // 0x000C(0x0010) (NeedCtorLink)
	unsigned long                                      bShowNameplate : 1;                                       // 0x001C(0x0004)
	unsigned long                                      bShowPortrait : 1;                                        // 0x001C(0x0004)
	unsigned long                                      bShowOverlays : 1;                                        // 0x001C(0x0004)
	unsigned long                                      bShowTaskForce : 1;                                       // 0x001C(0x0004)
	unsigned long                                      bIsWinning : 1;                                           // 0x001C(0x0004)
	unsigned long                                      bIsTargeted : 1;                                          // 0x001C(0x0004)
	struct FVector                                     vScreenLoc;                                               // 0x0020(0x000C)
	float                                              fScale;                                                   // 0x002C(0x0004)
	float                                              fAlphaLevel;                                              // 0x0030(0x0004)
	float                                              fLastSeenTime;                                            // 0x0034(0x0004)
	float                                              fLastUnseenTime;                                          // 0x0038(0x0004)
	struct FString                                     sName;                                                    // 0x003C(0x0010) (NeedCtorLink)
	int                                                nHealth;                                                  // 0x004C(0x0004)
	int                                                nMaxHealth;                                               // 0x0050(0x0004)
	int                                                nMana;                                                    // 0x0054(0x0004)
	int                                                nMaxMana;                                                 // 0x0058(0x0004)
	int                                                nShield;                                                  // 0x005C(0x0004)
	int                                                nMaxShield;                                               // 0x0060(0x0004)
	float                                              fDistance;                                                // 0x0064(0x0004)
	int                                                nLevel;                                                   // 0x0068(0x0004)
	int                                                nProfileId;                                               // 0x006C(0x0004)
	int                                                nSkinId;                                                  // 0x0070(0x0004)
	int                                                nPacingType;                                              // 0x0074(0x0004)
	int                                                nTaskForce;                                               // 0x0078(0x0004)
	int                                                nHardCCCategoryId;                                        // 0x007C(0x0004)
	float                                              fHardCCLengthSecs;                                        // 0x0080(0x0004)
	float                                              fHardCCRemainingSecs;                                     // 0x0084(0x0004)
	int                                                nImmunityTypeId;                                          // 0x0088(0x0004)
	struct FTG_HUD_INFO_EFFECTS                        ImportantEffects[0x8];                                    // 0x008C(0x0014)
	float                                              fLifeLengthSecs;                                          // 0x012C(0x0004)
	float                                              fLifeRemainingSecs;                                       // 0x0130(0x0004)
	float                                              fNextLineCheckTime;                                       // 0x0134(0x0004)
	unsigned long                                      bLastLineCheckResult : 1;                                 // 0x0138(0x0004)
	TEnumAsByte<EOverlayLineCheckState>                eLineCheckState;                                          // 0x013C(0x0001)
	TEnumAsByte<EOverlayOffscreenIndicator>            eOffscreenIndicator;                                      // 0x013D(0x0001)
};

// ScriptStruct TgGame.TgDistributionFloatSoundAttenuation.AttenuationGroup
// 0x000C
struct FAttenuationGroup
{
	struct FName                                       GroupName;                                                // 0x0000(0x0008)
	float                                              AttenuationDistance;                                      // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgEffectParameterTransition.EffectParameterTransition
// 0x0012
struct FEffectParameterTransition
{
	struct FName                                       m_nmParameter;                                            // 0x0000(0x0008) (Const)
	float                                              m_fDuration;                                              // 0x0008(0x0004) (Const)
	float                                              m_fLerpExponential;                                       // 0x000C(0x0004) (Const)
	TEnumAsByte<EffectParameterTransitionRepeatStrategy> m_eRepeatStrategy;                                        // 0x0010(0x0001) (Const)
	unsigned char                                      m_nRepeatCount;                                           // 0x0011(0x0001)
};

// ScriptStruct TgGame.TgEmoteConfigResource.EmoteConfigEntry
// 0x000C
struct FEmoteConfigEntry
{
	TEnumAsByte<EEmote>                                Emote;                                                    // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	unsigned long                                      bWantsLoop : 1;                                           // 0x0004(0x0004)
	unsigned long                                      bWantsSuppress : 1;                                       // 0x0004(0x0004)
	unsigned long                                      bBlockAnimRestart : 1;                                    // 0x0004(0x0004)
	unsigned long                                      bLocksMusicTheme : 1;                                     // 0x0004(0x0004)
	unsigned long                                      bUsesPostProcess : 1;                                     // 0x0004(0x0004)
	int                                                nLockedBeforeLevel;                                       // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgEmoteConfigResource.EmoteSuccessiveStates
// 0x0008
struct FEmoteSuccessiveStates
{
	TEnumAsByte<EEmote>                                Emote;                                                    // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                nTrackedStates;                                           // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgFlagContentData.FlagMeshData
// 0x000C
struct FFlagMeshData
{
	TEnumAsByte<EFlagContentDataType>                  ContentDataType;                                          // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	class UTgMenuMeshInfo*                             MainMeshInfo;                                             // 0x0004(0x0008)
};

// ScriptStruct TgGame.TgLootTable.LootData
// 0x0014
struct FLootData
{
	int                                                nItemId;                                                  // 0x0000(0x0004)
	int                                                nLootTableItemId;                                         // 0x0004(0x0004)
	float                                              fWeight;                                                  // 0x0008(0x0004)
	int                                                nQuantity;                                                // 0x000C(0x0004)
	unsigned long                                      bCanStack : 1;                                            // 0x0010(0x0004)
};

// ScriptStruct TgGame.TgMarkComponent.TargetMark
// 0x0020
struct FTargetMark
{
	class AActor*                                      Target;                                                   // 0x0000(0x0008)
	float                                              fTimeLeft;                                                // 0x0008(0x0004)
	int                                                nNumMarks;                                                // 0x000C(0x0004)
	TArray<class UTgEffectGroup*>                      AppliedEffects;                                           // 0x0010(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgMenuContentData.MeshData
// 0x0014
struct FMeshData
{
	TEnumAsByte<EMenuContentDataType>                  ContentDataType;                                          // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	class UTgMenuMeshInfo*                             MainMeshInfo;                                             // 0x0004(0x0008)
	struct FName                                       CameraName;                                               // 0x000C(0x0008)
};

// ScriptStruct TgGame.TgMenuMeshInfo.LobbyMeshInfo
// 0x0068
struct FLobbyMeshInfo
{
	struct FVector                                     Translation;                                              // 0x0000(0x000C) (Edit)
	struct FRotator                                    Rotation;                                                 // 0x000C(0x000C) (Edit)
	float                                              Scale;                                                    // 0x0018(0x0004) (Edit)
	class USkeletalMesh*                               SkelMesh;                                                 // 0x001C(0x0008) (Edit)
	class UPhysicsAsset*                               PhysAsset;                                                // 0x0024(0x0008) (Edit)
	class UAnimTree*                                   AnimTreeTemplate;                                         // 0x002C(0x0008) (Edit)
	TArray<class UAnimSet*>                            AnimSets;                                                 // 0x0034(0x0010) (Edit, NeedCtorLink)
	class UMorphTargetSet*                             MorphTargetSet;                                           // 0x0044(0x0008) (Edit)
	unsigned long                                      bOnlySelfShadow : 1;                                      // 0x004C(0x0004) (Edit)
	TArray<class UMaterialInterface*>                  MaterialOverrides;                                        // 0x0050(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      bUseIndividualLightEnvironment : 1;                       // 0x0060(0x0004) (Edit)
	unsigned long                                      bUseOverlayMesh : 1;                                      // 0x0060(0x0004) (Edit)
	int                                                SkinOverrideId;                                           // 0x0064(0x0004) (Edit)
};

// ScriptStruct TgGame.TgMenuMeshInfo.ParticleSystemInfo
// 0x0010
struct FParticleSystemInfo
{
	class UParticleSystem*                             ParticleSystem;                                           // 0x0000(0x0008) (Edit)
	struct FName                                       SocketName;                                               // 0x0008(0x0008) (Edit)
};

// ScriptStruct TgGame.TgSpectatorDirector.ViewTargetInfo
// 0x0038
struct FViewTargetInfo
{
	class ATgPawn*                                     Pawn;                                                     // 0x0000(0x0008)
	class ATgPawn_Tower*                               ClosestEnemyTower;                                        // 0x0008(0x0008)
	int                                                Rating;                                                   // 0x0010(0x0004)
	float                                              DistSqToClosestEnemy;                                     // 0x0014(0x0004)
	float                                              DistSqToClosestFriend;                                    // 0x0018(0x0004)
	float                                              DistSqToFireGiant;                                        // 0x001C(0x0004)
	float                                              DistSqToGoldFury;                                         // 0x0020(0x0004)
	float                                              DistSqToEnemyTower;                                       // 0x0024(0x0004)
	float                                              DistSqToEnemyMinotaur;                                    // 0x0028(0x0004)
	float                                              DistSqToEnemyPhoenix;                                     // 0x002C(0x0004)
	int                                                NumCloseEnemies;                                          // 0x0030(0x0004)
	int                                                NumCloseFriends;                                          // 0x0034(0x0004)
};

// ScriptStruct TgGame.TgTiDiState.TidiStackItem
// 0x0008
struct FTidiStackItem
{
	class UTgEffectGroup*                              m_EffectGroup;                                            // 0x0000(0x0008)
};

// ScriptStruct TgGame.TgAnimBlendBySpeed.ResetSynchGroup
// 0x0028
struct FResetSynchGroup
{
	struct FName                                       AnimNodeSynchName;                                        // 0x0000(0x0008) (Edit)
	class UAnimNodeSynch*                              SynchNode;                                                // 0x0008(0x0008)
	struct FName                                       GroupName;                                                // 0x0010(0x0008) (Edit)
	TArray<int>                                        ResetChannels;                                            // 0x0018(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgAnimMetaData_MICScalarParameter.MICScalarParameterKeyFrame
// 0x0008
struct FMICScalarParameterKeyFrame
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit)
	float                                              TargetValue;                                              // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimMetaData_MICScalarParameter.MICScalarParameterSkinIdOverride
// 0x0024
struct FMICScalarParameterSkinIdOverride
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	struct FName                                       MICParameterName;                                         // 0x0008(0x0008) (Edit)
	int                                                MaterialIndex;                                            // 0x0010(0x0004) (Edit)
	TArray<struct FMICScalarParameterKeyFrame>         KeyFrames;                                                // 0x0014(0x0010) (Edit, NeedCtorLink, EditInline)
};

// ScriptStruct TgGame.TgAnimMetaData_MICVectorParameter.MICVectorParameterKeyFrame
// 0x0020
struct FMICVectorParameterKeyFrame
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
	struct FVector4                                    TargetValue;                                              // 0x0010(0x0010) (Edit)
};

// ScriptStruct TgGame.TgAnimMetaData_MICVectorParameter.MICVectorParameterSkinIdOverride
// 0x0024
struct FMICVectorParameterSkinIdOverride
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	struct FName                                       MICParameterName;                                         // 0x0008(0x0008) (Edit)
	int                                                MaterialIndex;                                            // 0x0010(0x0004) (Edit)
	TArray<struct FMICVectorParameterKeyFrame>         KeyFrames;                                                // 0x0014(0x0010) (Edit, NeedCtorLink, EditInline)
};

// ScriptStruct TgGame.TgAnimMetaData_MICVectorPlusSocket.MICVectorSocketKeyFrame
// 0x0030
struct FMICVectorSocketKeyFrame
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
	struct FVector4                                    TranslationTargetValue;                                   // 0x0010(0x0010) (Edit)
	struct FVector4                                    RotationTargetValue;                                      // 0x0020(0x0010) (Edit)
};

// ScriptStruct TgGame.TgAnimMetaData_MICVectorPlusSocket.MICVectorSocketSkinIdOverride
// 0x0038
struct FMICVectorSocketSkinIdOverride
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	struct FName                                       TranslationMICParameterName;                              // 0x0008(0x0008) (Edit)
	struct FName                                       RotationMICParameterName;                                 // 0x0010(0x0008) (Edit)
	int                                                TranslationMaterialIndex;                                 // 0x0018(0x0004) (Edit)
	int                                                RotationMaterialIndex;                                    // 0x001C(0x0004) (Edit)
	struct FName                                       SocketName;                                               // 0x0020(0x0008) (Edit)
	TArray<struct FMICVectorSocketKeyFrame>            KeyFrames;                                                // 0x0028(0x0010) (Edit, NeedCtorLink, EditInline)
};

// ScriptStruct TgGame.TgAnimMetaData_SkelControl_BoneScale_KeyFrame.BoneScaleKeyFrameSkinIdOverride
// 0x0028
struct FBoneScaleKeyFrameSkinIdOverride
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	TArray<struct FName>                               SkelControlNameList;                                      // 0x0008(0x0010) (Edit, NeedCtorLink)
	TArray<struct FTimeModifier>                       KeyFrames;                                                // 0x0018(0x0010) (Edit, NeedCtorLink, EditInline)
};

// ScriptStruct TgGame.TgAnimMetaData_SkinLevel.SkinLevelParameterKeyFrame
// 0x0010
struct FSkinLevelParameterKeyFrame
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit)
	float                                              fVXGStartTime;                                            // 0x0004(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0008(0x0004) (Edit)
	unsigned long                                      bNoLevelChange : 1;                                       // 0x000C(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimMetaData_WithMesh.WithMeshKeyFrame
// 0x0008
struct FWithMeshKeyFrame
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit)
	unsigned long                                      Active : 1;                                               // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimMetaData_WithMesh.WithMeshMetaData
// 0x0034
struct FWithMeshMetaData
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	int                                                nMeshId;                                                  // 0x0008(0x0004) (Edit)
	unsigned long                                      bPAC : 1;                                                 // 0x000C(0x0004) (Edit)
	struct FName                                       nmFullBodyName;                                           // 0x0010(0x0008) (Edit)
	struct FName                                       nmSocketName;                                             // 0x0018(0x0008) (Edit)
	unsigned long                                      bUseSocketLoc : 1;                                        // 0x0020(0x0004) (Edit)
	unsigned long                                      bUseSocketRot : 1;                                        // 0x0020(0x0004) (Edit)
	unsigned long                                      bIgnoreOwnerHidden : 1;                                   // 0x0020(0x0004) (Edit)
	TArray<struct FWithMeshKeyFrame>                   KeyFrames;                                                // 0x0024(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgAnimNodeAimOffset_Skinned.AimSkinProfile
// 0x000C
struct FAimSkinProfile
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	struct FName                                       nmProfile;                                                // 0x0004(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimNodeBlendByPhysics.ChildBlendInfo
// 0x0008
struct FChildBlendInfo
{
	TEnumAsByte<EPhysics>                              m_PhysicsState;                                           // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              m_fBlendTime;                                             // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimNodeBlendByPhysics.ChildrenBlendInfo
// 0x0014
struct FChildrenBlendInfo
{
	TEnumAsByte<EPhysics>                              m_PhysicsState;                                           // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	TArray<struct FChildBlendInfo>                     m_ChildBlendInfo;                                         // 0x0004(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgAnimNodeBlendList.ChildBlendParam
// 0x0018
struct FChildBlendParam
{
	int                                                FromChild;                                                // 0x0000(0x0004) (Edit)
	int                                                ToChild;                                                  // 0x0004(0x0004) (Edit)
	float                                              BlendTime;                                                // 0x0008(0x0004) (Edit)
	float                                              StationaryBlendTime;                                      // 0x000C(0x0004) (Edit)
	unsigned long                                      UseAltBlendTimeWhileStationary : 1;                       // 0x0010(0x0004) (Edit)
	float                                              MaxBlendTime;                                             // 0x0014(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnim_MeshPassthrough.TgAnimPassthroughMeshMap
// 0x0014
struct FTgAnimPassthroughMeshMap
{
	int                                                m_nMeshId;                                                // 0x0000(0x0004) (Edit)
	struct FName                                       m_nmSocketName;                                           // 0x0004(0x0008) (Edit)
	struct FName                                       m_nmMeshFullbodyName;                                     // 0x000C(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnim_MeshPassthrough.TgAnimPassthroughPACMap
// 0x000C
struct FTgAnimPassthroughPACMap
{
	int                                                m_nMeshId;                                                // 0x0000(0x0004) (Edit)
	struct FName                                       m_nmBoneName;                                             // 0x0004(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByDirection_WithTransitions.DirectionTransitionAnimSet
// 0x000C
struct FDirectionTransitionAnimSet
{
	TEnumAsByte<EBlendDirTypes>                        m_eEndDirection;                                          // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       m_nmDirectionTransitionAnim;                              // 0x0004(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByDirection_WithTransitions.DirectionalProfile
// 0x0014
struct FDirectionalProfile
{
	TEnumAsByte<EBlendDirTypes>                        m_eStartDirection;                                        // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	TArray<struct FDirectionTransitionAnimSet>         m_directionTransitionAnimSets;                            // 0x0004(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgAnimBlendByEmote.EmoteBlendMap
// 0x0008
struct FEmoteBlendMap
{
	TEnumAsByte<EEmote>                                EmoteOverride;                                            // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                nChildOverride;                                           // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByFire.DeviceParameters
// 0x0014
struct FDeviceParameters
{
	struct FString                                     SlotName;                                                 // 0x0000(0x0010) (NeedCtorLink)
	unsigned long                                      bForceReplayOnBuildup : 1;                                // 0x0010(0x0004) (Edit)
	unsigned long                                      bForceReplayOnStartFire : 1;                              // 0x0010(0x0004) (Edit)
	unsigned long                                      bShouldInterruptIfStopped : 1;                            // 0x0010(0x0004) (Edit)
	unsigned long                                      bShouldInterruptIfInterrupted : 1;                        // 0x0010(0x0004) (Edit)
	unsigned long                                      bShouldInterruptIfJumping : 1;                            // 0x0010(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByPhase.m_PhaseTransitionAnimSet
// 0x000C
struct Fm_PhaseTransitionAnimSet
{
	int                                                m_TransitionToPhase;                                      // 0x0000(0x0004) (Edit)
	struct FName                                       m_TransitionAnimName;                                     // 0x0004(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByPhase.m_PhaseProfile
// 0x0014
struct Fm_PhaseProfile
{
	int                                                m_Phase;                                                  // 0x0000(0x0004) (Edit)
	TArray<struct Fm_PhaseTransitionAnimSet>           m_TransitionAnimSets;                                     // 0x0004(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgAnimBlendByPosture.PostureTransitionOverride
// 0x000E
struct FPostureTransitionOverride
{
	struct FName                                       AnimName;                                                 // 0x0000(0x0008)
	float                                              BlendTime;                                                // 0x0008(0x0004)
	TEnumAsByte<ETG_POSTURE>                           StartPosture;                                             // 0x000C(0x0001)
	TEnumAsByte<ETG_POSTURE>                           EndPosture;                                               // 0x000D(0x0001)
};

// ScriptStruct TgGame.TgAnimBlendByPosture.m_TransitionAnimSet
// 0x000C
struct Fm_TransitionAnimSet
{
	TEnumAsByte<ETG_POSTURE>                           m_TransitionToPosture;                                    // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       m_TransitionAnimName;                                     // 0x0004(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByPosture.m_PostureProfile
// 0x0018
struct Fm_PostureProfile
{
	TEnumAsByte<ETG_POSTURE>                           m_Posture;                                                // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	TArray<struct Fm_TransitionAnimSet>                m_TransitionAnimSets;                                     // 0x0004(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      m_bResetBlendByFireToIdleOnTransition : 1;                // 0x0014(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimBlendByRacerAction.RacerActionAnimSlotData
// 0x0028
struct FRacerActionAnimSlotData
{
	struct FName                                       SlotName;                                                 // 0x0000(0x0008)
	TEnumAsByte<ERacerActionAnimNames>                 ActionName;                                               // 0x0008(0x0001) (Edit, EditConst)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	unsigned long                                      ReplayOnRetrigger : 1;                                    // 0x000C(0x0004) (Edit)
	unsigned long                                      CanBeInterrupted : 1;                                     // 0x000C(0x0004) (Edit)
	TArray<TEnumAsByte<ERacerActionAnimNames>>         InterruptExceptions;                                      // 0x0010(0x0010) (Edit, NeedCtorLink)
	float                                              CooldownTime;                                             // 0x0020(0x0004) (Edit)
	float                                              LastTriggerTime;                                          // 0x0024(0x0004) (Transient)
};

// ScriptStruct TgGame.TgAnimBlendBySkin.SkinChildInfo
// 0x0008
struct FSkinChildInfo
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nChildIndex;                                              // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimNodeRandom.TgRandomAnimInfo
// 0x0024
struct FTgRandomAnimInfo
{
	float                                              Chance;                                                   // 0x0000(0x0004) (Edit)
	unsigned char                                      LoopCountMin;                                             // 0x0004(0x0001) (Edit)
	unsigned char                                      LoopCountMax;                                             // 0x0005(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	float                                              BlendInTime;                                              // 0x0008(0x0004) (Edit)
	unsigned long                                      bCanRepeat : 1;                                           // 0x000C(0x0004) (Edit)
	unsigned char                                      LoopCount;                                                // 0x0010(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	unsigned long                                      bCallOnAnimEndOnParent : 1;                               // 0x0014(0x0004) (Edit)
	unsigned long                                      m_bChooseNewNodeOnAnimEnd : 1;                            // 0x0014(0x0004) (Edit)
	struct FVector2D                                   m_ChildActiveTime;                                        // 0x0018(0x0008) (Edit)
	int                                                m_nChildIndex;                                            // 0x0020(0x0004)
};

// ScriptStruct TgGame.TgAnimNodeEmoteSequence_WithMesh.EMOTE_MESH_INFO
// 0x001C
struct FEMOTE_MESH_INFO
{
	TEnumAsByte<EEmote>                                Emote;                                                    // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                MeshId;                                                   // 0x0004(0x0004) (Edit)
	struct FName                                       SocketName;                                               // 0x0008(0x0008) (Edit)
	struct FName                                       FullBodyName;                                             // 0x0010(0x0008) (Edit)
	unsigned long                                      m_bIgnoreOwnerHidden : 1;                                 // 0x0018(0x0004) (Edit)
	unsigned long                                      m_bUseSocketRelativeLoc : 1;                              // 0x0018(0x0004) (Edit)
	unsigned long                                      m_bUseSocketRelativeRot : 1;                              // 0x0018(0x0004) (Edit)
	unsigned long                                      m_bPlayEmoteAfterSpawn : 1;                               // 0x0018(0x0004) (Edit)
	unsigned long                                      m_bIgnoreOwnerRotation : 1;                               // 0x0018(0x0004) (Edit)
	unsigned long                                      c_bActive : 1;                                            // 0x0018(0x0004) (Transient)
};

// ScriptStruct TgGame.TgAnimNodeEmoteSequence_WithPAC.EMOTE_PAC_INFO
// 0x001C
struct FEMOTE_PAC_INFO
{
	TEnumAsByte<EEmote>                                Emote;                                                    // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                MeshId;                                                   // 0x0004(0x0004) (Edit)
	struct FString                                     BoneName;                                                 // 0x0008(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      c_bActive : 1;                                            // 0x0018(0x0004) (Transient)
};

// ScriptStruct TgGame.TgAnimNodeSequence_WithPAC.ANIM_PAC_INFO
// 0x0018
struct FANIM_PAC_INFO
{
	int                                                MeshId;                                                   // 0x0000(0x0004) (Edit)
	struct FString                                     BoneName;                                                 // 0x0004(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      c_bActive : 1;                                            // 0x0014(0x0004) (Transient)
};

// ScriptStruct TgGame.TgAnimNodeSlot.FullbodyMeshEntry
// 0x0020
struct FFullbodyMeshEntry
{
	TArray<struct FName>                               m_nmUseDuringAnims;                                       // 0x0000(0x0010) (Edit, NeedCtorLink)
	struct FName                                       m_nmSocketName;                                           // 0x0010(0x0008) (Edit)
	struct FName                                       m_nmMeshFullbodyName;                                     // 0x0018(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimNodeSlot.TgAnimSlotMeshMap
// 0x0018
struct FTgAnimSlotMeshMap
{
	int                                                m_nMeshId;                                                // 0x0000(0x0004) (Edit)
	TArray<struct FFullbodyMeshEntry>                  m_AnimMap;                                                // 0x0004(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      c_bMeshActive : 1;                                        // 0x0014(0x0004) (Transient)
};

// ScriptStruct TgGame.TgAnimNodeSlot.TgAnimSlotPACMap
// 0x0020
struct FTgAnimSlotPACMap
{
	int                                                m_nMeshId;                                                // 0x0000(0x0004) (Edit)
	struct FName                                       m_nmBoneName;                                             // 0x0004(0x0008) (Edit)
	TArray<struct FName>                               m_AnimList;                                               // 0x000C(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      c_bPACActive : 1;                                         // 0x001C(0x0004) (Transient)
};

// ScriptStruct TgGame.TgAnimNodeStanceTransitioner.CachedTgAnimNodeStanceInfo
// 0x000C
struct FCachedTgAnimNodeStanceInfo
{
	int                                                Index;                                                    // 0x0000(0x0004)
	class UTgAnimNodeStance*                           Node;                                                     // 0x0004(0x0008)
};

// ScriptStruct TgGame.TgAnimNodeStanceTransitioner.CachedTgAnimNodeStanceTransitionInfo
// 0x000C
struct FCachedTgAnimNodeStanceTransitionInfo
{
	int                                                Index;                                                    // 0x0000(0x0004)
	class UTgAnimNodeStanceTransition*                 Node;                                                     // 0x0004(0x0008)
};

// ScriptStruct TgGame.TgAnimNotify_PlayParticleEffect_Skinned.PPE_Skin
// 0x0018
struct FPPE_Skin
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	class UParticleSystem*                             PSTemplate;                                               // 0x0008(0x0008) (Edit)
	class UParticleSystem*                             PSTemplateLobby;                                          // 0x0010(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimNotify_Sound.PSE_Skin
// 0x0020
struct FPSE_Skin
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x0004(0x0004) (Edit)
	class USoundCue*                                   SoundCue;                                                 // 0x0008(0x0008) (Edit)
	unsigned long                                      bPreventRepeat : 1;                                       // 0x0010(0x0004) (Edit)
	float                                              fCueDuration;                                             // 0x0014(0x0004) (Edit)
	unsigned long                                      bPreventGroupRepeat : 1;                                  // 0x0018(0x0004) (Edit)
	int                                                nCueGroup;                                                // 0x001C(0x0004) (Edit)
};

// ScriptStruct TgGame.TgAnimTurnInPlace.RotTransitionInfo
// 0x000C
struct FRotTransitionInfo
{
	float                                              RotationOffset;                                           // 0x0000(0x0004) (Edit)
	struct FName                                       TransName;                                                // 0x0004(0x0008) (Edit)
};

// ScriptStruct TgGame.TgAnimTurnInPlace_Player.TIP_Transition
// 0x0010
struct FTIP_Transition
{
	struct FName                                       TransName;                                                // 0x0000(0x0008)
	struct FName                                       AnimName;                                                 // 0x0008(0x0008) (Edit)
};

// ScriptStruct TgGame.TgSkelCon_CCD_IK_FootPlacement.JointConstraintInformation
// 0x0008
struct FJointConstraintInformation
{
	float                                              AngleConstraint;                                          // 0x0000(0x0004) (Edit)
	float                                              StretchConstraint;                                        // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgSkelCon_Gate.SkelControlGateChild
// 0x000C
struct FSkelControlGateChild
{
	class USkelControlBase*                            SkelControl;                                              // 0x0000(0x0008)
	float                                              DrawY;                                                    // 0x0008(0x0004) (Transient, EditConst)
};

// ScriptStruct TgGame.TgSkelCon_HitReaction.RecoilInfo
// 0x00E0
struct FRecoilInfo
{
	struct FRecoilDef                                  Min;                                                      // 0x0000(0x0070) (Edit)
	struct FRecoilDef                                  Max;                                                      // 0x0070(0x0070) (Edit)
};

// ScriptStruct TgGame.TgSkelCon_PropertyGate.SkelControlPropertyGateConfig
// 0x002C
struct FSkelControlPropertyGateConfig
{
	unsigned long                                      bWasInitialized : 1;                                      // 0x0000(0x0004)
	class AActor*                                      CachedOwner;                                              // 0x0004(0x0008) (Transient)
	struct FPointer                                    CachedByteProperty;                                       // 0x000C(0x0008) (Const, Native, Transient)
	struct FPointer                                    CachedFloatProperty;                                      // 0x0014(0x0008) (Const, Native, Transient)
	struct FPointer                                    CachedBoolProperty;                                       // 0x001C(0x0008) (Const, Native, Transient)
	struct FPointer                                    CachedIntProperty;                                        // 0x0024(0x0008) (Const, Native, Transient)
};

// ScriptStruct TgGame.TgSkelCon_PropertyGate.SkelControlPropertyGateChild
// 0x001C
struct FSkelControlPropertyGateChild
{
	class USkelControlBase*                            SkelControl;                                              // 0x0000(0x0008)
	unsigned char                                      nBytePropertyValue;                                       // 0x0008(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              fFloatPropertyValue;                                      // 0x000C(0x0004) (Edit)
	unsigned long                                      bBoolPropertyValue : 1;                                   // 0x0010(0x0004) (Edit)
	int                                                nIntPropertyValue;                                        // 0x0014(0x0004) (Edit)
	float                                              DrawY;                                                    // 0x0018(0x0004) (Transient, EditConst)
};

// ScriptStruct TgGame.TgSkelCon_SkinGate.SkelControlSkinGateChild
// 0x0014
struct FSkelControlSkinGateChild
{
	class USkelControlBase*                            SkelControl;                                              // 0x0000(0x0008)
	int                                                nSkinId;                                                  // 0x0008(0x0004) (Edit)
	int                                                nSkinLevel;                                               // 0x000C(0x0004) (Edit)
	float                                              DrawY;                                                    // 0x0010(0x0004) (Transient, EditConst)
};

// ScriptStruct TgGame.TgSkelCon_Spinner_Skinned.SkinnedSpinData
// 0x0008
struct FSkinnedSpinData
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	float                                              fSkinnedRotationsPerSecond;                               // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgSkelControlSingleBone.TgSkelControlSingleBoneSkinControls
// 0x0034
struct FTgSkelControlSingleBoneSkinControls
{
	int                                                OverrideSkinId;                                           // 0x0000(0x0004) (Edit)
	TArray<TEnumAsByte<EEmote>>                        SkinOverrideStrengthEmoteNameList;                        // 0x0004(0x0010) (Edit, NeedCtorLink)
	TArray<struct FName>                               SkinOverrideFullBodyAnimNameList;                         // 0x0014(0x0010) (Edit, NeedCtorLink)
	TArray<struct FName>                               SkinOverrideAnimNodeNameList;                             // 0x0024(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgSkelCon_ScalarParamByTranslation.TranslationScalarMICParamInfo
// 0x0010
struct FTranslationScalarMICParamInfo
{
	struct FName                                       ParameterName;                                            // 0x0000(0x0008) (Edit)
	unsigned long                                      bInverseOfControlStrength : 1;                            // 0x0008(0x0004) (Edit)
	float                                              ParamStrength;                                            // 0x000C(0x0004) (Transient)
};

// ScriptStruct TgGame.TgSkelCon_WithMesh.WithMeshInfo
// 0x0028
struct FWithMeshInfo
{
	int                                                MeshId;                                                   // 0x0000(0x0004) (Edit)
	unsigned long                                      bPAC : 1;                                                 // 0x0004(0x0004) (Edit)
	struct FName                                       FullBodyName;                                             // 0x0008(0x0008) (Edit)
	TEnumAsByte<EMeshOnType>                           WhenMeshOn;                                               // 0x0010(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              Strength;                                                 // 0x0014(0x0004) (Edit)
	unsigned long                                      bOn : 1;                                                  // 0x0018(0x0004) (Transient)
	unsigned long                                      ForceOffIfMeshHidden : 1;                                 // 0x0018(0x0004) (Edit)
	struct FName                                       SocketName;                                               // 0x001C(0x0008) (Edit)
	unsigned long                                      bUseSocketLocation : 1;                                   // 0x0024(0x0004) (Edit)
	unsigned long                                      bUseSocketRotation : 1;                                   // 0x0024(0x0004) (Edit)
	unsigned long                                      ForceOffIfBelowLobbyWall : 1;                             // 0x0024(0x0004) (Edit)
	unsigned long                                      bFreezeAnimTreeOnHidden : 1;                              // 0x0024(0x0004) (Edit)
	unsigned long                                      bResetMeshOnActivate : 1;                                 // 0x0024(0x0004) (Edit)
	unsigned long                                      m_bIgnoreOwnerRotation : 1;                               // 0x0024(0x0004) (Edit)
};

// ScriptStruct TgGame.TgSkelControlSingleBone_DisplayGroup.DisplayGroupInfo
// 0x0028
struct FDisplayGroupInfo
{
	struct FName                                       DisplayGroupName;                                         // 0x0000(0x0008) (Edit)
	TEnumAsByte<EDisplayGroupOnType>                   WhenDisplayGroupOn;                                       // 0x0008(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              Strength;                                                 // 0x000C(0x0004) (Edit)
	unsigned long                                      bOn : 1;                                                  // 0x0010(0x0004) (Transient)
	unsigned long                                      ForceOffIfMeshHidden : 1;                                 // 0x0010(0x0004) (Edit)
	TArray<struct FName>                               SocketNames;                                              // 0x0014(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      ForceOffIfBelowLobbyWall : 1;                             // 0x0024(0x0004) (Edit)
};

// ScriptStruct TgGame.TgSkelControlSingleBone_ScalarMICParam.ScalarMICParamInfo
// 0x0018
struct FScalarMICParamInfo
{
	struct FName                                       ParameterName;                                            // 0x0000(0x0008) (Edit)
	unsigned long                                      bInverseOfControlStrength : 1;                            // 0x0008(0x0004) (Edit)
	unsigned long                                      bUseMultScale : 1;                                        // 0x0008(0x0004) (Edit)
	float                                              fMultScale;                                               // 0x000C(0x0004) (Edit)
	unsigned long                                      bApplyToChildren : 1;                                     // 0x0010(0x0004) (Edit)
	float                                              ParamStrength;                                            // 0x0014(0x0004) (Transient)
};

// ScriptStruct TgGame.TgSkelControlSingleBone_Skinned.SkinStrengthOverride
// 0x0008
struct FSkinStrengthOverride
{
	int                                                nSkinId;                                                  // 0x0000(0x0004) (Edit)
	float                                              fDesiredStrength;                                         // 0x0004(0x0004) (Edit)
};

// ScriptStruct TgGame.TgCharmComponent.FireChainInfo
// 0x0010
struct FFireChainInfo
{
	int                                                nMode;                                                    // 0x0000(0x0004)
	float                                              fPreFireDelay;                                            // 0x0004(0x0004)
	float                                              fPostFireDelay;                                           // 0x0008(0x0004)
	int                                                nAttackType;                                              // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgObject.AimData
// 0x0030
struct FAimData
{
	struct FVector                                     StartTrace;                                               // 0x0000(0x000C)
	struct FVector                                     EndTrace;                                                 // 0x000C(0x000C)
	struct FVector                                     AimVector;                                                // 0x0018(0x000C)
	class AActor*                                      HitActor;                                                 // 0x0024(0x0008)
	unsigned long                                      bResult : 1;                                              // 0x002C(0x0004)
};

// ScriptStruct TgGame.TgDevice.RollingLineAttack
// 0x003C
struct FRollingLineAttack
{
	struct FVector                                     vStartLocation;                                           // 0x0000(0x000C)
	struct FRotator                                    rStartRotation;                                           // 0x000C(0x000C)
	float                                              fStartTime;                                               // 0x0018(0x0004)
	float                                              fDuration;                                                // 0x001C(0x0004)
	float                                              fLastUpdatePercent;                                       // 0x0020(0x0004)
	int                                                nFiringInstance;                                          // 0x0024(0x0004)
	unsigned long                                      bUseProximityDistance : 1;                                // 0x0028(0x0004)
	TArray<class AActor*>                              HitActors;                                                // 0x002C(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgDevice_ArcingBeam.ArcTargetSequence
// 0x0034
struct FArcTargetSequence
{
	class AActor*                                      s_PreviousArcTarget;                                      // 0x0000(0x0008)
	TArray<class AActor*>                              s_PreviousTargets;                                        // 0x0008(0x0010) (NeedCtorLink)
	class UTgDeviceFire_ArcingBeam*                    s_ArcFiremode;                                            // 0x0018(0x0008)
	int                                                s_nFiringInstance;                                        // 0x0020(0x0004)
	int                                                s_nJumpsRemaining;                                        // 0x0024(0x0004)
	float                                              s_fPersistPulseTime;                                      // 0x0028(0x0004)
	float                                              s_fArcRange;                                              // 0x002C(0x0004)
	float                                              s_fTriggerTime;                                           // 0x0030(0x0004)
};

// ScriptStruct TgGame.TgDevice_CH05_Surtr_FireSpinAndTrail.SurtrDeployTouchStatus
// 0x000C
struct FSurtrDeployTouchStatus
{
	class AActor*                                      Other;                                                    // 0x0000(0x0008)
	int                                                NumTouches;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_ChainedMelee.AttackModeInfo
// 0x000C
struct FAttackModeInfo
{
	int                                                nAttackNum;                                               // 0x0000(0x0004)
	unsigned char                                      nMode;                                                    // 0x0004(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	float                                              fRefireTime;                                              // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_ActiveMode.ActiveModeInfo
// 0x0008
struct FActiveModeInfo
{
	int                                                ActiveMode;                                               // 0x0000(0x0004)
	int                                                AttackCounter;                                            // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgObject.ChargeHitInfo
// 0x000C
struct FChargeHitInfo
{
	class AActor*                                      HitActor;                                                 // 0x0000(0x0008)
	float                                              TimeStamp;                                                // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_CH06_TurtleSpin.TurtleSpinDeployTouchStatus
// 0x000C
struct FTurtleSpinDeployTouchStatus
{
	class AActor*                                      Other;                                                    // 0x0000(0x0008)
	int                                                NumTouches;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_Apep_AcidSpray.DeployTouchStatus
// 0x000C
struct FDeployTouchStatus
{
	class AActor*                                      Other;                                                    // 0x0000(0x0008)
	int                                                NumTouches;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_CH05_SunderEarth.SunderEarthDeployTouchStatus
// 0x000C
struct FSunderEarthDeployTouchStatus
{
	class AActor*                                      Other;                                                    // 0x0000(0x0008)
	int                                                NumTouches;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_Hydra_Arc.DEP_TOUCH_INFO
// 0x0018
struct FDEP_TOUCH_INFO
{
	class AActor*                                      Other;                                                    // 0x0000(0x0008)
	TArray<class ATgDeployable*>                       Deps;                                                     // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgDevice_Surtr_LavaPools.SurtrPoolDeployTouchStatus
// 0x000C
struct FSurtrPoolDeployTouchStatus
{
	class AActor*                                      Other;                                                    // 0x0000(0x0008)
	int                                                NumTouches;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_Dialogue.DialogueLineInfo
// 0x0010
struct FDialogueLineInfo
{
	int                                                m_nEffectGroupId;                                         // 0x0000(0x0004) (Const)
	int                                                m_nSituationalDialogueType;                               // 0x0004(0x0004) (Const)
	int                                                m_nSpeakerBotId;                                          // 0x0008(0x0004) (Const)
	float                                              m_fLifeTime;                                              // 0x000C(0x0004) (Const)
};

// ScriptStruct TgGame.TgDevice_Dialogue.DialogueInfo
// 0x003C
struct FDialogueInfo
{
	TArray<struct FDialogueLineInfo>                   m_Lines;                                                  // 0x0000(0x0010) (NeedCtorLink)
	TArray<int>                                        m_RequiredSpeakerIds;                                     // 0x0010(0x0010) (NeedCtorLink)
	struct FName                                       m_nmDamageTypeClass;                                      // 0x0020(0x0008) (Const)
	float                                              m_fPctChanceTrigger;                                      // 0x0028(0x0004) (Const)
	float                                              m_fMinInGameTriggerTime;                                  // 0x002C(0x0004) (Const)
	float                                              m_fMaxInGameTriggerTime;                                  // 0x0030(0x0004) (Const)
	float                                              m_fTotalLifeTime;                                         // 0x0034(0x0004) (Const)
	unsigned long                                      m_bHasBeenTriggeredOnce : 1;                              // 0x0038(0x0004)
};

// ScriptStruct TgGame.TgDevice_Dialogue_Arthurian.MerlinDialogueRestriction
// 0x0009
struct FMerlinDialogueRestriction
{
	struct FName                                       m_nmDamageTypeClass;                                      // 0x0000(0x0008)
	TEnumAsByte<EWizardType>                           m_wtWizardType;                                           // 0x0008(0x0001)
};

// ScriptStruct TgGame.TgDevice_CH05_LokiExsanguinate.ExsanguinateData
// 0x000C
struct FExsanguinateData
{
	class AActor*                                      HitActor;                                                 // 0x0000(0x0008)
	int                                                bleedStacks;                                              // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_FireGiant_RagnarokFury.RFPotentialTargetData
// 0x000C
struct FRFPotentialTargetData
{
	class ATgPawn*                                     TargetPawn;                                               // 0x0000(0x0008)
	float                                              Distance;                                                 // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_Surtr_SwordSwing.SurtrFanInformation
// 0x0010
struct FSurtrFanInformation
{
	int                                                nFiringInstanceId;                                        // 0x0000(0x0004)
	class AActor*                                      HitActor;                                                 // 0x0004(0x0008)
	int                                                nHits;                                                    // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgDevice_RadialSweep_MultiHit.MultiHitTrackingInfo
// 0x000C
struct FMultiHitTrackingInfo
{
	class AActor*                                      HitActor;                                                 // 0x0000(0x0008)
	int                                                nHitCounter;                                              // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDevice_WarningDeployable.WarningDeployableInfo
// 0x0010
struct FWarningDeployableInfo
{
	class ATgDeployable*                               WarningDeployable;                                        // 0x0000(0x0008)
	class ATgProjectile*                               Proj;                                                     // 0x0008(0x0008)
};

// ScriptStruct TgGame.TgDeviceFire.TGDFM_ANIM_SEQUENCE
// 0x0010
struct FTGDFM_ANIM_SEQUENCE
{
	int                                                nId;                                                      // 0x0000(0x0004)
	struct FName                                       nmSeqName;                                                // 0x0004(0x0008)
	unsigned long                                      bLeftHand : 1;                                            // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgObject.EquipDeviceInfo
// 0x000C
struct FEquipDeviceInfo
{
	int                                                nDeviceId;                                                // 0x0000(0x0004)
	int                                                nDeviceInstanceId;                                        // 0x0004(0x0004)
	int                                                nMode;                                                    // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDeviceForm.ModeData
// 0x0020
struct FModeData
{
	float                                              c_fEquipModeTime;                                         // 0x0000(0x0004) (AlwaysInit)
	float                                              c_fBuildupTime;                                           // 0x0004(0x0004) (AlwaysInit)
	unsigned long                                      c_bContinuousFire : 1;                                    // 0x0008(0x0004) (AlwaysInit)
	unsigned long                                      c_FxInstantFire : 1;                                      // 0x0008(0x0004) (AlwaysInit)
	struct FName                                       c_nmOffhandAnimationType;                                 // 0x000C(0x0008) (AlwaysInit)
	unsigned long                                      c_bScaleFireAnimsWithRefire : 1;                          // 0x0014(0x0004) (AlwaysInit)
	unsigned long                                      c_bInterruptAnimOnRefire : 1;                             // 0x0014(0x0004) (AlwaysInit)
	float                                              c_fEffectRadius;                                          // 0x0018(0x0004) (AlwaysInit)
	float                                              c_fFullBodyAnimTime;                                      // 0x001C(0x0004) (AlwaysInit)
};

// ScriptStruct TgGame.TgDeviceForm_MultipleTargetIndicator.FormTargetingInfo
// 0x0010
struct FFormTargetingInfo
{
	class UTgSpecialFx*                                Fx;                                                       // 0x0000(0x0008)
	class AActor*                                      Target;                                                   // 0x0008(0x0008)
};

// ScriptStruct TgGame.TgDeviceForm_SplineTarget.SplineContainer
// 0x0024
struct FSplineContainer
{
	struct FInterpCurveVector                          Spline;                                                   // 0x0000(0x0014) (NeedCtorLink)
	TArray<class ATgSplineLoftActorSpawnable*>         SplineActors;                                             // 0x0014(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgDeploy_AutoPortal.PortalExcludeInfo
// 0x000C
struct FPortalExcludeInfo
{
	class AActor*                                      Target;                                                   // 0x0000(0x0008)
	float                                              fTimeLeft;                                                // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDeploy_AutoPortal.PortalPermanentExcludeInfo
// 0x000C
struct FPortalPermanentExcludeInfo
{
	class AActor*                                      Target;                                                   // 0x0000(0x0008)
	int                                                nTimesUsed;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgDeploy_MovingEffectVolume.InterpAnchor
// 0x0024
struct FInterpAnchor
{
	struct FVector                                     LastLocation;                                             // 0x0000(0x000C)
	struct FRotator                                    LastRotation;                                             // 0x000C(0x000C)
	struct FName                                       SocketName;                                               // 0x0018(0x0008)
	unsigned long                                      bExists : 1;                                              // 0x0020(0x0004)
};

// ScriptStruct TgGame.TgDeployable_CTF_Flag.CarrierAbilityData
// 0x0038
struct FCarrierAbilityData
{
	class ATgPawn*                                     CarrierPawn;                                              // 0x0000(0x0008)
	class ATgDevice*                                   OriginalInhandDevice;                                     // 0x0008(0x0008)
	class ATgDevice*                                   OriginalRelic01Device;                                    // 0x0010(0x0008)
	class ATgDevice*                                   OriginalRelic02Device;                                    // 0x0018(0x0008)
	class ATgDevice*                                   ChargeDevice;                                             // 0x0020(0x0008)
	class ATgDevice*                                   MeleeDevice;                                              // 0x0028(0x0008)
	class ATgDevice*                                   ThrowDevice;                                              // 0x0030(0x0008)
};

// ScriptStruct TgGame.TgDeployable_CTF_Flag.ThrowLocationData
// 0x001C
struct FThrowLocationData
{
	int                                                ThrowCount;                                               // 0x0000(0x0004)
	struct FVector                                     ResultLocation;                                           // 0x0004(0x000C)
	struct FRotator                                    ResultRotation;                                           // 0x0010(0x000C)
};

// ScriptStruct TgGame.TgDeploy_Racer_TargetAhead.DelayedImpactByPlace
// 0x000C
struct FDelayedImpactByPlace
{
	class ATgPawn_Racer*                               racerTarget;                                              // 0x0000(0x0008)
	int                                                nPlacesAhead;                                             // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgSpecialFx.Fx_PSC
// 0x0035
struct FFx_PSC
{
	int                                                c_nId;                                                    // 0x0000(0x0004)
	class UParticleSystemComponent*                    c_PSC;                                                    // 0x0004(0x0008) (ExportObject, Component, EditInline)
	class UParticleSystem*                             c_PSCTemplate;                                            // 0x000C(0x0008) (Const)
	float                                              c_fScale;                                                 // 0x0014(0x0004)
	int                                                c_nScaleType;                                             // 0x0018(0x0004)
	unsigned long                                      c_bRunning : 1;                                           // 0x001C(0x0004)
	struct FName                                       c_nmSocketDisplayGrp;                                     // 0x0020(0x0008)
	struct FName                                       c_nmSocket;                                               // 0x0028(0x0008)
	unsigned long                                      c_bAbsoluteRotation : 1;                                  // 0x0030(0x0004)
	TEnumAsByte<ESceneDepthPriorityGroup>              c_eDepthPriorityGroup;                                    // 0x0034(0x0001)
};

// ScriptStruct TgGame.TgObject.PEPRewardEntry
// 0x0014
struct FPEPRewardEntry
{
	int                                                m_nRewardBotId;                                           // 0x0000(0x0004) (Edit)
	TEnumAsByte<EPEPRewardType>                        m_eRewardType;                                            // 0x0004(0x0001) (Edit)
	TEnumAsByte<EPEPRewardTier>                        m_eRewardTier;                                            // 0x0005(0x0001) (Edit)
	TEnumAsByte<EPEPPusherType>                        m_ePusherType;                                            // 0x0006(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0007(0x0001) MISSED OFFSET
	struct FName                                       m_nmTypeName;                                             // 0x0008(0x0008) (Edit)
	int                                                m_nSpawnMultiplier;                                       // 0x0010(0x0004) (Edit)
};

// ScriptStruct TgGame.TgObject.PEPRewardMap
// 0x001C
struct FPEPRewardMap
{
	struct FName                                       m_nmEntryName;                                            // 0x0000(0x0008) (Edit, Const)
	struct FPEPRewardEntry                             m_eRewardData;                                            // 0x0008(0x0014) (Edit)
};

// ScriptStruct TgGame.TgDeployable_Racer_Pickup.RacerLootData
// 0x0008
struct FRacerLootData
{
	int                                                ItemId;                                                   // 0x0000(0x0004)
	int                                                Weight;                                                   // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgDeployable_Racer_Pickup.RacerLootSet
// 0x0014
struct FRacerLootSet
{
	TArray<struct FRacerLootData>                      Data;                                                     // 0x0000(0x0010) (NeedCtorLink)
	int                                                TotalWeight;                                              // 0x0010(0x0004)
};

// ScriptStruct TgGame.TgDeployable_PortalEntrance.PortalTimer
// 0x000C
struct FPortalTimer
{
	class ATgPawn*                                     P;                                                        // 0x0000(0x0008)
	float                                              fTime;                                                    // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgTrailComponent_GroundTrail.TouchInfo
// 0x0018
struct FTouchInfo
{
	class AActor*                                      TouchedActor;                                             // 0x0000(0x0008)
	TArray<class ATgDeployable*>                       TouchingChildren;                                         // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgActor_DeathFog.FOG_CONFIG
// 0x0020
struct FFOG_CONFIG
{
	float                                              fSafeDistance;                                            // 0x0000(0x0004) (Edit)
	float                                              fPhaseDuration;                                           // 0x0004(0x0004) (Edit)
	float                                              fSpreadRate;                                              // 0x0008(0x0004) (Edit)
	float                                              fTickInterval;                                            // 0x000C(0x0004) (Edit)
	TArray<class AEmitter*>                            Emitters;                                                 // 0x0010(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgRepInfo_DeathFog.FOG_FX
// 0x0014
struct FFOG_FX
{
	unsigned long                                      bHasInitializedFx : 1;                                    // 0x0000(0x0004)
	unsigned long                                      bFogFxVisible : 1;                                        // 0x0000(0x0004)
	class ATgSurvivalFogVolumeDensityInfo*             sphericalFogFx;                                           // 0x0004(0x0008)
	class ATgSkeletalMeshActorSpawnable*               flatFogFx;                                                // 0x000C(0x0008)
};

// ScriptStruct TgGame.TgRepInfo_DeathFog.FOG_GROWTH
// 0x000C
struct FFOG_GROWTH
{
	unsigned long                                      bEnabled : 1;                                             // 0x0000(0x0004)
	float                                              fSafeRadius;                                              // 0x0004(0x0004)
	float                                              fSpreadRate;                                              // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgSoundGroup.FootstepSoundInfo
// 0x0010
struct FFootstepSoundInfo
{
	struct FName                                       MaterialType;                                             // 0x0000(0x0008)
	class USoundCue*                                   Sound;                                                    // 0x0008(0x0008)
};

// ScriptStruct TgGame.TgSpecialFx.Fx_Decal
// 0x0028
struct FFx_Decal
{
	int                                                c_nId;                                                    // 0x0000(0x0004)
	class UMaterialInterface*                          c_MaterialInterface;                                      // 0x0004(0x0008)
	float                                              c_fWidth;                                                 // 0x000C(0x0004)
	float                                              c_fHeight;                                                // 0x0010(0x0004)
	float                                              c_fThickness;                                             // 0x0014(0x0004)
	unsigned long                                      c_bNoClip : 1;                                            // 0x0018(0x0004)
	unsigned long                                      c_bAttach : 1;                                            // 0x0018(0x0004)
	class UDecalComponent*                             c_Decal;                                                  // 0x001C(0x0008) (ExportObject, Component, EditInline)
	float                                              c_fLifetime;                                              // 0x0024(0x0004)
};

// ScriptStruct TgGame.TgSpecialFx.Fx_Sound
// 0x0020
struct FFx_Sound
{
	int                                                c_nId;                                                    // 0x0000(0x0004)
	class USoundCue*                                   c_SoundCue;                                               // 0x0004(0x0008)
	class UAudioComponent*                             c_acSound;                                                // 0x000C(0x0008) (ExportObject, Component, EditInline)
	unsigned long                                      c_bAllowSoundToFinishFlag : 1;                            // 0x0014(0x0004)
	int                                                c_nAudienceType;                                          // 0x0018(0x0004)
	unsigned long                                      c_bForceAudioComponent : 1;                               // 0x001C(0x0004)
};

// ScriptStruct TgGame.TgSpecialFx.Fx_Material
// 0x0014
struct FFx_Material
{
	int                                                nFxMatId;                                                 // 0x0000(0x0004)
	int                                                nFxMatTypeCode;                                           // 0x0004(0x0004)
	struct FName                                       nmMIC;                                                    // 0x0008(0x0008)
	unsigned long                                      bApplyIfSameTeam : 1;                                     // 0x0010(0x0004)
};

// ScriptStruct TgGame.TgEffectForm.MicFxInfo
// 0x000C
struct FMicFxInfo
{
	class UMaterialInstanceConstant*                   m_micFx;                                                  // 0x0000(0x0008)
	unsigned long                                      c_bApplied : 1;                                           // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgObject.MicList
// 0x0010
struct FMicList
{
	TArray<class UMaterialInstanceConstant*>           m_micList;                                                // 0x0000(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgEffectForm_WithMeshes.EffectMeshInfo
// 0x0040
struct FEffectMeshInfo
{
	class UMeshComponent*                              Mesh;                                                     // 0x0000(0x0008) (ExportObject, Component, EditInline)
	struct FName                                       DisplayGroup;                                             // 0x0008(0x0008)
	struct FName                                       AnimName;                                                 // 0x0010(0x0008)
	struct FVector                                     vAdditiveTranslation;                                     // 0x0018(0x000C)
	struct FRotator                                    rAdditiveRotation;                                        // 0x0024(0x000C)
	float                                              fScaleMultipler;                                          // 0x0030(0x0004)
	int                                                nMeshId;                                                  // 0x0034(0x0004)
	int                                                nSkinId;                                                  // 0x0038(0x0004)
	unsigned long                                      AbsoluteTranslation : 1;                                  // 0x003C(0x0004)
	unsigned long                                      AbsoluteRotation : 1;                                     // 0x003C(0x0004)
	unsigned long                                      AbsoluteScale : 1;                                        // 0x003C(0x0004)
	unsigned long                                      bWillSelfDestruct : 1;                                    // 0x003C(0x0004)
	unsigned long                                      bUsesParentAnimComponent : 1;                             // 0x003C(0x0004)
	unsigned long                                      bLoopAnim : 1;                                            // 0x003C(0x0004)
};

// ScriptStruct TgGame.TgEffectManager.EffectListEntry
// 0x0018
struct FEffectListEntry
{
	int                                                nEffectGroupId;                                           // 0x0000(0x0004)
	int                                                nSourceItemId;                                            // 0x0004(0x0004)
	unsigned char                                      byNumStacks;                                              // 0x0008(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              fInitTimeRemaining;                                       // 0x000C(0x0004)
	int                                                nExtraInfo;                                               // 0x0010(0x0004)
	int                                                nInstigatorId;                                            // 0x0014(0x0004)
};

// ScriptStruct TgGame.TgEffectManager.EffectQueueEntry
// 0x0024
struct FEffectQueueEntry
{
	int                                                nEffectGroupId;                                           // 0x0000(0x0004)
	int                                                nExtraInfo;                                               // 0x0004(0x0004)
	int                                                nInstigatorInstId;                                        // 0x0008(0x0004)
	struct FVector                                     vHitLocation;                                             // 0x000C(0x000C)
	struct FRotator                                    rHitNormal;                                               // 0x0018(0x000C)
};

// ScriptStruct TgGame.TgEffectManager.StunStackEntry
// 0x0009
struct FStunStackEntry
{
	class UTgEffect*                                   Effect;                                                   // 0x0000(0x0008)
	TEnumAsByte<EStunType>                             StunType;                                                 // 0x0008(0x0001)
};

// ScriptStruct TgGame.TgEffectManager.RevealStackEntry
// 0x0014
struct FRevealStackEntry
{
	class UTgEffect*                                   Effect;                                                   // 0x0000(0x0008)
	TEnumAsByte<ERevealType>                           RevealType;                                               // 0x0008(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	class ATgRepInfo_Player*                           RevealedBy;                                               // 0x000C(0x0008)
};

// ScriptStruct TgGame.TgEffectManager.SlowToHaltMode
// 0x000C
struct FSlowToHaltMode
{
	class UTgDeviceFire*                               m_DeviceMode;                                             // 0x0000(0x0008)
	int                                                m_nFiringInstance;                                        // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgObject.ScoreKillData
// 0x00B4
struct FScoreKillData
{
	class AController*                                 Killer;                                                   // 0x0000(0x0008)
	class ATgRepInfo_Player*                           KillerPRI;                                                // 0x0008(0x0008)
	class ATgPawn*                                     KillerPawn;                                               // 0x0010(0x0008)
	struct FPointer                                    KillerBotAssembly;                                        // 0x0018(0x0008) (Native)
	unsigned long                                      bKillerIsGod : 1;                                         // 0x0020(0x0004)
	unsigned long                                      bKillerIsMinion : 1;                                      // 0x0020(0x0004)
	unsigned long                                      bKillerIsTower : 1;                                       // 0x0020(0x0004)
	class AController*                                 Victim;                                                   // 0x0024(0x0008)
	class ATgPawn*                                     VictimPawn;                                               // 0x002C(0x0008)
	class ATgRepInfo_Player*                           VictimPRI;                                                // 0x0034(0x0008)
	class ATgRepInfo_TaskForce*                        VictimTaskForce;                                          // 0x003C(0x0008)
	struct FPointer                                    VictimBotAssembly;                                        // 0x0044(0x0008) (Native)
	unsigned long                                      VictimCanScore : 1;                                       // 0x004C(0x0004)
	unsigned long                                      bVictimIsGod : 1;                                         // 0x004C(0x0004)
	unsigned long                                      bVictimIsMinion : 1;                                      // 0x004C(0x0004)
	unsigned long                                      bVictimIsTower : 1;                                       // 0x004C(0x0004)
	class AController*                                 Scorer;                                                   // 0x0050(0x0008)
	class ATgPawn*                                     ScorerPawn;                                               // 0x0058(0x0008)
	class ATgRepInfo_Player*                           ScorerPRI;                                                // 0x0060(0x0008)
	class ATgRepInfo_TaskForce*                        ScorerTaskForce;                                          // 0x0068(0x0008)
	unsigned long                                      ScorerCanScore : 1;                                       // 0x0070(0x0004)
	class AController*                                 KillerOverride;                                           // 0x0074(0x0008)
	class ATgPawn*                                     KillerOverridePawn;                                       // 0x007C(0x0008)
	class ATgRepInfo_Player*                           KillerOverridePRI;                                        // 0x0084(0x0008)
	class ATgRepInfo_TaskForce*                        KillerOverrideTaskForce;                                  // 0x008C(0x0008)
	unsigned long                                      KillerOverrideCanScore : 1;                               // 0x0094(0x0004)
	class UTgEffectGroup*                              KillingEffectGroup;                                       // 0x0098(0x0008)
	unsigned long                                      bSuicide : 1;                                             // 0x00A0(0x0004)
	unsigned long                                      bFirstBlood : 1;                                          // 0x00A0(0x0004)
	TArray<class ATgRepInfo_Player*>                   AssistingPlayers;                                         // 0x00A4(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgBotFactory.SpawnQueueEntry
// 0x0018
struct FSpawnQueueEntry
{
	float                                              fSpawnTime;                                               // 0x0000(0x0004)
	int                                                nBotId;                                                   // 0x0004(0x0004)
	int                                                nSkinId;                                                  // 0x0008(0x0004)
	int                                                nSpawnTableDetailId;                                      // 0x000C(0x0004)
	struct FName                                       BehaviorTreeOverride;                                     // 0x0010(0x0008)
};

// ScriptStruct TgGame.TgBotFactory.BuffMap
// 0x0010
struct FBuffMap
{
	int                                                nBotId;                                                   // 0x0000(0x0004) (Edit)
	int                                                nBuffId;                                                  // 0x0004(0x0004) (Edit)
	struct FName                                       nmAnimOverride;                                           // 0x0008(0x0008) (Edit)
};

// ScriptStruct TgGame.TgBotFactory.TeamBuffMap
// 0x000C
struct FTeamBuffMap
{
	int                                                nBotId;                                                   // 0x0000(0x0004) (Edit)
	int                                                nTeamBuffId;                                              // 0x0004(0x0004) (Edit)
	float                                              fUseAfterGameTime;                                        // 0x0008(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory.FactorySpawnModifier
// 0x000C
struct FFactorySpawnModifier
{
	int                                                nSpawnModifierItemId;                                     // 0x0000(0x0004)
	float                                              fSpawnModifierDuration;                                   // 0x0004(0x0004)
	int                                                nModifierStacks;                                          // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgBotFactory.AccoladeMap
// 0x0018
struct FAccoladeMap
{
	int                                                nBotId;                                                   // 0x0000(0x0004) (Edit)
	int                                                nAccoladeMessage;                                         // 0x0004(0x0004) (Edit)
	unsigned long                                      bTracksObjectiveSteal : 1;                                // 0x0008(0x0004) (Edit)
	unsigned long                                      bOverrideFriendlyMsg : 1;                                 // 0x0008(0x0004) (Edit)
	int                                                nSpectatorMessage;                                        // 0x000C(0x0004) (Edit)
	int                                                nEnemyMessage;                                            // 0x0010(0x0004) (Edit)
	int                                                nFriendlyMessage;                                         // 0x0014(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory.RewardModifiers
// 0x0028
struct FRewardModifiers
{
	float                                              fUseAfterTime;                                            // 0x0000(0x0004) (Edit)
	float                                              fUseUntilTime;                                            // 0x0004(0x0004) (Edit)
	TArray<int>                                        TaskForceList;                                            // 0x0008(0x0010) (Edit, NeedCtorLink)
	float                                              fGoldMultStart;                                           // 0x0018(0x0004) (Edit)
	float                                              fGoldMultEnd;                                             // 0x001C(0x0004) (Edit)
	float                                              fXPMultStart;                                             // 0x0020(0x0004) (Edit)
	float                                              fXPMultEnd;                                               // 0x0024(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory_LeashedConfigurable.LeashedBotEntry
// 0x0010
struct FLeashedBotEntry
{
	struct FName                                       EntryName;                                                // 0x0000(0x0008) (Edit)
	int                                                nBotId;                                                   // 0x0008(0x0004) (Edit)
	int                                                nBotSkin;                                                 // 0x000C(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory_LeashedConfigurable.LeashedBotQueueEntry
// 0x0010
struct FLeashedBotQueueEntry
{
	struct FName                                       EntryName;                                                // 0x0000(0x0008) (Edit)
	struct FName                                       BehaviorOverride;                                         // 0x0008(0x0008) (Edit)
};

// ScriptStruct TgGame.TgBotFactory_LeashedConfigurable.LeashedBotQueue
// 0x001C
struct FLeashedBotQueue
{
	TArray<struct FLeashedBotQueueEntry>               SpawnQueue;                                               // 0x0000(0x0010) (Edit, NeedCtorLink)
	float                                              fRespawnDelay;                                            // 0x0010(0x0004) (Edit)
	int                                                nVisualOverrideIndex;                                     // 0x0014(0x0004) (Edit)
	float                                              fUseAfterTime;                                            // 0x0018(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory_LeashedConfigurable.QueueProfile
// 0x0030
struct FQueueProfile
{
	TEnumAsByte<EQUEUESELECTIONTYPE>                   eSelectionType;                                           // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	TArray<struct FLeashedBotQueue>                    ProfileQueues;                                            // 0x0004(0x0010) (Edit, NeedCtorLink)
	float                                              fUseAfterTime;                                            // 0x0014(0x0004) (Edit)
	TArray<int>                                        nCustomOrder;                                             // 0x0018(0x0010) (Edit, NeedCtorLink)
	int                                                nCustomOrderIndex;                                        // 0x0028(0x0004)
	int                                                nStartingQueue;                                           // 0x002C(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory_LeashedConfigurable.IndicatorEntry
// 0x001C
struct FIndicatorEntry
{
	class UMaterialInstanceConstant*                   IndicatorMIC;                                             // 0x0000(0x0008) (Edit)
	TEnumAsByte<EMinimapFactoryType>                   MinimapType;                                              // 0x0008(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	TArray<class UMaterialInstanceConstant*>           InWorldMICs;                                              // 0x000C(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgBotFactory_Minions_Configurable.AdditionalBotData
// 0x000C
struct FAdditionalBotData
{
	int                                                nBotId;                                                   // 0x0000(0x0004)
	int                                                nSkinId;                                                  // 0x0004(0x0004)
	int                                                nQueueIndex;                                              // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgBotFactory_Minions_Configurable.BotEntryData
// 0x0018
struct FBotEntryData
{
	struct FName                                       EntryName;                                                // 0x0000(0x0008) (Edit)
	int                                                nBaseBotId;                                               // 0x0008(0x0004) (Edit)
	int                                                nBaseBotSkin;                                             // 0x000C(0x0004) (Edit)
	int                                                nSuperBotId;                                              // 0x0010(0x0004) (Edit)
	int                                                nSuperBotSkin;                                            // 0x0014(0x0004) (Edit)
};

// ScriptStruct TgGame.TgBotFactory_Minions_Configurable.QueueEntryData
// 0x0010
struct FQueueEntryData
{
	TArray<struct FName>                               Bots;                                                     // 0x0000(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgBotFactory_Minions_Configurable.SpawnQueueData
// 0x0014
struct FSpawnQueueData
{
	float                                              fUseAfterTime;                                            // 0x0000(0x0004) (Edit)
	TArray<struct FQueueEntryData>                     SpawnEntries;                                             // 0x0004(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgInventory_BuildCache.BuildItem
// 0x0010
struct FBuildItem
{
	TArray<int>                                        m_BuildItemIds;                                           // 0x0000(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgInventory_BuildCache.BuildLibrary
// 0x0010
struct FBuildLibrary
{
	TArray<struct FBuildItem>                          m_Builds;                                                 // 0x0000(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgInventory_BuildCache.BotBuildPair
// 0x000C
struct FBotBuildPair
{
	TEnumAsByte<EConquestRole>                         m_eRole;                                                  // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                m_nGameType;                                              // 0x0004(0x0004)
	int                                                m_nBuildIndex;                                            // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventory_BuildCache.BotBuildMap
// 0x0014
struct FBotBuildMap
{
	int                                                m_nBotId;                                                 // 0x0000(0x0004)
	TArray<struct FBotBuildPair>                       m_BuildPairs;                                             // 0x0004(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgInventory_BuildCache.BuildMap
// 0x0018
struct FBuildMap
{
	int                                                m_nModeType;                                              // 0x0000(0x0004)
	int                                                m_nDefaultGameMode;                                       // 0x0004(0x0004)
	TArray<struct FBotBuildMap>                        m_BotBuilds;                                              // 0x0008(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgInventory_BuildCache.TeamComp
// 0x0005
struct FTeamComp
{
	unsigned char                                      m_bytHunters;                                             // 0x0000(0x0001)
	unsigned char                                      m_bytGuardians;                                           // 0x0001(0x0001)
	unsigned char                                      m_bytMages;                                               // 0x0002(0x0001)
	unsigned char                                      m_bytAssassins;                                           // 0x0003(0x0001)
	unsigned char                                      m_bytWarriors;                                            // 0x0004(0x0001)
};

// ScriptStruct TgGame.TgRepInfo_Player_BotShop.BotUnit
// 0x000C
struct FBotUnit
{
	int                                                m_nBotId;                                                 // 0x0000(0x0004) (Const)
	int                                                m_nCost;                                                  // 0x0004(0x0004) (Const)
	int                                                m_nEffectGroupId;                                         // 0x0008(0x0004) (Const)
};

// ScriptStruct TgGame.TgInventory_RandomizedShop.InventoryList
// 0x0010
struct FInventoryList
{
	TArray<int>                                        m_nItems;                                                 // 0x0000(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgInventoryManager.CourierTransaction
// 0x001D
struct FCourierTransaction
{
	TEnumAsByte<EPendingTransactionType>               Type;                                                     // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ItemId;                                                   // 0x0004(0x0004)
	int                                                ItemCount;                                                // 0x0008(0x0004)
	int                                                InventoryId;                                              // 0x000C(0x0004)
	int                                                Currency;                                                 // 0x0010(0x0004)
	class ATgPawn_Courier*                             Courier;                                                  // 0x0014(0x0008)
	TEnumAsByte<ECourierPetPhase>                      CourierPhase;                                             // 0x001C(0x0001)
};

// ScriptStruct TgGame.TgInventoryManager.InventoryTransaction
// 0x001C
struct FInventoryTransaction
{
	TEnumAsByte<EPendingTransactionType>               Type;                                                     // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ExistingObjectInvId;                                      // 0x0004(0x0004)
	int                                                NewObjectInvId;                                           // 0x0008(0x0004)
	int                                                nInstanceCountChange;                                     // 0x000C(0x0004)
	int                                                nGoldValue;                                               // 0x0010(0x0004)
	int                                                nEqpPoint;                                                // 0x0014(0x0004)
	float                                              fCooldown;                                                // 0x0018(0x0004)
};

// ScriptStruct TgGame.TgInventoryManager.ItemStatsDetail
// 0x000C
struct FItemStatsDetail
{
	int                                                nItemId;                                                  // 0x0000(0x0004)
	unsigned long                                      bSell : 1;                                                // 0x0004(0x0004)
	float                                              fMissionTime;                                             // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryManager.AutoPurchaseItem
// 0x0008
struct FAutoPurchaseItem
{
	int                                                nItemId;                                                  // 0x0000(0x0004)
	int                                                nQuantity;                                                // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgInventoryManager.sInventoryStackItem
// 0x0009
struct FsInventoryStackItem
{
	class UTgInventoryObject_Device*                   Device;                                                   // 0x0000(0x0008)
	TEnumAsByte<ETG_EQUIP_POINT>                       OldEquipPoint;                                            // 0x0008(0x0001)
};

// ScriptStruct TgGame.TgInventoryManager.InventoryData
// 0x001C
struct FInventoryData
{
	int                                                nInvId;                                                   // 0x0000(0x0004) (AlwaysInit)
	int                                                nItemId;                                                  // 0x0004(0x0004) (AlwaysInit)
	int                                                nInstanceCount;                                           // 0x0008(0x0004) (AlwaysInit)
	unsigned long                                      bBoundFlag : 1;                                           // 0x000C(0x0004) (AlwaysInit)
	float                                              fAcquiredDatetime;                                        // 0x0010(0x0004) (AlwaysInit)
	int                                                nEquipSlotValueId;                                        // 0x0014(0x0004) (AlwaysInit)
	int                                                nRequiredLevel;                                           // 0x0018(0x0004) (AlwaysInit)
};

// ScriptStruct TgGame.TgInventoryObject.DeviceInstanceTracker
// 0x000C
struct FDeviceInstanceTracker
{
	class ATgDevice*                                   m_dev;                                                    // 0x0000(0x0008) (Const)
	int                                                m_nFiringInstance;                                        // 0x0008(0x0004) (Const)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_Arondight.RevealedPawn
// 0x000C
struct FRevealedPawn
{
	class ATgPawn*                                     TargetPawn;                                               // 0x0000(0x0008)
	unsigned long                                      bHasBeenHit : 1;                                          // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_StaffOfMyrddin.AffectedDevice
// 0x000C
struct FAffectedDevice
{
	class ATgDevice*                                   m_Device;                                                 // 0x0000(0x0008)
	int                                                m_nFiringInstance;                                        // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_DeviceTracked.DTFireInstanceData
// 0x0014
struct FDTFireInstanceData
{
	int                                                DeviceID;                                                 // 0x0000(0x0004)
	TArray<int>                                        FiringInstances;                                          // 0x0004(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_DynastyPlateHelm.BUFFED_AUTO_INFO
// 0x0008
struct FBUFFED_AUTO_INFO
{
	int                                                nDevId;                                                   // 0x0000(0x0004)
	int                                                nFiringInstance;                                          // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_Ancile_S3_6.CooldownModifierInfo
// 0x0010
struct FCooldownModifierInfo
{
	class ATgDevice*                                   ModifiedDevice;                                           // 0x0000(0x0008)
	float                                              ModifiedCooldown;                                         // 0x0008(0x0004)
	unsigned long                                      bDidModify : 1;                                           // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_Effect_Shockwave_OnHitHigherLevel.TGHHL_HITINFO
// 0x0008
struct FTGHHL_HITINFO
{
	int                                                nDeviceId;                                                // 0x0000(0x0004)
	int                                                nLastTrackedFiringInstance;                               // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_PotionOfMagMight.DeviceToReduce
// 0x000C
struct FDeviceToReduce
{
	int                                                m_nDeviceId;                                              // 0x0000(0x0004)
	int                                                m_nFiringInst;                                            // 0x0004(0x0004)
	unsigned long                                      m_bCooldownReduced : 1;                                   // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_HitByOffhand.CastTrackingHitInfo
// 0x0008
struct FCastTrackingHitInfo
{
	int                                                nDeviceId;                                                // 0x0000(0x0004)
	int                                                nFiringInstance;                                          // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_InHand_OncePerCast.DEV_INST_INFO
// 0x0014
struct FDEV_INST_INFO
{
	int                                                nDev;                                                     // 0x0000(0x0004)
	TArray<int>                                        TrackedInstances;                                         // 0x0004(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_OffHand.CastTrackingInfo
// 0x000C
struct FCastTrackingInfo
{
	int                                                nTargetId;                                                // 0x0000(0x0004)
	int                                                nDeviceId;                                                // 0x0004(0x0004)
	int                                                nFiringInstance;                                          // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_OffHand_IncrementalDamage.IncrementalDamageTracker
// 0x000C (0x0018 - 0x000C)
struct FIncrementalDamageTracker : public FDeviceInstanceTracker
{
	class AActor*                                      m_hitActor;                                               // 0x000C(0x0008) (Const)
	int                                                m_nHitCount;                                              // 0x0014(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_ConduitGem.StacksTrackingInfo
// 0x000C
struct FStacksTrackingInfo
{
	int                                                nStacks;                                                  // 0x0000(0x0004)
	int                                                nDeviceId;                                                // 0x0004(0x0004)
	int                                                nFiringInstance;                                          // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_HeartSeeker_S6.HeartSeekerHitTracker
// 0x000C
struct FHeartSeekerHitTracker
{
	class AActor*                                      m_trackedTarget;                                          // 0x0000(0x0008) (Const)
	float                                              m_fTimeSinceLastHit;                                      // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_SoulReaverS6.SRPrevHitInfo
// 0x0010
struct FSRPrevHitInfo
{
	class ATgPawn*                                     PrevHitTarget;                                            // 0x0000(0x0008)
	float                                              fPrevHitTime;                                             // 0x0008(0x0004)
	int                                                nTargetHitCount;                                          // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_RewardBoots.RewardHitInfo
// 0x0018
struct FRewardHitInfo
{
	class ATgPawn_Character*                           m_GodPawn;                                                // 0x0000(0x0008)
	class UObject*                                     m_DeviceModeReference;                                    // 0x0008(0x0008)
	int                                                m_nFiringInstance;                                        // 0x0010(0x0004)
	float                                              m_fLastHitTime;                                           // 0x0014(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_DamageOrHeal.DOHFireInstanceCount
// 0x0008
struct FDOHFireInstanceCount
{
	int                                                nFiringInstance;                                          // 0x0000(0x0004)
	int                                                nAbilityCount;                                            // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_DamageOrHeal.DOHFireInstanceData
// 0x0014
struct FDOHFireInstanceData
{
	int                                                DeviceID;                                                 // 0x0000(0x0004)
	TArray<struct FDOHFireInstanceCount>               FireInstanceCounts;                                       // 0x0004(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_KillStackRandom.StackTypeProps
// 0x0010
struct FStackTypeProps
{
	int                                                m_nEffectGroupId;                                         // 0x0000(0x0004) (Const)
	int                                                m_nStackTypeSitType;                                      // 0x0004(0x0004) (Const)
	int                                                m_nStackTypeMax;                                          // 0x0008(0x0004) (Const)
	int                                                m_nStackTypeCurrent;                                      // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_SoulStone_S3.SoulStoneTrackingData
// 0x000C
struct FSoulStoneTrackingData
{
	int                                                DeviceID;                                                 // 0x0000(0x0004)
	int                                                FiringInstance;                                           // 0x0004(0x0004)
	unsigned long                                      ConsumedStacks : 1;                                       // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_Heartseeker_S4.FireInstanceData
// 0x0008
struct FFireInstanceData
{
	int                                                DeviceID;                                                 // 0x0000(0x0004)
	int                                                FiringInstance;                                           // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_Stack_BonusDamageAtMax_DeviceTracked.BDAMFireInstanceData
// 0x0014
struct FBDAMFireInstanceData
{
	int                                                DeviceID;                                                 // 0x0000(0x0004)
	TArray<int>                                        FiringInstances;                                          // 0x0004(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgInventoryObject_Listen_UndoRelic.HistoryElement
// 0x0008
struct FHistoryElement
{
	int                                                m_delta;                                                  // 0x0000(0x0004)
	float                                              m_timestamp;                                              // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgObject.MeshAssets
// 0x0040
struct FMeshAssets
{
	struct FString                                     m_sSkeletalMesh;                                          // 0x0000(0x0010) (Edit, NeedCtorLink)
	struct FString                                     m_sPhysicsAsset;                                          // 0x0010(0x0010) (Edit, NeedCtorLink)
	struct FString                                     m_sAnimTreeTemplate;                                      // 0x0020(0x0010) (Edit, NeedCtorLink)
	struct FString                                     m_sAnimSets;                                              // 0x0030(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct TgGame.TgMeshPool.MeshPool
// 0x0010
struct FMeshPool
{
	TArray<class ATgSkeletalMeshActorSpawnable*>       m_meshes;                                                 // 0x0000(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgPawn.SpawnedAnimNotifyMeshEntry
// 0x0010
struct FSpawnedAnimNotifyMeshEntry
{
	class ATgSkeletalMeshActorSpawnable*               SpawnedMesh;                                              // 0x0000(0x0008)
	class UAnimNotify*                                 AnimNotifyData;                                           // 0x0008(0x0008)
};

// ScriptStruct TgGame.TgPawn.AnimNotifyAudioEntry
// 0x0010
struct FAnimNotifyAudioEntry
{
	class USoundCue*                                   PlayedCue;                                                // 0x0000(0x0008)
	float                                              fLastTime;                                                // 0x0008(0x0004)
	int                                                nGroupNum;                                                // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgObject.OnHealedParams
// 0x009C
struct FOnHealedParams
{
	class ATgPawn*                                     Healer;                                                   // 0x0000(0x0008)
	class ATgDevice*                                   Dev;                                                      // 0x0008(0x0008)
	class UTgEffectGroup*                              eg;                                                       // 0x0010(0x0008)
	struct FImpactInfo                                 Impact;                                                   // 0x0018(0x0078) (Component)
	float                                              fHealAmount;                                              // 0x0090(0x0004)
	float                                              fHealthChange;                                            // 0x0094(0x0004)
	int                                                nPropertyId;                                              // 0x0098(0x0004)
};

// ScriptStruct TgGame.TgObject.OnDodgedParams
// 0x0020
struct FOnDodgedParams
{
	class ATgPawn*                                     attacker;                                                 // 0x0000(0x0008)
	class ATgDevice*                                   Dev;                                                      // 0x0008(0x0008)
	class UTgDeviceFire*                               DeviceMode;                                               // 0x0010(0x0008)
	class AActor*                                      DodgingActor;                                             // 0x0018(0x0008)
};

// ScriptStruct TgGame.TgObject.OnAbsorbHitParams
// 0x0028
struct FOnAbsorbHitParams
{
	class ATgPawn*                                     attacker;                                                 // 0x0000(0x0008)
	class ATgDevice*                                   Dev;                                                      // 0x0008(0x0008)
	class UTgDeviceFire*                               DeviceMode;                                               // 0x0010(0x0008)
	class UTgEffectGroup*                              AbsorbedEG;                                               // 0x0018(0x0008)
	class AActor*                                      AbsorbingActor;                                           // 0x0020(0x0008)
};

// ScriptStruct TgGame.TgPawn.GravityModifierInfo
// 0x0008
struct FGravityModifierInfo
{
	unsigned long                                      bEnable : 1;                                              // 0x0000(0x0004)
	float                                              fMultipler;                                               // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgPawn.DeathStampFlashInfo
// 0x0005
struct FDeathStampFlashInfo
{
	int                                                nPawnId;                                                  // 0x0000(0x0004)
	unsigned char                                      nTicker;                                                  // 0x0004(0x0001)
};

// ScriptStruct TgGame.TgPawn.GlobalEmoteInfo
// 0x0006
struct FGlobalEmoteInfo
{
	int                                                nSkinId;                                                  // 0x0000(0x0004)
	unsigned char                                      nTicker;                                                  // 0x0004(0x0001)
	unsigned char                                      nFilters;                                                 // 0x0005(0x0001)
};

// ScriptStruct TgGame.TgPawn.DeployWallPushingInfo
// 0x0014
struct FDeployWallPushingInfo
{
	class ATgDeploy_Wall*                              OverlappingWall;                                          // 0x0000(0x0008)
	struct FVector                                     PushingVector;                                            // 0x0008(0x000C)
};

// ScriptStruct TgGame.TgPawn.PostureStack
// 0x0024
struct FPostureStack
{
	TArray<int>                                        GUIDs;                                                    // 0x0000(0x0010) (NeedCtorLink)
	TArray<TEnumAsByte<ETG_POSTURE>>                   Postures;                                                 // 0x0010(0x0010) (NeedCtorLink)
	int                                                NewPostureGUID;                                           // 0x0020(0x0004)
};

// ScriptStruct TgGame.TgPawn.PawnDamagerStruct
// 0x000C
struct FPawnDamagerStruct
{
	class ATgPawn*                                     DamagerPawn;                                              // 0x0000(0x0008)
	float                                              fTimestamp;                                               // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgPawn.OverlayMICList
// 0x0010
struct FOverlayMICList
{
	TArray<class UMaterialInstanceConstant*>           MICs;                                                     // 0x0000(0x0010) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct TgGame.TgPawn.OverlayInfo
// 0x006D
struct FOverlayInfo
{
	class UTgSkeletalMeshComponent*                    OverlayMesh;                                              // 0x0000(0x0008) (ExportObject, Component, EditInline)
	class UTgSilhouetteComponent*                      Silhouette;                                               // 0x0008(0x0008) (ExportObject, Component, EditInline)
	class USkeletalMeshComponent*                      ParentMesh;                                               // 0x0010(0x0008) (ExportObject, Component, EditInline)
	unsigned long                                      bSetPhysAsset : 1;                                        // 0x0018(0x0004)
	struct FOverlayMICList                             OverlayMICInstances[0x5];                                 // 0x001C(0x0010) (NeedCtorLink)
	TEnumAsByte<EOverlayState>                         CurrentState;                                             // 0x006C(0x0001)
};

// ScriptStruct TgGame.TgPawn.SpawnedSkelMeshEntry
// 0x0020
struct FSpawnedSkelMeshEntry
{
	int                                                nMeshId;                                                  // 0x0000(0x0004)
	class ATgSkeletalMeshActorSpawnable*               SpawnedMesh;                                              // 0x0004(0x0008)
	class UTgSkeletalMeshComponent*                    SpawnedMeshComp;                                          // 0x000C(0x0008) (ExportObject, Component, EditInline)
	class UTgAnimNodeSlot*                             FullBodyNode;                                             // 0x0014(0x0008)
	int                                                nActiveCount;                                             // 0x001C(0x0004)
};

// ScriptStruct TgGame.TgPawn.HealingInfo
// 0x0008
struct FHealingInfo
{
	float                                              HealAmount;                                               // 0x0000(0x0004)
	float                                              TimeStamp;                                                // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgPawn.ManaHealToHealth
// 0x0008
struct FManaHealToHealth
{
	unsigned long                                      m_bApplyManaHealToHealth : 1;                             // 0x0000(0x0004)
	unsigned long                                      m_bUseHealthCalculations : 1;                             // 0x0000(0x0004)
	float                                              m_fPercManaHealToHealth;                                  // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgPawn.FloorPortalTweenInfo
// 0x0014
struct FFloorPortalTweenInfo
{
	TEnumAsByte<EFloorPortalState>                     FloorPortalState;                                         // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     StartPosition;                                            // 0x0004(0x000C)
	float                                              StartVelocityZ;                                           // 0x0010(0x0004)
};

// ScriptStruct TgGame.TgPawn.ExternalCameraOverrides
// 0x001C
struct FExternalCameraOverrides
{
	struct FVector                                     m_vAbsoluteOffset;                                        // 0x0000(0x000C)
	struct FVector                                     m_vScaledByZoomOffset;                                    // 0x000C(0x000C)
	float                                              m_fZoomOverride;                                          // 0x0018(0x0004)
};

// ScriptStruct TgGame.TgPawn.MicOverridesMap
// 0x0010
struct FMicOverridesMap
{
	TArray<struct FMicList>                            m_micOverrides;                                           // 0x0000(0x0010) (NeedCtorLink)
};

// ScriptStruct TgGame.TgPawn_Character.PERSISTENT_BUFF_STRUCT
// 0x0014
struct FPERSISTENT_BUFF_STRUCT
{
	int                                                nItemId;                                                  // 0x0000(0x0004)
	int                                                nPropId;                                                  // 0x0004(0x0004)
	float                                              fValue;                                                   // 0x0008(0x0004)
	struct FQWord                                      nExpireDateTime;                                          // 0x000C(0x0008)
};

// ScriptStruct TgGame.TgPawn_Character.DEATH_CAM_ZOOM
// 0x000C
struct FDEATH_CAM_ZOOM
{
	unsigned long                                      bUsesDeathZoomOverride : 1;                               // 0x0000(0x0004)
	float                                              fDeathZoom;                                               // 0x0004(0x0004)
	float                                              fDeathZoomTweenTime;                                      // 0x0008(0x0004)
};

// ScriptStruct TgGame.TgPawn_MeshSwapper.CachedStanceObject
// 0x0038
struct FCachedStanceObject
{
	int                                                nBaseMeshId;                                              // 0x0000(0x0004)
	struct FPointer                                    StanceMeshAssembly;                                       // 0x0004(0x0008) (Native)
	struct FPointer                                    StanceDestroyedMeshAssembly;                              // 0x000C(0x0008) (Native)
	TArray<class ATgDevice*>                           StanceDevices;                                            // 0x0014(0x0010) (AlwaysInit, NeedCtorLink)
	struct FName                                       fnMeshSwapBodyAnim;                                       // 0x0024(0x0008)
	float                                              fBlendInTime;                                             // 0x002C(0x0004)
	float                                              fBlendOutTime;                                            // 0x0030(0x0004)
	unsigned long                                      bDoesFullBodyOnSwap : 1;                                  // 0x0034(0x0004)
};

// ScriptStruct TgGame.TgPawn_MeshSwapper.StanceInfo
// 0x0038
struct FStanceInfo
{
	int                                                nMeshId;                                                  // 0x0000(0x0004)
	TArray<int>                                        nDeviceIds;                                               // 0x0004(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<int>                                        nDeviceEqPoints;                                          // 0x0014(0x0010) (AlwaysInit, NeedCtorLink)
	struct FName                                       fnMeshSwapBodyAnim;                                       // 0x0024(0x0008)
	float                                              fBlendInTime;                                             // 0x002C(0x0004)
	float                                              fBlendOutTime;                                            // 0x0030(0x0004)
	unsigned long                                      bDoesFullBodyOnSwap : 1;                                  // 0x0034(0x0004)
};

// ScriptStruct TgGame.TgPawn_Racer.RacerAnimInstanceData
// 0x0008
struct FRacerAnimInstanceData
{
	TEnumAsByte<ERacerActionAnimNames>                 Current;                                                  // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Index;                                                    // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgPawn_Racer.RacerSoundData
// 0x0010
struct FRacerSoundData
{
	class USoundCue*                                   Cue;                                                      // 0x0000(0x0008)
	float                                              LastTriggerTime;                                          // 0x0008(0x0004)
	unsigned long                                      ConditionMet : 1;                                         // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgPawn_Minion.FireMinionIds
// 0x0050
struct FFireMinionIds
{
	TArray<int>                                        m_nConquestFireMinions;                                   // 0x0000(0x0010) (Const, NeedCtorLink)
	TArray<int>                                        m_nJoustFireMinions;                                      // 0x0010(0x0010) (Const, NeedCtorLink)
	TArray<int>                                        m_nClashFireMinions;                                      // 0x0020(0x0010) (Const, NeedCtorLink)
	TArray<int>                                        m_nAssaultFireMinions;                                    // 0x0030(0x0010) (Const, NeedCtorLink)
	TArray<int>                                        m_nSiegeFireMinions;                                      // 0x0040(0x0010) (Const, NeedCtorLink)
};

// ScriptStruct TgGame.TgPawn_Juggernaut.MinionSpawnInfo
// 0x003C
struct FMinionSpawnInfo
{
	float                                              fSpawnDelay;                                              // 0x0000(0x0004)
	struct FName                                       DeathAnimName;                                            // 0x0004(0x0008)
	struct FVector                                     vSpawnLocations[0x2];                                     // 0x000C(0x000C)
	struct FRotator                                    rSpawnRotations[0x2];                                     // 0x0024(0x000C)
};

// ScriptStruct TgGame.TgPawn_Totem_JungleShrine_Conquest_S7.ChaliceInfo
// 0x001C
struct FChaliceInfo
{
	class UTgStaticMeshComponent*                      m_Mesh;                                                   // 0x0000(0x0008) (ExportObject, Component, EditInline)
	struct FVector                                     m_vLocation;                                              // 0x0008(0x000C)
	class UTgSpecialFx*                                m_auraFx;                                                 // 0x0014(0x0008)
};

// ScriptStruct TgGame.TgPawn_SplineCart.ServerSplineSync
// 0x0010
struct FServerSplineSync
{
	class ATgSplineActor*                              Spline;                                                   // 0x0000(0x0008)
	float                                              SplineDist;                                               // 0x0008(0x0004)
	unsigned long                                      bMoving : 1;                                              // 0x000C(0x0004)
};

// ScriptStruct TgGame.TgPawn_Courier.CourierPhaseState
// 0x000C
struct FCourierPhaseState
{
	TEnumAsByte<ECourierPetPhase>                      Phase;                                                    // 0x0000(0x0001)
	TEnumAsByte<EPendingTransactionType>               TransactionType;                                          // 0x0001(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	class ATgPawn*                                     Customer;                                                 // 0x0004(0x0008)
};

// ScriptStruct TgGame.TgPawn_Phoenix.NavMeshBorderEdges
// 0x0018
struct FNavMeshBorderEdges
{
	struct FVector                                     P1;                                                       // 0x0000(0x000C)
	struct FVector                                     P2;                                                       // 0x000C(0x000C)
};

// ScriptStruct TgGame.TgPawn_Djinni.ScalingProp
// 0x0008
struct FScalingProp
{
	int                                                Id;                                                       // 0x0000(0x0004)
	float                                              Value;                                                    // 0x0004(0x0004)
};

// ScriptStruct TgGame.TgPawn_Tower_Obelisk.TowerBeamInfo
// 0x0010
struct FTowerBeamInfo
{
	class ATgPawn*                                     TargetActor;                                              // 0x0000(0x0008)
	class UTgSpecialFx*                                TowerBeamFx;                                              // 0x0008(0x0008)
};

// ScriptStruct TgGame.TgSpectatorController.SpectatorBookmark
// 0x0030
struct FSpectatorBookmark
{
	class AActor*                                      ViewTarget;                                               // 0x0000(0x0008) (Transient)
	TEnumAsByte<ESpectatorCameraMode>                  ViewMode;                                                 // 0x0008(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FTPOV                                       POV;                                                      // 0x000C(0x0024)
};

// ScriptStruct TgGame.TgSpectatorController.BroadcastChannel
// 0x0008
struct FBroadcastChannel
{
	TEnumAsByte<ESpectatorMode>                        Channel;                                                  // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
